Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/test_app/firmware/src/packs/PIC32WM_BZ6204_DFP/component/adchs.h
/* -------- ADCHS_ADCCON2SET : (ADCHS Offset: 0x18) (R/W 32) Bit set register -------- */
#define ADCHS_ADCCON2SET_RESETVALUE           _UINT32_(0x00)                                       /*  (ADCHS_ADCCON2SET) Bit set register  Reset Value */

#define ADCHS_ADCCON2SET_Msk                  _UINT32_(0x00000000)                                 /* (ADCHS_ADCCON2SET) Register Mask  */


/* -------- ADCHS_ADCCON2INV : (ADCHS Offset: 0x1C) (R/W 32) Bit invert register -------- */
#define ADCHS_ADCCON2INV_RESETVALUE           _UINT32_(0x00)                                       /*  (ADCHS_ADCCON2INV) Bit invert register  Reset Value */

#define ADCHS_ADCCON2INV_Msk                  _UINT32_(0x00000000)                                 /* (ADCHS_ADCCON2INV) Register Mask  */


/* -------- ADCHS_ADCCON3 : (ADCHS Offset: 0x20) (R/W 32)  -------- */
#define ADCHS_ADCCON3_RESETVALUE              _UINT32_(0x00)                                       /*  (ADCHS_ADCCON3)   Reset Value */

#define ADCHS_ADCCON3_ADINSEL_Pos             _UINT32_(0)                                          /* (ADCHS_ADCCON3) Analog Input Select bits Position */
#define ADCHS_ADCCON3_ADINSEL_Msk             (_UINT32_(0x3F) << ADCHS_ADCCON3_ADINSEL_Pos)        /* (ADCHS_ADCCON3) Analog Input Select bits Mask */
#define ADCHS_ADCCON3_ADINSEL(value)          (ADCHS_ADCCON3_ADINSEL_Msk & (_UINT32_(value) << ADCHS_ADCCON3_ADINSEL_Pos)) /* Assignment of value for ADINSEL in the ADCHS_ADCCON3 register */
#define   ADCHS_ADCCON3_ADINSEL_TMP_SENSE_Val _UINT32_(0x16)                                       /* (ADCHS_ADCCON3) CTMU Temperature Sensor (internal AN22)  */
#define   ADCHS_ADCCON3_ADINSEL_VBATDIV2_SENSE_Val _UINT32_(0x15)                                       /* (ADCHS_ADCCON3) VBAT/2 (internal AN21)  */
#define   ADCHS_ADCCON3_ADINSEL_1P2V_SENSE_Val _UINT32_(0x14)                                       /* (ADCHS_ADCCON3) IVref 1.2V (internal AN20)  */
#define   ADCHS_ADCCON3_ADINSEL_BGREF_Val     _UINT32_(0x13)                                       /* (ADCHS_ADCCON3) BandGap Reference (internal AN19)  */
#define   ADCHS_ADCCON3_ADINSEL_AN18_Val      _UINT32_(0x12)                                       /* (ADCHS_ADCCON3) AN18  */
#define   ADCHS_ADCCON3_ADINSEL_AN17_Val      _UINT32_(0x11)                                       /* (ADCHS_ADCCON3) AN17  */
#define   ADCHS_ADCCON3_ADINSEL_AN16_Val      _UINT32_(0x10)                                       /* (ADCHS_ADCCON3) AN16  */
#define   ADCHS_ADCCON3_ADINSEL_AN15_Val      _UINT32_(0xF)                                        /* (ADCHS_ADCCON3) AN15  */
#define   ADCHS_ADCCON3_ADINSEL_AN14_Val      _UINT32_(0xE)                                        /* (ADCHS_ADCCON3) AN14  */
#define   ADCHS_ADCCON3_ADINSEL_AN13_Val      _UINT32_(0xD)                                        /* (ADCHS_ADCCON3) AN13  */
#define   ADCHS_ADCCON3_ADINSEL_AN12_Val      _UINT32_(0xC)                                        /* (ADCHS_ADCCON3) AN12  */
#define   ADCHS_ADCCON3_ADINSEL_AN11_Val      _UINT32_(0xB)                                        /* (ADCHS_ADCCON3) AN11  */
#define   ADCHS_ADCCON3_ADINSEL_AN10_Val      _UINT32_(0xA)                                        /* (ADCHS_ADCCON3) AN10  */
#define   ADCHS_ADCCON3_ADINSEL_AN9_Val       _UINT32_(0x9)                                        /* (ADCHS_ADCCON3) AN9  */
#define   ADCHS_ADCCON3_ADINSEL_AN8_Val       _UINT32_(0x8)                                        /* (ADCHS_ADCCON3) AN8  */
#define   ADCHS_ADCCON3_ADINSEL_AN7_Val       _UINT32_(0x7)                                        /* (ADCHS_ADCCON3) AN7  */
#define   ADCHS_ADCCON3_ADINSEL_AN6_Val       _UINT32_(0x6)                                        /* (ADCHS_ADCCON3) AN6  */
#define   ADCHS_ADCCON3_ADINSEL_AN5_Val       _UINT32_(0x5)                                        /* (ADCHS_ADCCON3) AN5  */
#define   ADCHS_ADCCON3_ADINSEL_AN4_Val       _UINT32_(0x4)                                        /* (ADCHS_ADCCON3) AN4  */
#define   ADCHS_ADCCON3_ADINSEL_AN3_Val       _UINT32_(0x3)                                        /* (ADCHS_ADCCON3) AN3  */
#define   ADCHS_ADCCON3_ADINSEL_AN2_Val       _UINT32_(0x2)                                        /* (ADCHS_ADCCON3) AN2  */
#define   ADCHS_ADCCON3_ADINSEL_AN1_Val       _UINT32_(0x1)                                        /* (ADCHS_ADCCON3) AN1  */
#define   ADCHS_ADCCON3_ADINSEL_AN0_Val       _UINT32_(0x0)                                        /* (ADCHS_ADCCON3) AN0  */
#define ADCHS_ADCCON3_ADINSEL_TMP_SENSE       (ADCHS_ADCCON3_ADINSEL_TMP_SENSE_Val << ADCHS_ADCCON3_ADINSEL_Pos) /* (ADCHS_ADCCON3) CTMU Temperature Sensor (internal AN22) Position */
#define ADCHS_ADCCON3_ADINSEL_VBATDIV2_SENSE  (ADCHS_ADCCON3_ADINSEL_VBATDIV2_SENSE_Val << ADCHS_ADCCON3_ADINSEL_Pos) /* (ADCHS_ADCCON3) VBAT/2 (internal AN21) Position */
#define ADCHS_ADCCON3_ADINSEL_1P2V_SENSE      (ADCHS_ADCCON3_ADINSEL_1P2V_SENSE_Val << ADCHS_ADCCON3_ADINSEL_Pos) /* (ADCHS_ADCCON3) IVref 1.2V (internal AN20) Position */
#define ADCHS_ADCCON3_ADINSEL_BGREF           (ADCHS_ADCCON3_ADINSEL_BGREF_Val << ADCHS_ADCCON3_ADINSEL_Pos) /* (ADCHS_ADCCON3) BandGap Reference (internal AN19) Position */
#define ADCHS_ADCCON3_ADINSEL_AN18            (ADCHS_ADCCON3_ADINSEL_AN18_Val << ADCHS_ADCCON3_ADINSEL_Pos) /* (ADCHS_ADCCON3) AN18 Position */
#define ADCHS_ADCCON3_ADINSEL_AN17            (ADCHS_ADCCON3_ADINSEL_AN17_Val << ADCHS_ADCCON3_ADINSEL_Pos) /* (ADCHS_ADCCON3) AN17 Position */
#define ADCHS_ADCCON3_ADINSEL_AN16            (ADCHS_ADCCON3_ADINSEL_AN16_Val << ADCHS_ADCCON3_ADINSEL_Pos) /* (ADCHS_ADCCON3) AN16 Position */
#define ADCHS_ADCCON3_ADINSEL_AN15            (ADCHS_ADCCON3_ADINSEL_AN15_Val << ADCHS_ADCCON3_ADINSEL_Pos) /* (ADCHS_ADCCON3) AN15 Position */
#define ADCHS_ADCCON3_ADINSEL_AN14            (ADCHS_ADCCON3_ADINSEL_AN14_Val << ADCHS_ADCCON3_ADINSEL_Pos) /* (ADCHS_ADCCON3) AN14 Position */
#define ADCHS_ADCCON3_ADINSEL_AN13            (ADCHS_ADCCON3_ADINSEL_AN13_Val << ADCHS_ADCCON3_ADINSEL_Pos) /* (ADCHS_ADCCON3) AN13 Position */
#define ADCHS_ADCCON3_ADINSEL_AN12            (ADCHS_ADCCON3_ADINSEL_AN12_Val << ADCHS_ADCCON3_ADINSEL_Pos) /* (ADCHS_ADCCON3) AN12 Position */
#define ADCHS_ADCCON3_ADINSEL_AN11            (ADCHS_ADCCON3_ADINSEL_AN11_Val << ADCHS_ADCCON3_ADINSEL_Pos) /* (ADCHS_ADCCON3) AN11 Position */
#define ADCHS_ADCCON3_ADINSEL_AN10            (ADCHS_ADCCON3_ADINSEL_AN10_Val << ADCHS_ADCCON3_ADINSEL_Pos) /* (ADCHS_ADCCON3) AN10 Position */
#define ADCHS_ADCCON3_ADINSEL_AN9             (ADCHS_ADCCON3_ADINSEL_AN9_Val << ADCHS_ADCCON3_ADINSEL_Pos) /* (ADCHS_ADCCON3) AN9 Position */
#define ADCHS_ADCCON3_ADINSEL_AN8             (ADCHS_ADCCON3_ADINSEL_AN8_Val << ADCHS_ADCCON3_ADINSEL_Pos) /* (ADCHS_ADCCON3) AN8 Position */
#define ADCHS_ADCCON3_ADINSEL_AN7             (ADCHS_ADCCON3_ADINSEL_AN7_Val << ADCHS_ADCCON3_ADINSEL_Pos) /* (ADCHS_ADCCON3) AN7 Position */
#define ADCHS_ADCCON3_ADINSEL_AN6             (ADCHS_ADCCON3_ADINSEL_AN6_Val << ADCHS_ADCCON3_ADINSEL_Pos) /* (ADCHS_ADCCON3) AN6 Position */
#define ADCHS_ADCCON3_ADINSEL_AN5             (ADCHS_ADCCON3_ADINSEL_AN5_Val << ADCHS_ADCCON3_ADINSEL_Pos) /* (ADCHS_ADCCON3) AN5 Position */
#define ADCHS_ADCCON3_ADINSEL_AN4             (ADCHS_ADCCON3_ADINSEL_AN4_Val << ADCHS_ADCCON3_ADINSEL_Pos) /* (ADCHS_ADCCON3) AN4 Position */
#define ADCHS_ADCCON3_ADINSEL_AN3             (ADCHS_ADCCON3_ADINSEL_AN3_Val << ADCHS_ADCCON3_ADINSEL_Pos) /* (ADCHS_ADCCON3) AN3 Position */
#define ADCHS_ADCCON3_ADINSEL_AN2             (ADCHS_ADCCON3_ADINSEL_AN2_Val << ADCHS_ADCCON3_ADINSEL_Pos) /* (ADCHS_ADCCON3) AN2 Position */
#define ADCHS_ADCCON3_ADINSEL_AN1             (ADCHS_ADCCON3_ADINSEL_AN1_Val << ADCHS_ADCCON3_ADINSEL_Pos) /* (ADCHS_ADCCON3) AN1 Position */
#define ADCHS_ADCCON3_ADINSEL_AN0             (ADCHS_ADCCON3_ADINSEL_AN0_Val << ADCHS_ADCCON3_ADINSEL_Pos) /* (ADCHS_ADCCON3) AN0 Position */
#define ADCHS_ADCCON3_GSWTRG_Pos              _UINT32_(6)                                          /* (ADCHS_ADCCON3) Global Software Trigger bit Position */
#define ADCHS_ADCCON3_GSWTRG_Msk              (_UINT32_(0x1) << ADCHS_ADCCON3_GSWTRG_Pos)          /* (ADCHS_ADCCON3) Global Software Trigger bit Mask */
#define ADCHS_ADCCON3_GSWTRG(value)           (ADCHS_ADCCON3_GSWTRG_Msk & (_UINT32_(value) << ADCHS_ADCCON3_GSWTRG_Pos)) /* Assignment of value for GSWTRG in the ADCHS_ADCCON3 register */
#define   ADCHS_ADCCON3_GSWTRG_GSWTRG_Val     _UINT32_(0x1)                                        /* (ADCHS_ADCCON3) Trigger conversion for ADC inputs that have selected the GSWTRG bit as either through the associated TRGSRC bits in the ADCTRGx registers or through the STRGSRC<4:0> bits in the ADCCON1 register the trigger signal  */
#define   ADCHS_ADCCON3_GSWTRG_NO_GSWTRG_Val  _UINT32_(0x0)                                        /* (ADCHS_ADCCON3) Do not trigger an analog-to-digital conversion  */
#define ADCHS_ADCCON3_GSWTRG_GSWTRG           (ADCHS_ADCCON3_GSWTRG_GSWTRG_Val << ADCHS_ADCCON3_GSWTRG_Pos) /* (ADCHS_ADCCON3) Trigger conversion for ADC inputs that have selected the GSWTRG bit as either through the associated TRGSRC bits in the ADCTRGx registers or through the STRGSRC<4:0> bits in the ADCCON1 register the trigger signal Position */
#define ADCHS_ADCCON3_GSWTRG_NO_GSWTRG        (ADCHS_ADCCON3_GSWTRG_NO_GSWTRG_Val << ADCHS_ADCCON3_GSWTRG_Pos) /* (ADCHS_ADCCON3) Do not trigger an analog-to-digital conversion Position */
#define ADCHS_ADCCON3_GLSWTRG_Pos             _UINT32_(7)                                          /* (ADCHS_ADCCON3) Global Level Software Trigger bit Position */
#define ADCHS_ADCCON3_GLSWTRG_Msk             (_UINT32_(0x1) << ADCHS_ADCCON3_GLSWTRG_Pos)         /* (ADCHS_ADCCON3) Global Level Software Trigger bit Mask */
#define ADCHS_ADCCON3_GLSWTRG(value)          (ADCHS_ADCCON3_GLSWTRG_Msk & (_UINT32_(value) << ADCHS_ADCCON3_GLSWTRG_Pos)) /* Assignment of value for GLSWTRG in the ADCHS_ADCCON3 register */
#define   ADCHS_ADCCON3_GLSWTRG_GLSWTRG_Val   _UINT32_(0x1)                                        /* (ADCHS_ADCCON3) Trigger conversion for ADC inputs that have selected the GLSWTRG bit as the trigger signal  */
#define   ADCHS_ADCCON3_GLSWTRG_NO_GLSWTRG_Val _UINT32_(0x0)                                        /* (ADCHS_ADCCON3) Do not trigger an analog-to-digital conversion  */
#define ADCHS_ADCCON3_GLSWTRG_GLSWTRG         (ADCHS_ADCCON3_GLSWTRG_GLSWTRG_Val << ADCHS_ADCCON3_GLSWTRG_Pos) /* (ADCHS_ADCCON3) Trigger conversion for ADC inputs that have selected the GLSWTRG bit as the trigger signal Position */
#define ADCHS_ADCCON3_GLSWTRG_NO_GLSWTRG      (ADCHS_ADCCON3_GLSWTRG_NO_GLSWTRG_Val << ADCHS_ADCCON3_GLSWTRG_Pos) /* (ADCHS_ADCCON3) Do not trigger an analog-to-digital conversion Position */
#define ADCHS_ADCCON3_RQCNVRT_Pos             _UINT32_(8)                                          /* (ADCHS_ADCCON3) Individual ADC Input Conversion Request bit Position */
#define ADCHS_ADCCON3_RQCNVRT_Msk             (_UINT32_(0x1) << ADCHS_ADCCON3_RQCNVRT_Pos)         /* (ADCHS_ADCCON3) Individual ADC Input Conversion Request bit Mask */
#define ADCHS_ADCCON3_RQCNVRT(value)          (ADCHS_ADCCON3_RQCNVRT_Msk & (_UINT32_(value) << ADCHS_ADCCON3_RQCNVRT_Pos)) /* Assignment of value for RQCNVRT in the ADCHS_ADCCON3 register */
#define   ADCHS_ADCCON3_RQCNVRT_IND_TRIGGER_Val _UINT32_(0x1)                                        /* (ADCHS_ADCCON3) Trigger the conversion of the selected ADC input as specified by the ADINSEL bits  */
#define   ADCHS_ADCCON3_RQCNVRT_NO_TRIGGER_Val _UINT32_(0x0)                                        /* (ADCHS_ADCCON3) Do not trigger the conversion  */
#define ADCHS_ADCCON3_RQCNVRT_IND_TRIGGER     (ADCHS_ADCCON3_RQCNVRT_IND_TRIGGER_Val << ADCHS_ADCCON3_RQCNVRT_Pos) /* (ADCHS_ADCCON3) Trigger the conversion of the selected ADC input as specified by the ADINSEL bits Position */
#define ADCHS_ADCCON3_RQCNVRT_NO_TRIGGER      (ADCHS_ADCCON3_RQCNVRT_NO_TRIGGER_Val << ADCHS_ADCCON3_RQCNVRT_Pos) /* (ADCHS_ADCCON3) Do not trigger the conversion Position */
#define ADCHS_ADCCON3_SAMP_Pos                _UINT32_(9)                                          /* (ADCHS_ADCCON3) Shared ADC7 Analog Input Sampling Enable bit  Position */
#define ADCHS_ADCCON3_SAMP_Msk                (_UINT32_(0x1) << ADCHS_ADCCON3_SAMP_Pos)            /* (ADCHS_ADCCON3) Shared ADC7 Analog Input Sampling Enable bit  Mask */
#define ADCHS_ADCCON3_SAMP(value)             (ADCHS_ADCCON3_SAMP_Msk & (_UINT32_(value) << ADCHS_ADCCON3_SAMP_Pos)) /* Assignment of value for SAMP in the ADCHS_ADCCON3 register */
#define   ADCHS_ADCCON3_SAMP_SAMPLE_Val       _UINT32_(0x1)                                        /* (ADCHS_ADCCON3) The ADC S&H amplifier is sampling  */
#define   ADCHS_ADCCON3_SAMP_HOLD_Val         _UINT32_(0x0)                                        /* (ADCHS_ADCCON3) The ADC S&H amplifier is holding  */
#define ADCHS_ADCCON3_SAMP_SAMPLE             (ADCHS_ADCCON3_SAMP_SAMPLE_Val << ADCHS_ADCCON3_SAMP_Pos) /* (ADCHS_ADCCON3) The ADC S&H amplifier is sampling Position */
#define ADCHS_ADCCON3_SAMP_HOLD               (ADCHS_ADCCON3_SAMP_HOLD_Val << ADCHS_ADCCON3_SAMP_Pos) /* (ADCHS_ADCCON3) The ADC S&H amplifier is holding Position */
#define ADCHS_ADCCON3_UPDRDY_Pos              _UINT32_(10)                                         /* (ADCHS_ADCCON3) ADC Update Ready Status bit Position */
#define ADCHS_ADCCON3_UPDRDY_Msk              (_UINT32_(0x1) << ADCHS_ADCCON3_UPDRDY_Pos)          /* (ADCHS_ADCCON3) ADC Update Ready Status bit Mask */
#define ADCHS_ADCCON3_UPDRDY(value)           (ADCHS_ADCCON3_UPDRDY_Msk & (_UINT32_(value) << ADCHS_ADCCON3_UPDRDY_Pos)) /* Assignment of value for UPDRDY in the ADCHS_ADCCON3 register */
#define   ADCHS_ADCCON3_UPDRDY_UPDATE_RDY_Val _UINT32_(0x1)                                        /* (ADCHS_ADCCON3) ADC SFRs can be updated  */
#define   ADCHS_ADCCON3_UPDRDY_UPDATE_NOT_RDY_Val _UINT32_(0x0)                                        /* (ADCHS_ADCCON3) ADC SFRs cannot be updated  */
#define ADCHS_ADCCON3_UPDRDY_UPDATE_RDY       (ADCHS_ADCCON3_UPDRDY_UPDATE_RDY_Val << ADCHS_ADCCON3_UPDRDY_Pos) /* (ADCHS_ADCCON3) ADC SFRs can be updated Position */
#define ADCHS_ADCCON3_UPDRDY_UPDATE_NOT_RDY   (ADCHS_ADCCON3_UPDRDY_UPDATE_NOT_RDY_Val << ADCHS_ADCCON3_UPDRDY_Pos) /* (ADCHS_ADCCON3) ADC SFRs cannot be updated Position */
#define ADCHS_ADCCON3_UPDIEN_Pos              _UINT32_(11)                                         /* (ADCHS_ADCCON3) Update Ready Interrupt Enable bit Position */
#define ADCHS_ADCCON3_UPDIEN_Msk              (_UINT32_(0x1) << ADCHS_ADCCON3_UPDIEN_Pos)          /* (ADCHS_ADCCON3) Update Ready Interrupt Enable bit Mask */
#define ADCHS_ADCCON3_UPDIEN(value)           (ADCHS_ADCCON3_UPDIEN_Msk & (_UINT32_(value) << ADCHS_ADCCON3_UPDIEN_Pos)) /* Assignment of value for UPDIEN in the ADCHS_ADCCON3 register */
#define   ADCHS_ADCCON3_UPDIEN_INT_ON_UPDATE_RDY_Val _UINT32_(0x1)                                        /* (ADCHS_ADCCON3) Interrupt will be generated when the UPDRDY bit is set by hardware  */
#define   ADCHS_ADCCON3_UPDIEN_NO_INT_ON_UPDATE_RDY_Val _UINT32_(0x0)                                        /* (ADCHS_ADCCON3) No interrupt is generated  */
#define ADCHS_ADCCON3_UPDIEN_INT_ON_UPDATE_RDY (ADCHS_ADCCON3_UPDIEN_INT_ON_UPDATE_RDY_Val << ADCHS_ADCCON3_UPDIEN_Pos) /* (ADCHS_ADCCON3) Interrupt will be generated when the UPDRDY bit is set by hardware Position */
#define ADCHS_ADCCON3_UPDIEN_NO_INT_ON_UPDATE_RDY (ADCHS_ADCCON3_UPDIEN_NO_INT_ON_UPDATE_RDY_Val << ADCHS_ADCCON3_UPDIEN_Pos) /* (ADCHS_ADCCON3) No interrupt is generated Position */
#define ADCHS_ADCCON3_TRGSUSP_Pos             _UINT32_(12)                                         /* (ADCHS_ADCCON3) Trigger Suspend bit Position */
#define ADCHS_ADCCON3_TRGSUSP_Msk             (_UINT32_(0x1) << ADCHS_ADCCON3_TRGSUSP_Pos)         /* (ADCHS_ADCCON3) Trigger Suspend bit Mask */
#define ADCHS_ADCCON3_TRGSUSP(value)          (ADCHS_ADCCON3_TRGSUSP_Msk & (_UINT32_(value) << ADCHS_ADCCON3_TRGSUSP_Pos)) /* Assignment of value for TRGSUSP in the ADCHS_ADCCON3 register */
#define   ADCHS_ADCCON3_TRGSUSP_TRIG_BLOCKED_Val _UINT32_(0x1)                                        /* (ADCHS_ADCCON3) Triggers are blocked from starting a new analog-to-digital conversion  */
#define   ADCHS_ADCCON3_TRGSUSP_TRIG_NOT_BLOCKED_Val _UINT32_(0x0)                                        /* (ADCHS_ADCCON3) Triggers are not blocked  */
#define ADCHS_ADCCON3_TRGSUSP_TRIG_BLOCKED    (ADCHS_ADCCON3_TRGSUSP_TRIG_BLOCKED_Val << ADCHS_ADCCON3_TRGSUSP_Pos) /* (ADCHS_ADCCON3) Triggers are blocked from starting a new analog-to-digital conversion Position */
#define ADCHS_ADCCON3_TRGSUSP_TRIG_NOT_BLOCKED (ADCHS_ADCCON3_TRGSUSP_TRIG_NOT_BLOCKED_Val << ADCHS_ADCCON3_TRGSUSP_Pos) /* (ADCHS_ADCCON3) Triggers are not blocked Position */
#define ADCHS_ADCCON3_VREFSEL_Pos             _UINT32_(13)                                         /* (ADCHS_ADCCON3) Voltage Reference Input Selection bits Position */
#define ADCHS_ADCCON3_VREFSEL_Msk             (_UINT32_(0x7) << ADCHS_ADCCON3_VREFSEL_Pos)         /* (ADCHS_ADCCON3) Voltage Reference Input Selection bits Mask */
#define ADCHS_ADCCON3_VREFSEL(value)          (ADCHS_ADCCON3_VREFSEL_Msk & (_UINT32_(value) << ADCHS_ADCCON3_VREFSEL_Pos)) /* Assignment of value for VREFSEL in the ADCHS_ADCCON3 register */
#define   ADCHS_ADCCON3_VREFSEL_AVDD_AVSS_Val _UINT32_(0x0)                                        /* (ADCHS_ADCCON3) ADC VREFH is AVDD, ADC VREFL is AVSS  */
#define ADCHS_ADCCON3_VREFSEL_AVDD_AVSS       (ADCHS_ADCCON3_VREFSEL_AVDD_AVSS_Val << ADCHS_ADCCON3_VREFSEL_Pos) /* (ADCHS_ADCCON3) ADC VREFH is AVDD, ADC VREFL is AVSS Position */
#define ADCHS_ADCCON3_DIGEN0_Pos              _UINT32_(16)                                         /* (ADCHS_ADCCON3) ADC0 Digital Enable bit Position */
#define ADCHS_ADCCON3_DIGEN0_Msk              (_UINT32_(0x1) << ADCHS_ADCCON3_DIGEN0_Pos)          /* (ADCHS_ADCCON3) ADC0 Digital Enable bit Mask */
#define ADCHS_ADCCON3_DIGEN0(value)           (ADCHS_ADCCON3_DIGEN0_Msk & (_UINT32_(value) << ADCHS_ADCCON3_DIGEN0_Pos)) /* Assignment of value for DIGEN0 in the ADCHS_ADCCON3 register */
#define   ADCHS_ADCCON3_DIGEN0_ADC0_DIG_EN_Val _UINT32_(0x1)                                        /* (ADCHS_ADCCON3) ADC0 is digital enabled (required for active operation)  */
#define   ADCHS_ADCCON3_DIGEN0_ADC0_DIG_DIS_Val _UINT32_(0x0)                                        /* (ADCHS_ADCCON3) ADC0 is digital disabled (power-saving mode)  */
#define ADCHS_ADCCON3_DIGEN0_ADC0_DIG_EN      (ADCHS_ADCCON3_DIGEN0_ADC0_DIG_EN_Val << ADCHS_ADCCON3_DIGEN0_Pos) /* (ADCHS_ADCCON3) ADC0 is digital enabled (required for active operation) Position */
#define ADCHS_ADCCON3_DIGEN0_ADC0_DIG_DIS     (ADCHS_ADCCON3_DIGEN0_ADC0_DIG_DIS_Val << ADCHS_ADCCON3_DIGEN0_Pos) /* (ADCHS_ADCCON3) ADC0 is digital disabled (power-saving mode) Position */
#define ADCHS_ADCCON3_DIGEN7_Pos              _UINT32_(23)                                         /* (ADCHS_ADCCON3) Shared ADC (ADC7) Digital Enable bit Position */
#define ADCHS_ADCCON3_DIGEN7_Msk              (_UINT32_(0x1) << ADCHS_ADCCON3_DIGEN7_Pos)          /* (ADCHS_ADCCON3) Shared ADC (ADC7) Digital Enable bit Mask */
#define ADCHS_ADCCON3_DIGEN7(value)           (ADCHS_ADCCON3_DIGEN7_Msk & (_UINT32_(value) << ADCHS_ADCCON3_DIGEN7_Pos)) /* Assignment of value for DIGEN7 in the ADCHS_ADCCON3 register */
#define ADCHS_ADCCON3_CONCLKDIV_Pos           _UINT32_(24)                                         /* (ADCHS_ADCCON3) Analog-to-Digital Control Clock Divider bits Position */
#define ADCHS_ADCCON3_CONCLKDIV_Msk           (_UINT32_(0x3F) << ADCHS_ADCCON3_CONCLKDIV_Pos)      /* (ADCHS_ADCCON3) Analog-to-Digital Control Clock Divider bits Mask */
#define ADCHS_ADCCON3_CONCLKDIV(value)        (ADCHS_ADCCON3_CONCLKDIV_Msk & (_UINT32_(value) << ADCHS_ADCCON3_CONCLKDIV_Pos)) /* Assignment of value for CONCLKDIV in the ADCHS_ADCCON3 register */
#define ADCHS_ADCCON3_ADCSEL_Pos              _UINT32_(30)                                         /* (ADCHS_ADCCON3) Analog-to-Digital Clock Source bits Position */
#define ADCHS_ADCCON3_ADCSEL_Msk              (_UINT32_(0x3) << ADCHS_ADCCON3_ADCSEL_Pos)          /* (ADCHS_ADCCON3) Analog-to-Digital Clock Source bits Mask */
#define ADCHS_ADCCON3_ADCSEL(value)           (ADCHS_ADCCON3_ADCSEL_Msk & (_UINT32_(value) << ADCHS_ADCCON3_ADCSEL_Pos)) /* Assignment of value for ADCSEL in the ADCHS_ADCCON3 register */
#define   ADCHS_ADCCON3_ADCSEL_SYSCLK_Val     _UINT32_(0x3)                                        /* (ADCHS_ADCCON3) SYSCLK  */
#define   ADCHS_ADCCON3_ADCSEL_REFCLK3_Val    _UINT32_(0x2)                                        /* (ADCHS_ADCCON3) REFCLK3  */
#define   ADCHS_ADCCON3_ADCSEL_FRC_Val        _UINT32_(0x1)                                        /* (ADCHS_ADCCON3) FRC  */
#define   ADCHS_ADCCON3_ADCSEL_PBCLK1_Val     _UINT32_(0x0)                                        /* (ADCHS_ADCCON3) PBCLK1  */
#define ADCHS_ADCCON3_ADCSEL_SYSCLK           (ADCHS_ADCCON3_ADCSEL_SYSCLK_Val << ADCHS_ADCCON3_ADCSEL_Pos) /* (ADCHS_ADCCON3) SYSCLK Position */
#define ADCHS_ADCCON3_ADCSEL_REFCLK3          (ADCHS_ADCCON3_ADCSEL_REFCLK3_Val << ADCHS_ADCCON3_ADCSEL_Pos) /* (ADCHS_ADCCON3) REFCLK3 Position */
#define ADCHS_ADCCON3_ADCSEL_FRC              (ADCHS_ADCCON3_ADCSEL_FRC_Val << ADCHS_ADCCON3_ADCSEL_Pos) /* (ADCHS_ADCCON3) FRC Position */
#define ADCHS_ADCCON3_ADCSEL_PBCLK1           (ADCHS_ADCCON3_ADCSEL_PBCLK1_Val << ADCHS_ADCCON3_ADCSEL_Pos) /* (ADCHS_ADCCON3) PBCLK1 Position */
#define ADCHS_ADCCON3_Msk                     _UINT32_(0xFF81FFFF)                                 /* (ADCHS_ADCCON3) Register Mask  */

#define ADCHS_ADCCON3_DIGEN_Pos               _UINT32_(16)                                         /* (ADCHS_ADCCON3 Position) ADCx Digital Enable bit */
#define ADCHS_ADCCON3_DIGEN_Msk               (_UINT32_(0x3) << ADCHS_ADCCON3_DIGEN_Pos)           /* (ADCHS_ADCCON3 Mask) DIGEN */
#define ADCHS_ADCCON3_DIGEN(value)            (ADCHS_ADCCON3_DIGEN_Msk & (_UINT32_(value) << ADCHS_ADCCON3_DIGEN_Pos)) 

/* -------- ADCHS_ADCCON3CLR : (ADCHS Offset: 0x24) (R/W 32) Bit clear register -------- */
#define ADCHS_ADCCON3CLR_RESETVALUE           _UINT32_(0x00)                                       /*  (ADCHS_ADCCON3CLR) Bit clear register  Reset Value */

