Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/test_app/firmware/src/packs/PIC32WM_BZ6204_DFP/component/adchs.h
#define   ADCHS_ADCIMCON1_SIGN8_SIGNED_Val    _UINT32_(0x1)                                        /* (ADCHS_ADCIMCON1) AN8 is using Signed Data mode  */
#define   ADCHS_ADCIMCON1_SIGN8_UNSIGNED_Val  _UINT32_(0x0)                                        /* (ADCHS_ADCIMCON1) AN8 is using Unsigned Data mode  */
#define ADCHS_ADCIMCON1_SIGN8_SIGNED          (ADCHS_ADCIMCON1_SIGN8_SIGNED_Val << ADCHS_ADCIMCON1_SIGN8_Pos) /* (ADCHS_ADCIMCON1) AN8 is using Signed Data mode Position */
#define ADCHS_ADCIMCON1_SIGN8_UNSIGNED        (ADCHS_ADCIMCON1_SIGN8_UNSIGNED_Val << ADCHS_ADCIMCON1_SIGN8_Pos) /* (ADCHS_ADCIMCON1) AN8 is using Unsigned Data mode Position */
#define ADCHS_ADCIMCON1_DIFF8_Pos             _UINT32_(17)                                         /* (ADCHS_ADCIMCON1) AN8 Mode bit Position */
#define ADCHS_ADCIMCON1_DIFF8_Msk             (_UINT32_(0x1) << ADCHS_ADCIMCON1_DIFF8_Pos)         /* (ADCHS_ADCIMCON1) AN8 Mode bit Mask */
#define ADCHS_ADCIMCON1_DIFF8(value)          (ADCHS_ADCIMCON1_DIFF8_Msk & (_UINT32_(value) << ADCHS_ADCIMCON1_DIFF8_Pos)) /* Assignment of value for DIFF8 in the ADCHS_ADCIMCON1 register */
#define   ADCHS_ADCIMCON1_DIFF8_DIFF_Val      _UINT32_(0x1)                                        /* (ADCHS_ADCIMCON1) Selects AN8 differential input pair as AN8+ and ANN0-  */
#define   ADCHS_ADCIMCON1_DIFF8_SINGLE_Val    _UINT32_(0x0)                                        /* (ADCHS_ADCIMCON1) AN8 is using Single-ended mode  */
#define ADCHS_ADCIMCON1_DIFF8_DIFF            (ADCHS_ADCIMCON1_DIFF8_DIFF_Val << ADCHS_ADCIMCON1_DIFF8_Pos) /* (ADCHS_ADCIMCON1) Selects AN8 differential input pair as AN8+ and ANN0- Position */
#define ADCHS_ADCIMCON1_DIFF8_SINGLE          (ADCHS_ADCIMCON1_DIFF8_SINGLE_Val << ADCHS_ADCIMCON1_DIFF8_Pos) /* (ADCHS_ADCIMCON1) AN8 is using Single-ended mode Position */
#define ADCHS_ADCIMCON1_SIGN9_Pos             _UINT32_(18)                                         /* (ADCHS_ADCIMCON1) AN9 Signed Data Mode bit Position */
#define ADCHS_ADCIMCON1_SIGN9_Msk             (_UINT32_(0x1) << ADCHS_ADCIMCON1_SIGN9_Pos)         /* (ADCHS_ADCIMCON1) AN9 Signed Data Mode bit Mask */
#define ADCHS_ADCIMCON1_SIGN9(value)          (ADCHS_ADCIMCON1_SIGN9_Msk & (_UINT32_(value) << ADCHS_ADCIMCON1_SIGN9_Pos)) /* Assignment of value for SIGN9 in the ADCHS_ADCIMCON1 register */
#define   ADCHS_ADCIMCON1_SIGN9_SIGNED_Val    _UINT32_(0x1)                                        /* (ADCHS_ADCIMCON1) AN9 is using Signed Data mode  */
#define   ADCHS_ADCIMCON1_SIGN9_UNSIGNED_Val  _UINT32_(0x0)                                        /* (ADCHS_ADCIMCON1) AN9 is using Unsigned Data mode  */
#define ADCHS_ADCIMCON1_SIGN9_SIGNED          (ADCHS_ADCIMCON1_SIGN9_SIGNED_Val << ADCHS_ADCIMCON1_SIGN9_Pos) /* (ADCHS_ADCIMCON1) AN9 is using Signed Data mode Position */
#define ADCHS_ADCIMCON1_SIGN9_UNSIGNED        (ADCHS_ADCIMCON1_SIGN9_UNSIGNED_Val << ADCHS_ADCIMCON1_SIGN9_Pos) /* (ADCHS_ADCIMCON1) AN9 is using Unsigned Data mode Position */
#define ADCHS_ADCIMCON1_DIFF9_Pos             _UINT32_(19)                                         /* (ADCHS_ADCIMCON1) AN9 Mode bit Position */
#define ADCHS_ADCIMCON1_DIFF9_Msk             (_UINT32_(0x1) << ADCHS_ADCIMCON1_DIFF9_Pos)         /* (ADCHS_ADCIMCON1) AN9 Mode bit Mask */
#define ADCHS_ADCIMCON1_DIFF9(value)          (ADCHS_ADCIMCON1_DIFF9_Msk & (_UINT32_(value) << ADCHS_ADCIMCON1_DIFF9_Pos)) /* Assignment of value for DIFF9 in the ADCHS_ADCIMCON1 register */
#define   ADCHS_ADCIMCON1_DIFF9_DIFF_Val      _UINT32_(0x1)                                        /* (ADCHS_ADCIMCON1) Selects AN9 differential input pair as AN9+ and ANN0-  */
#define   ADCHS_ADCIMCON1_DIFF9_SINGLE_Val    _UINT32_(0x0)                                        /* (ADCHS_ADCIMCON1) AN9 is using Single-ended mode  */
#define ADCHS_ADCIMCON1_DIFF9_DIFF            (ADCHS_ADCIMCON1_DIFF9_DIFF_Val << ADCHS_ADCIMCON1_DIFF9_Pos) /* (ADCHS_ADCIMCON1) Selects AN9 differential input pair as AN9+ and ANN0- Position */
#define ADCHS_ADCIMCON1_DIFF9_SINGLE          (ADCHS_ADCIMCON1_DIFF9_SINGLE_Val << ADCHS_ADCIMCON1_DIFF9_Pos) /* (ADCHS_ADCIMCON1) AN9 is using Single-ended mode Position */
#define ADCHS_ADCIMCON1_SIGN10_Pos            _UINT32_(20)                                         /* (ADCHS_ADCIMCON1) AN10 Signed Data Mode bit Position */
#define ADCHS_ADCIMCON1_SIGN10_Msk            (_UINT32_(0x1) << ADCHS_ADCIMCON1_SIGN10_Pos)        /* (ADCHS_ADCIMCON1) AN10 Signed Data Mode bit Mask */
#define ADCHS_ADCIMCON1_SIGN10(value)         (ADCHS_ADCIMCON1_SIGN10_Msk & (_UINT32_(value) << ADCHS_ADCIMCON1_SIGN10_Pos)) /* Assignment of value for SIGN10 in the ADCHS_ADCIMCON1 register */
#define   ADCHS_ADCIMCON1_SIGN10_SIGNED_Val   _UINT32_(0x1)                                        /* (ADCHS_ADCIMCON1) AN10 is using Signed Data mode  */
#define   ADCHS_ADCIMCON1_SIGN10_UNSIGNED_Val _UINT32_(0x0)                                        /* (ADCHS_ADCIMCON1) AN10 is using Unsigned Data mode  */
#define ADCHS_ADCIMCON1_SIGN10_SIGNED         (ADCHS_ADCIMCON1_SIGN10_SIGNED_Val << ADCHS_ADCIMCON1_SIGN10_Pos) /* (ADCHS_ADCIMCON1) AN10 is using Signed Data mode Position */
#define ADCHS_ADCIMCON1_SIGN10_UNSIGNED       (ADCHS_ADCIMCON1_SIGN10_UNSIGNED_Val << ADCHS_ADCIMCON1_SIGN10_Pos) /* (ADCHS_ADCIMCON1) AN10 is using Unsigned Data mode Position */
#define ADCHS_ADCIMCON1_DIFF10_Pos            _UINT32_(21)                                         /* (ADCHS_ADCIMCON1) AN10 Mode bit Position */
#define ADCHS_ADCIMCON1_DIFF10_Msk            (_UINT32_(0x1) << ADCHS_ADCIMCON1_DIFF10_Pos)        /* (ADCHS_ADCIMCON1) AN10 Mode bit Mask */
#define ADCHS_ADCIMCON1_DIFF10(value)         (ADCHS_ADCIMCON1_DIFF10_Msk & (_UINT32_(value) << ADCHS_ADCIMCON1_DIFF10_Pos)) /* Assignment of value for DIFF10 in the ADCHS_ADCIMCON1 register */
#define   ADCHS_ADCIMCON1_DIFF10_DIFF_Val     _UINT32_(0x1)                                        /* (ADCHS_ADCIMCON1) Selects AN10 differential input pair as AN10+ and ANN0-  */
#define   ADCHS_ADCIMCON1_DIFF10_SINGLE_Val   _UINT32_(0x0)                                        /* (ADCHS_ADCIMCON1) AN10 is using Single-ended mode  */
#define ADCHS_ADCIMCON1_DIFF10_DIFF           (ADCHS_ADCIMCON1_DIFF10_DIFF_Val << ADCHS_ADCIMCON1_DIFF10_Pos) /* (ADCHS_ADCIMCON1) Selects AN10 differential input pair as AN10+ and ANN0- Position */
#define ADCHS_ADCIMCON1_DIFF10_SINGLE         (ADCHS_ADCIMCON1_DIFF10_SINGLE_Val << ADCHS_ADCIMCON1_DIFF10_Pos) /* (ADCHS_ADCIMCON1) AN10 is using Single-ended mode Position */
#define ADCHS_ADCIMCON1_SIGN11_Pos            _UINT32_(22)                                         /* (ADCHS_ADCIMCON1) AN11 Signed Data Mode bit Position */
#define ADCHS_ADCIMCON1_SIGN11_Msk            (_UINT32_(0x1) << ADCHS_ADCIMCON1_SIGN11_Pos)        /* (ADCHS_ADCIMCON1) AN11 Signed Data Mode bit Mask */
#define ADCHS_ADCIMCON1_SIGN11(value)         (ADCHS_ADCIMCON1_SIGN11_Msk & (_UINT32_(value) << ADCHS_ADCIMCON1_SIGN11_Pos)) /* Assignment of value for SIGN11 in the ADCHS_ADCIMCON1 register */
#define   ADCHS_ADCIMCON1_SIGN11_SIGNED_Val   _UINT32_(0x1)                                        /* (ADCHS_ADCIMCON1) AN11 is using Signed Data mode  */
#define   ADCHS_ADCIMCON1_SIGN11_UNSIGNED_Val _UINT32_(0x0)                                        /* (ADCHS_ADCIMCON1) AN11 is using Unsigned Data mode  */
#define ADCHS_ADCIMCON1_SIGN11_SIGNED         (ADCHS_ADCIMCON1_SIGN11_SIGNED_Val << ADCHS_ADCIMCON1_SIGN11_Pos) /* (ADCHS_ADCIMCON1) AN11 is using Signed Data mode Position */
#define ADCHS_ADCIMCON1_SIGN11_UNSIGNED       (ADCHS_ADCIMCON1_SIGN11_UNSIGNED_Val << ADCHS_ADCIMCON1_SIGN11_Pos) /* (ADCHS_ADCIMCON1) AN11 is using Unsigned Data mode Position */
#define ADCHS_ADCIMCON1_DIFF11_Pos            _UINT32_(23)                                         /* (ADCHS_ADCIMCON1) AN11 Mode bit Position */
#define ADCHS_ADCIMCON1_DIFF11_Msk            (_UINT32_(0x1) << ADCHS_ADCIMCON1_DIFF11_Pos)        /* (ADCHS_ADCIMCON1) AN11 Mode bit Mask */
#define ADCHS_ADCIMCON1_DIFF11(value)         (ADCHS_ADCIMCON1_DIFF11_Msk & (_UINT32_(value) << ADCHS_ADCIMCON1_DIFF11_Pos)) /* Assignment of value for DIFF11 in the ADCHS_ADCIMCON1 register */
#define   ADCHS_ADCIMCON1_DIFF11_DIFF_Val     _UINT32_(0x1)                                        /* (ADCHS_ADCIMCON1) Selects AN11 differential input pair as AN11+ and ANN0-  */
#define   ADCHS_ADCIMCON1_DIFF11_SINGLE_Val   _UINT32_(0x0)                                        /* (ADCHS_ADCIMCON1) AN11 is using Single-ended mode  */
#define ADCHS_ADCIMCON1_DIFF11_DIFF           (ADCHS_ADCIMCON1_DIFF11_DIFF_Val << ADCHS_ADCIMCON1_DIFF11_Pos) /* (ADCHS_ADCIMCON1) Selects AN11 differential input pair as AN11+ and ANN0- Position */
#define ADCHS_ADCIMCON1_DIFF11_SINGLE         (ADCHS_ADCIMCON1_DIFF11_SINGLE_Val << ADCHS_ADCIMCON1_DIFF11_Pos) /* (ADCHS_ADCIMCON1) AN11 is using Single-ended mode Position */
#define ADCHS_ADCIMCON1_SIGN12_Pos            _UINT32_(24)                                         /* (ADCHS_ADCIMCON1) AN12 Signed Data Mode bit Position */
#define ADCHS_ADCIMCON1_SIGN12_Msk            (_UINT32_(0x1) << ADCHS_ADCIMCON1_SIGN12_Pos)        /* (ADCHS_ADCIMCON1) AN12 Signed Data Mode bit Mask */
#define ADCHS_ADCIMCON1_SIGN12(value)         (ADCHS_ADCIMCON1_SIGN12_Msk & (_UINT32_(value) << ADCHS_ADCIMCON1_SIGN12_Pos)) /* Assignment of value for SIGN12 in the ADCHS_ADCIMCON1 register */
#define   ADCHS_ADCIMCON1_SIGN12_SIGNED_Val   _UINT32_(0x1)                                        /* (ADCHS_ADCIMCON1) AN12 is using Signed Data mode  */
#define   ADCHS_ADCIMCON1_SIGN12_UNSIGNED_Val _UINT32_(0x0)                                        /* (ADCHS_ADCIMCON1) AN12 is using Unsigned Data mode  */
#define ADCHS_ADCIMCON1_SIGN12_SIGNED         (ADCHS_ADCIMCON1_SIGN12_SIGNED_Val << ADCHS_ADCIMCON1_SIGN12_Pos) /* (ADCHS_ADCIMCON1) AN12 is using Signed Data mode Position */
#define ADCHS_ADCIMCON1_SIGN12_UNSIGNED       (ADCHS_ADCIMCON1_SIGN12_UNSIGNED_Val << ADCHS_ADCIMCON1_SIGN12_Pos) /* (ADCHS_ADCIMCON1) AN12 is using Unsigned Data mode Position */
#define ADCHS_ADCIMCON1_DIFF12_Pos            _UINT32_(25)                                         /* (ADCHS_ADCIMCON1) AN12 Mode bit Position */
#define ADCHS_ADCIMCON1_DIFF12_Msk            (_UINT32_(0x1) << ADCHS_ADCIMCON1_DIFF12_Pos)        /* (ADCHS_ADCIMCON1) AN12 Mode bit Mask */
#define ADCHS_ADCIMCON1_DIFF12(value)         (ADCHS_ADCIMCON1_DIFF12_Msk & (_UINT32_(value) << ADCHS_ADCIMCON1_DIFF12_Pos)) /* Assignment of value for DIFF12 in the ADCHS_ADCIMCON1 register */
#define   ADCHS_ADCIMCON1_DIFF12_DIFF_Val     _UINT32_(0x1)                                        /* (ADCHS_ADCIMCON1) Selects AN12 differential input pair as AN12+ and ANN0-  */
#define   ADCHS_ADCIMCON1_DIFF12_SINGLE_Val   _UINT32_(0x0)                                        /* (ADCHS_ADCIMCON1) AN12 is using Single-ended mode  */
#define ADCHS_ADCIMCON1_DIFF12_DIFF           (ADCHS_ADCIMCON1_DIFF12_DIFF_Val << ADCHS_ADCIMCON1_DIFF12_Pos) /* (ADCHS_ADCIMCON1) Selects AN12 differential input pair as AN12+ and ANN0- Position */
#define ADCHS_ADCIMCON1_DIFF12_SINGLE         (ADCHS_ADCIMCON1_DIFF12_SINGLE_Val << ADCHS_ADCIMCON1_DIFF12_Pos) /* (ADCHS_ADCIMCON1) AN12 is using Single-ended mode Position */
#define ADCHS_ADCIMCON1_SIGN13_Pos            _UINT32_(26)                                         /* (ADCHS_ADCIMCON1) AN13 Signed Data Mode bit Position */
#define ADCHS_ADCIMCON1_SIGN13_Msk            (_UINT32_(0x1) << ADCHS_ADCIMCON1_SIGN13_Pos)        /* (ADCHS_ADCIMCON1) AN13 Signed Data Mode bit Mask */
#define ADCHS_ADCIMCON1_SIGN13(value)         (ADCHS_ADCIMCON1_SIGN13_Msk & (_UINT32_(value) << ADCHS_ADCIMCON1_SIGN13_Pos)) /* Assignment of value for SIGN13 in the ADCHS_ADCIMCON1 register */
#define   ADCHS_ADCIMCON1_SIGN13_SIGNED_Val   _UINT32_(0x1)                                        /* (ADCHS_ADCIMCON1) AN13 is using Signed Data mode  */
#define   ADCHS_ADCIMCON1_SIGN13_UNSIGNED_Val _UINT32_(0x0)                                        /* (ADCHS_ADCIMCON1) AN13 is using Unsigned Data mode  */
#define ADCHS_ADCIMCON1_SIGN13_SIGNED         (ADCHS_ADCIMCON1_SIGN13_SIGNED_Val << ADCHS_ADCIMCON1_SIGN13_Pos) /* (ADCHS_ADCIMCON1) AN13 is using Signed Data mode Position */
#define ADCHS_ADCIMCON1_SIGN13_UNSIGNED       (ADCHS_ADCIMCON1_SIGN13_UNSIGNED_Val << ADCHS_ADCIMCON1_SIGN13_Pos) /* (ADCHS_ADCIMCON1) AN13 is using Unsigned Data mode Position */
#define ADCHS_ADCIMCON1_DIFF13_Pos            _UINT32_(27)                                         /* (ADCHS_ADCIMCON1) AN13 Mode bit Position */
#define ADCHS_ADCIMCON1_DIFF13_Msk            (_UINT32_(0x1) << ADCHS_ADCIMCON1_DIFF13_Pos)        /* (ADCHS_ADCIMCON1) AN13 Mode bit Mask */
#define ADCHS_ADCIMCON1_DIFF13(value)         (ADCHS_ADCIMCON1_DIFF13_Msk & (_UINT32_(value) << ADCHS_ADCIMCON1_DIFF13_Pos)) /* Assignment of value for DIFF13 in the ADCHS_ADCIMCON1 register */
#define   ADCHS_ADCIMCON1_DIFF13_DIFF_Val     _UINT32_(0x1)                                        /* (ADCHS_ADCIMCON1) Selects AN13 differential input pair as AN13+ and ANN0-  */
#define   ADCHS_ADCIMCON1_DIFF13_SINGLE_Val   _UINT32_(0x0)                                        /* (ADCHS_ADCIMCON1) AN13 is using Single-ended mode  */
#define ADCHS_ADCIMCON1_DIFF13_DIFF           (ADCHS_ADCIMCON1_DIFF13_DIFF_Val << ADCHS_ADCIMCON1_DIFF13_Pos) /* (ADCHS_ADCIMCON1) Selects AN13 differential input pair as AN13+ and ANN0- Position */
#define ADCHS_ADCIMCON1_DIFF13_SINGLE         (ADCHS_ADCIMCON1_DIFF13_SINGLE_Val << ADCHS_ADCIMCON1_DIFF13_Pos) /* (ADCHS_ADCIMCON1) AN13 is using Single-ended mode Position */
#define ADCHS_ADCIMCON1_SIGN14_Pos            _UINT32_(28)                                         /* (ADCHS_ADCIMCON1) AN14 Signed Data Mode bit Position */
#define ADCHS_ADCIMCON1_SIGN14_Msk            (_UINT32_(0x1) << ADCHS_ADCIMCON1_SIGN14_Pos)        /* (ADCHS_ADCIMCON1) AN14 Signed Data Mode bit Mask */
#define ADCHS_ADCIMCON1_SIGN14(value)         (ADCHS_ADCIMCON1_SIGN14_Msk & (_UINT32_(value) << ADCHS_ADCIMCON1_SIGN14_Pos)) /* Assignment of value for SIGN14 in the ADCHS_ADCIMCON1 register */
#define   ADCHS_ADCIMCON1_SIGN14_SIGNED_Val   _UINT32_(0x1)                                        /* (ADCHS_ADCIMCON1) AN14 is using Signed Data mode  */
#define   ADCHS_ADCIMCON1_SIGN14_UNSIGNED_Val _UINT32_(0x0)                                        /* (ADCHS_ADCIMCON1) AN14 is using Unsigned Data mode  */
#define ADCHS_ADCIMCON1_SIGN14_SIGNED         (ADCHS_ADCIMCON1_SIGN14_SIGNED_Val << ADCHS_ADCIMCON1_SIGN14_Pos) /* (ADCHS_ADCIMCON1) AN14 is using Signed Data mode Position */
#define ADCHS_ADCIMCON1_SIGN14_UNSIGNED       (ADCHS_ADCIMCON1_SIGN14_UNSIGNED_Val << ADCHS_ADCIMCON1_SIGN14_Pos) /* (ADCHS_ADCIMCON1) AN14 is using Unsigned Data mode Position */
#define ADCHS_ADCIMCON1_DIFF14_Pos            _UINT32_(29)                                         /* (ADCHS_ADCIMCON1) AN14 Mode bit Position */
#define ADCHS_ADCIMCON1_DIFF14_Msk            (_UINT32_(0x1) << ADCHS_ADCIMCON1_DIFF14_Pos)        /* (ADCHS_ADCIMCON1) AN14 Mode bit Mask */
#define ADCHS_ADCIMCON1_DIFF14(value)         (ADCHS_ADCIMCON1_DIFF14_Msk & (_UINT32_(value) << ADCHS_ADCIMCON1_DIFF14_Pos)) /* Assignment of value for DIFF14 in the ADCHS_ADCIMCON1 register */
#define   ADCHS_ADCIMCON1_DIFF14_DIFF_Val     _UINT32_(0x1)                                        /* (ADCHS_ADCIMCON1) Selects AN14 differential input pair as AN14+ and ANN0-  */
#define   ADCHS_ADCIMCON1_DIFF14_SINGLE_Val   _UINT32_(0x0)                                        /* (ADCHS_ADCIMCON1) AN14 is using Single-ended mode  */
#define ADCHS_ADCIMCON1_DIFF14_DIFF           (ADCHS_ADCIMCON1_DIFF14_DIFF_Val << ADCHS_ADCIMCON1_DIFF14_Pos) /* (ADCHS_ADCIMCON1) Selects AN14 differential input pair as AN14+ and ANN0- Position */
#define ADCHS_ADCIMCON1_DIFF14_SINGLE         (ADCHS_ADCIMCON1_DIFF14_SINGLE_Val << ADCHS_ADCIMCON1_DIFF14_Pos) /* (ADCHS_ADCIMCON1) AN14 is using Single-ended mode Position */
#define ADCHS_ADCIMCON1_SIGN15_Pos            _UINT32_(30)                                         /* (ADCHS_ADCIMCON1) AN15 Signed Data Mode bit Position */
#define ADCHS_ADCIMCON1_SIGN15_Msk            (_UINT32_(0x1) << ADCHS_ADCIMCON1_SIGN15_Pos)        /* (ADCHS_ADCIMCON1) AN15 Signed Data Mode bit Mask */
#define ADCHS_ADCIMCON1_SIGN15(value)         (ADCHS_ADCIMCON1_SIGN15_Msk & (_UINT32_(value) << ADCHS_ADCIMCON1_SIGN15_Pos)) /* Assignment of value for SIGN15 in the ADCHS_ADCIMCON1 register */
#define   ADCHS_ADCIMCON1_SIGN15_SIGNED_Val   _UINT32_(0x1)                                        /* (ADCHS_ADCIMCON1) AN15 is using Signed Data mode  */
#define   ADCHS_ADCIMCON1_SIGN15_UNSIGNED_Val _UINT32_(0x0)                                        /* (ADCHS_ADCIMCON1) AN15 is using Unsigned Data mode  */
#define ADCHS_ADCIMCON1_SIGN15_SIGNED         (ADCHS_ADCIMCON1_SIGN15_SIGNED_Val << ADCHS_ADCIMCON1_SIGN15_Pos) /* (ADCHS_ADCIMCON1) AN15 is using Signed Data mode Position */
#define ADCHS_ADCIMCON1_SIGN15_UNSIGNED       (ADCHS_ADCIMCON1_SIGN15_UNSIGNED_Val << ADCHS_ADCIMCON1_SIGN15_Pos) /* (ADCHS_ADCIMCON1) AN15 is using Unsigned Data mode Position */
#define ADCHS_ADCIMCON1_DIFF15_Pos            _UINT32_(31)                                         /* (ADCHS_ADCIMCON1) AN15 Mode bit Position */
#define ADCHS_ADCIMCON1_DIFF15_Msk            (_UINT32_(0x1) << ADCHS_ADCIMCON1_DIFF15_Pos)        /* (ADCHS_ADCIMCON1) AN15 Mode bit Mask */
#define ADCHS_ADCIMCON1_DIFF15(value)         (ADCHS_ADCIMCON1_DIFF15_Msk & (_UINT32_(value) << ADCHS_ADCIMCON1_DIFF15_Pos)) /* Assignment of value for DIFF15 in the ADCHS_ADCIMCON1 register */
#define   ADCHS_ADCIMCON1_DIFF15_DIFF_Val     _UINT32_(0x1)                                        /* (ADCHS_ADCIMCON1) Selects AN15 differential input pair as AN15+ and ANN0-  */
#define   ADCHS_ADCIMCON1_DIFF15_SINGLE_Val   _UINT32_(0x0)                                        /* (ADCHS_ADCIMCON1) AN15 is using Single-ended mode  */
#define ADCHS_ADCIMCON1_DIFF15_DIFF           (ADCHS_ADCIMCON1_DIFF15_DIFF_Val << ADCHS_ADCIMCON1_DIFF15_Pos) /* (ADCHS_ADCIMCON1) Selects AN15 differential input pair as AN15+ and ANN0- Position */
#define ADCHS_ADCIMCON1_DIFF15_SINGLE         (ADCHS_ADCIMCON1_DIFF15_SINGLE_Val << ADCHS_ADCIMCON1_DIFF15_Pos) /* (ADCHS_ADCIMCON1) AN15 is using Single-ended mode Position */
#define ADCHS_ADCIMCON1_Msk                   _UINT32_(0xFFFFFFFF)                                 /* (ADCHS_ADCIMCON1) Register Mask  */


/* -------- ADCHS_ADCIMOD1CLR : (ADCHS Offset: 0x44) (R/W 32) Bit clear register -------- */
#define ADCHS_ADCIMOD1CLR_RESETVALUE          _UINT32_(0x00)                                       /*  (ADCHS_ADCIMOD1CLR) Bit clear register  Reset Value */

#define ADCHS_ADCIMOD1CLR_Msk                 _UINT32_(0x00000000)                                 /* (ADCHS_ADCIMOD1CLR) Register Mask  */


