Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/test_app/firmware/src/packs/PIC32WM_BZ6204_DFP/component/adchs.h
/* -------- ADCHS_ADCIMOD1SET : (ADCHS Offset: 0x48) (R/W 32) Bit set register -------- */
#define ADCHS_ADCIMOD1SET_RESETVALUE          _UINT32_(0x00)                                       /*  (ADCHS_ADCIMOD1SET) Bit set register  Reset Value */

#define ADCHS_ADCIMOD1SET_Msk                 _UINT32_(0x00000000)                                 /* (ADCHS_ADCIMOD1SET) Register Mask  */


/* -------- ADCHS_ADCIMOD1INV : (ADCHS Offset: 0x4C) (R/W 32) Bit invert register -------- */
#define ADCHS_ADCIMOD1INV_RESETVALUE          _UINT32_(0x00)                                       /*  (ADCHS_ADCIMOD1INV) Bit invert register  Reset Value */

#define ADCHS_ADCIMOD1INV_Msk                 _UINT32_(0x00000000)                                 /* (ADCHS_ADCIMOD1INV) Register Mask  */


/* -------- ADCHS_ADCIMCON2 : (ADCHS Offset: 0x50) (R/W 32)  -------- */
#define ADCHS_ADCIMCON2_RESETVALUE            _UINT32_(0x00)                                       /*  (ADCHS_ADCIMCON2)   Reset Value */

#define ADCHS_ADCIMCON2_SIGN16_Pos            _UINT32_(0)                                          /* (ADCHS_ADCIMCON2) AN16 Signed Data Mode bit Position */
#define ADCHS_ADCIMCON2_SIGN16_Msk            (_UINT32_(0x1) << ADCHS_ADCIMCON2_SIGN16_Pos)        /* (ADCHS_ADCIMCON2) AN16 Signed Data Mode bit Mask */
#define ADCHS_ADCIMCON2_SIGN16(value)         (ADCHS_ADCIMCON2_SIGN16_Msk & (_UINT32_(value) << ADCHS_ADCIMCON2_SIGN16_Pos)) /* Assignment of value for SIGN16 in the ADCHS_ADCIMCON2 register */
#define   ADCHS_ADCIMCON2_SIGN16_SIGNED_Val   _UINT32_(0x1)                                        /* (ADCHS_ADCIMCON2) AN16 is using Signed Data mode  */
#define   ADCHS_ADCIMCON2_SIGN16_UNSIGNED_Val _UINT32_(0x0)                                        /* (ADCHS_ADCIMCON2) AN16 is using Unsigned Data mode  */
#define ADCHS_ADCIMCON2_SIGN16_SIGNED         (ADCHS_ADCIMCON2_SIGN16_SIGNED_Val << ADCHS_ADCIMCON2_SIGN16_Pos) /* (ADCHS_ADCIMCON2) AN16 is using Signed Data mode Position */
#define ADCHS_ADCIMCON2_SIGN16_UNSIGNED       (ADCHS_ADCIMCON2_SIGN16_UNSIGNED_Val << ADCHS_ADCIMCON2_SIGN16_Pos) /* (ADCHS_ADCIMCON2) AN16 is using Unsigned Data mode Position */
#define ADCHS_ADCIMCON2_DIFF16_Pos            _UINT32_(1)                                          /* (ADCHS_ADCIMCON2) AN16 Mode bit Position */
#define ADCHS_ADCIMCON2_DIFF16_Msk            (_UINT32_(0x1) << ADCHS_ADCIMCON2_DIFF16_Pos)        /* (ADCHS_ADCIMCON2) AN16 Mode bit Mask */
#define ADCHS_ADCIMCON2_DIFF16(value)         (ADCHS_ADCIMCON2_DIFF16_Msk & (_UINT32_(value) << ADCHS_ADCIMCON2_DIFF16_Pos)) /* Assignment of value for DIFF16 in the ADCHS_ADCIMCON2 register */
#define   ADCHS_ADCIMCON2_DIFF16_DIFF_Val     _UINT32_(0x1)                                        /* (ADCHS_ADCIMCON2) Selects AN16 differential input pair as AN16+ and ANN0-  */
#define   ADCHS_ADCIMCON2_DIFF16_SINGLE_Val   _UINT32_(0x0)                                        /* (ADCHS_ADCIMCON2) AN16 is using Single-ended mode  */
#define ADCHS_ADCIMCON2_DIFF16_DIFF           (ADCHS_ADCIMCON2_DIFF16_DIFF_Val << ADCHS_ADCIMCON2_DIFF16_Pos) /* (ADCHS_ADCIMCON2) Selects AN16 differential input pair as AN16+ and ANN0- Position */
#define ADCHS_ADCIMCON2_DIFF16_SINGLE         (ADCHS_ADCIMCON2_DIFF16_SINGLE_Val << ADCHS_ADCIMCON2_DIFF16_Pos) /* (ADCHS_ADCIMCON2) AN16 is using Single-ended mode Position */
#define ADCHS_ADCIMCON2_SIGN17_Pos            _UINT32_(2)                                          /* (ADCHS_ADCIMCON2) AN17 Signed Data Mode bit Position */
#define ADCHS_ADCIMCON2_SIGN17_Msk            (_UINT32_(0x1) << ADCHS_ADCIMCON2_SIGN17_Pos)        /* (ADCHS_ADCIMCON2) AN17 Signed Data Mode bit Mask */
#define ADCHS_ADCIMCON2_SIGN17(value)         (ADCHS_ADCIMCON2_SIGN17_Msk & (_UINT32_(value) << ADCHS_ADCIMCON2_SIGN17_Pos)) /* Assignment of value for SIGN17 in the ADCHS_ADCIMCON2 register */
#define   ADCHS_ADCIMCON2_SIGN17_SIGNED_Val   _UINT32_(0x1)                                        /* (ADCHS_ADCIMCON2) AN17 is using Signed Data mode  */
#define   ADCHS_ADCIMCON2_SIGN17_UNSIGNED_Val _UINT32_(0x0)                                        /* (ADCHS_ADCIMCON2) AN17 is using Unsigned Data mode  */
#define ADCHS_ADCIMCON2_SIGN17_SIGNED         (ADCHS_ADCIMCON2_SIGN17_SIGNED_Val << ADCHS_ADCIMCON2_SIGN17_Pos) /* (ADCHS_ADCIMCON2) AN17 is using Signed Data mode Position */
#define ADCHS_ADCIMCON2_SIGN17_UNSIGNED       (ADCHS_ADCIMCON2_SIGN17_UNSIGNED_Val << ADCHS_ADCIMCON2_SIGN17_Pos) /* (ADCHS_ADCIMCON2) AN17 is using Unsigned Data mode Position */
#define ADCHS_ADCIMCON2_DIFF17_Pos            _UINT32_(3)                                          /* (ADCHS_ADCIMCON2) AN17 Mode bit Position */
#define ADCHS_ADCIMCON2_DIFF17_Msk            (_UINT32_(0x1) << ADCHS_ADCIMCON2_DIFF17_Pos)        /* (ADCHS_ADCIMCON2) AN17 Mode bit Mask */
#define ADCHS_ADCIMCON2_DIFF17(value)         (ADCHS_ADCIMCON2_DIFF17_Msk & (_UINT32_(value) << ADCHS_ADCIMCON2_DIFF17_Pos)) /* Assignment of value for DIFF17 in the ADCHS_ADCIMCON2 register */
#define   ADCHS_ADCIMCON2_DIFF17_DIFF_Val     _UINT32_(0x1)                                        /* (ADCHS_ADCIMCON2) Selects AN17 differential input pair as AN17+ and ANN0-  */
#define   ADCHS_ADCIMCON2_DIFF17_SINGLE_Val   _UINT32_(0x0)                                        /* (ADCHS_ADCIMCON2) AN17 is using Single-ended mode  */
#define ADCHS_ADCIMCON2_DIFF17_DIFF           (ADCHS_ADCIMCON2_DIFF17_DIFF_Val << ADCHS_ADCIMCON2_DIFF17_Pos) /* (ADCHS_ADCIMCON2) Selects AN17 differential input pair as AN17+ and ANN0- Position */
#define ADCHS_ADCIMCON2_DIFF17_SINGLE         (ADCHS_ADCIMCON2_DIFF17_SINGLE_Val << ADCHS_ADCIMCON2_DIFF17_Pos) /* (ADCHS_ADCIMCON2) AN17 is using Single-ended mode Position */
#define ADCHS_ADCIMCON2_SIGN18_Pos            _UINT32_(4)                                          /* (ADCHS_ADCIMCON2) AN18 Signed Data Mode bit Position */
#define ADCHS_ADCIMCON2_SIGN18_Msk            (_UINT32_(0x1) << ADCHS_ADCIMCON2_SIGN18_Pos)        /* (ADCHS_ADCIMCON2) AN18 Signed Data Mode bit Mask */
#define ADCHS_ADCIMCON2_SIGN18(value)         (ADCHS_ADCIMCON2_SIGN18_Msk & (_UINT32_(value) << ADCHS_ADCIMCON2_SIGN18_Pos)) /* Assignment of value for SIGN18 in the ADCHS_ADCIMCON2 register */
#define   ADCHS_ADCIMCON2_SIGN18_SIGNED_Val   _UINT32_(0x1)                                        /* (ADCHS_ADCIMCON2) AN18 is using Signed Data mode  */
#define   ADCHS_ADCIMCON2_SIGN18_UNSIGNED_Val _UINT32_(0x0)                                        /* (ADCHS_ADCIMCON2) AN18 is using Unsigned Data mode  */
#define ADCHS_ADCIMCON2_SIGN18_SIGNED         (ADCHS_ADCIMCON2_SIGN18_SIGNED_Val << ADCHS_ADCIMCON2_SIGN18_Pos) /* (ADCHS_ADCIMCON2) AN18 is using Signed Data mode Position */
#define ADCHS_ADCIMCON2_SIGN18_UNSIGNED       (ADCHS_ADCIMCON2_SIGN18_UNSIGNED_Val << ADCHS_ADCIMCON2_SIGN18_Pos) /* (ADCHS_ADCIMCON2) AN18 is using Unsigned Data mode Position */
#define ADCHS_ADCIMCON2_DIFF18_Pos            _UINT32_(5)                                          /* (ADCHS_ADCIMCON2) AN18 Mode bit Position */
#define ADCHS_ADCIMCON2_DIFF18_Msk            (_UINT32_(0x1) << ADCHS_ADCIMCON2_DIFF18_Pos)        /* (ADCHS_ADCIMCON2) AN18 Mode bit Mask */
#define ADCHS_ADCIMCON2_DIFF18(value)         (ADCHS_ADCIMCON2_DIFF18_Msk & (_UINT32_(value) << ADCHS_ADCIMCON2_DIFF18_Pos)) /* Assignment of value for DIFF18 in the ADCHS_ADCIMCON2 register */
#define   ADCHS_ADCIMCON2_DIFF18_DIFF_Val     _UINT32_(0x1)                                        /* (ADCHS_ADCIMCON2) Selects AN18 differential input pair as AN18+ and ANN0-  */
#define   ADCHS_ADCIMCON2_DIFF18_SINGLE_Val   _UINT32_(0x0)                                        /* (ADCHS_ADCIMCON2) AN18 is using Single-ended mode  */
#define ADCHS_ADCIMCON2_DIFF18_DIFF           (ADCHS_ADCIMCON2_DIFF18_DIFF_Val << ADCHS_ADCIMCON2_DIFF18_Pos) /* (ADCHS_ADCIMCON2) Selects AN18 differential input pair as AN18+ and ANN0- Position */
#define ADCHS_ADCIMCON2_DIFF18_SINGLE         (ADCHS_ADCIMCON2_DIFF18_SINGLE_Val << ADCHS_ADCIMCON2_DIFF18_Pos) /* (ADCHS_ADCIMCON2) AN18 is using Single-ended mode Position */
#define ADCHS_ADCIMCON2_SIGN19_Pos            _UINT32_(6)                                          /* (ADCHS_ADCIMCON2) AN19 Signed Data Mode bit Position */
#define ADCHS_ADCIMCON2_SIGN19_Msk            (_UINT32_(0x1) << ADCHS_ADCIMCON2_SIGN19_Pos)        /* (ADCHS_ADCIMCON2) AN19 Signed Data Mode bit Mask */
#define ADCHS_ADCIMCON2_SIGN19(value)         (ADCHS_ADCIMCON2_SIGN19_Msk & (_UINT32_(value) << ADCHS_ADCIMCON2_SIGN19_Pos)) /* Assignment of value for SIGN19 in the ADCHS_ADCIMCON2 register */
#define   ADCHS_ADCIMCON2_SIGN19_SIGNED_Val   _UINT32_(0x1)                                        /* (ADCHS_ADCIMCON2) AN19 is using Signed Data mode  */
#define   ADCHS_ADCIMCON2_SIGN19_UNSIGNED_Val _UINT32_(0x0)                                        /* (ADCHS_ADCIMCON2) AN19 is using Unsigned Data mode  */
#define ADCHS_ADCIMCON2_SIGN19_SIGNED         (ADCHS_ADCIMCON2_SIGN19_SIGNED_Val << ADCHS_ADCIMCON2_SIGN19_Pos) /* (ADCHS_ADCIMCON2) AN19 is using Signed Data mode Position */
#define ADCHS_ADCIMCON2_SIGN19_UNSIGNED       (ADCHS_ADCIMCON2_SIGN19_UNSIGNED_Val << ADCHS_ADCIMCON2_SIGN19_Pos) /* (ADCHS_ADCIMCON2) AN19 is using Unsigned Data mode Position */
#define ADCHS_ADCIMCON2_DIFF19_Pos            _UINT32_(7)                                          /* (ADCHS_ADCIMCON2) AN19 Mode bit Position */
#define ADCHS_ADCIMCON2_DIFF19_Msk            (_UINT32_(0x1) << ADCHS_ADCIMCON2_DIFF19_Pos)        /* (ADCHS_ADCIMCON2) AN19 Mode bit Mask */
#define ADCHS_ADCIMCON2_DIFF19(value)         (ADCHS_ADCIMCON2_DIFF19_Msk & (_UINT32_(value) << ADCHS_ADCIMCON2_DIFF19_Pos)) /* Assignment of value for DIFF19 in the ADCHS_ADCIMCON2 register */
#define   ADCHS_ADCIMCON2_DIFF19_DIFF_Val     _UINT32_(0x1)                                        /* (ADCHS_ADCIMCON2) Selects AN19 differential input pair as AN19+ and ANN0-  */
#define   ADCHS_ADCIMCON2_DIFF19_SINGLE_Val   _UINT32_(0x0)                                        /* (ADCHS_ADCIMCON2) AN19 is using Single-ended mode  */
#define ADCHS_ADCIMCON2_DIFF19_DIFF           (ADCHS_ADCIMCON2_DIFF19_DIFF_Val << ADCHS_ADCIMCON2_DIFF19_Pos) /* (ADCHS_ADCIMCON2) Selects AN19 differential input pair as AN19+ and ANN0- Position */
#define ADCHS_ADCIMCON2_DIFF19_SINGLE         (ADCHS_ADCIMCON2_DIFF19_SINGLE_Val << ADCHS_ADCIMCON2_DIFF19_Pos) /* (ADCHS_ADCIMCON2) AN19 is using Single-ended mode Position */
#define ADCHS_ADCIMCON2_SIGN20_Pos            _UINT32_(8)                                          /* (ADCHS_ADCIMCON2) AN20 Signed Data Mode bit Position */
#define ADCHS_ADCIMCON2_SIGN20_Msk            (_UINT32_(0x1) << ADCHS_ADCIMCON2_SIGN20_Pos)        /* (ADCHS_ADCIMCON2) AN20 Signed Data Mode bit Mask */
#define ADCHS_ADCIMCON2_SIGN20(value)         (ADCHS_ADCIMCON2_SIGN20_Msk & (_UINT32_(value) << ADCHS_ADCIMCON2_SIGN20_Pos)) /* Assignment of value for SIGN20 in the ADCHS_ADCIMCON2 register */
#define   ADCHS_ADCIMCON2_SIGN20_SIGNED_Val   _UINT32_(0x1)                                        /* (ADCHS_ADCIMCON2) AN20 is using Signed Data mode  */
#define   ADCHS_ADCIMCON2_SIGN20_UNSIGNED_Val _UINT32_(0x0)                                        /* (ADCHS_ADCIMCON2) AN20 is using Unsigned Data mode  */
#define ADCHS_ADCIMCON2_SIGN20_SIGNED         (ADCHS_ADCIMCON2_SIGN20_SIGNED_Val << ADCHS_ADCIMCON2_SIGN20_Pos) /* (ADCHS_ADCIMCON2) AN20 is using Signed Data mode Position */
#define ADCHS_ADCIMCON2_SIGN20_UNSIGNED       (ADCHS_ADCIMCON2_SIGN20_UNSIGNED_Val << ADCHS_ADCIMCON2_SIGN20_Pos) /* (ADCHS_ADCIMCON2) AN20 is using Unsigned Data mode Position */
#define ADCHS_ADCIMCON2_DIFF20_Pos            _UINT32_(9)                                          /* (ADCHS_ADCIMCON2) AN20 Mode bit Position */
#define ADCHS_ADCIMCON2_DIFF20_Msk            (_UINT32_(0x1) << ADCHS_ADCIMCON2_DIFF20_Pos)        /* (ADCHS_ADCIMCON2) AN20 Mode bit Mask */
#define ADCHS_ADCIMCON2_DIFF20(value)         (ADCHS_ADCIMCON2_DIFF20_Msk & (_UINT32_(value) << ADCHS_ADCIMCON2_DIFF20_Pos)) /* Assignment of value for DIFF20 in the ADCHS_ADCIMCON2 register */
#define   ADCHS_ADCIMCON2_DIFF20_DIFF_Val     _UINT32_(0x1)                                        /* (ADCHS_ADCIMCON2) Selects AN20 differential input pair as AN20+ and ANN0-  */
#define   ADCHS_ADCIMCON2_DIFF20_SINGLE_Val   _UINT32_(0x0)                                        /* (ADCHS_ADCIMCON2) AN20 is using Single-ended mode  */
#define ADCHS_ADCIMCON2_DIFF20_DIFF           (ADCHS_ADCIMCON2_DIFF20_DIFF_Val << ADCHS_ADCIMCON2_DIFF20_Pos) /* (ADCHS_ADCIMCON2) Selects AN20 differential input pair as AN20+ and ANN0- Position */
#define ADCHS_ADCIMCON2_DIFF20_SINGLE         (ADCHS_ADCIMCON2_DIFF20_SINGLE_Val << ADCHS_ADCIMCON2_DIFF20_Pos) /* (ADCHS_ADCIMCON2) AN20 is using Single-ended mode Position */
#define ADCHS_ADCIMCON2_SIGN21_Pos            _UINT32_(10)                                         /* (ADCHS_ADCIMCON2) AN21 Signed Data Mode bit Position */
#define ADCHS_ADCIMCON2_SIGN21_Msk            (_UINT32_(0x1) << ADCHS_ADCIMCON2_SIGN21_Pos)        /* (ADCHS_ADCIMCON2) AN21 Signed Data Mode bit Mask */
#define ADCHS_ADCIMCON2_SIGN21(value)         (ADCHS_ADCIMCON2_SIGN21_Msk & (_UINT32_(value) << ADCHS_ADCIMCON2_SIGN21_Pos)) /* Assignment of value for SIGN21 in the ADCHS_ADCIMCON2 register */
#define   ADCHS_ADCIMCON2_SIGN21_SIGNED_Val   _UINT32_(0x1)                                        /* (ADCHS_ADCIMCON2) AN21 is using Signed Data mode  */
#define   ADCHS_ADCIMCON2_SIGN21_UNSIGNED_Val _UINT32_(0x0)                                        /* (ADCHS_ADCIMCON2) AN21 is using Unsigned Data mode  */
#define ADCHS_ADCIMCON2_SIGN21_SIGNED         (ADCHS_ADCIMCON2_SIGN21_SIGNED_Val << ADCHS_ADCIMCON2_SIGN21_Pos) /* (ADCHS_ADCIMCON2) AN21 is using Signed Data mode Position */
#define ADCHS_ADCIMCON2_SIGN21_UNSIGNED       (ADCHS_ADCIMCON2_SIGN21_UNSIGNED_Val << ADCHS_ADCIMCON2_SIGN21_Pos) /* (ADCHS_ADCIMCON2) AN21 is using Unsigned Data mode Position */
#define ADCHS_ADCIMCON2_DIFF21_Pos            _UINT32_(11)                                         /* (ADCHS_ADCIMCON2) AN21 Mode bit Position */
#define ADCHS_ADCIMCON2_DIFF21_Msk            (_UINT32_(0x1) << ADCHS_ADCIMCON2_DIFF21_Pos)        /* (ADCHS_ADCIMCON2) AN21 Mode bit Mask */
#define ADCHS_ADCIMCON2_DIFF21(value)         (ADCHS_ADCIMCON2_DIFF21_Msk & (_UINT32_(value) << ADCHS_ADCIMCON2_DIFF21_Pos)) /* Assignment of value for DIFF21 in the ADCHS_ADCIMCON2 register */
#define   ADCHS_ADCIMCON2_DIFF21_DIFF_Val     _UINT32_(0x1)                                        /* (ADCHS_ADCIMCON2) Selects AN21 differential input pair as AN21+ and ANN0-  */
#define   ADCHS_ADCIMCON2_DIFF21_SINGLE_Val   _UINT32_(0x0)                                        /* (ADCHS_ADCIMCON2) AN21 is using Single-ended mode  */
#define ADCHS_ADCIMCON2_DIFF21_DIFF           (ADCHS_ADCIMCON2_DIFF21_DIFF_Val << ADCHS_ADCIMCON2_DIFF21_Pos) /* (ADCHS_ADCIMCON2) Selects AN21 differential input pair as AN21+ and ANN0- Position */
#define ADCHS_ADCIMCON2_DIFF21_SINGLE         (ADCHS_ADCIMCON2_DIFF21_SINGLE_Val << ADCHS_ADCIMCON2_DIFF21_Pos) /* (ADCHS_ADCIMCON2) AN21 is using Single-ended mode Position */
#define ADCHS_ADCIMCON2_SIGN22_Pos            _UINT32_(12)                                         /* (ADCHS_ADCIMCON2) AN22 Signed Data Mode bit Position */
#define ADCHS_ADCIMCON2_SIGN22_Msk            (_UINT32_(0x1) << ADCHS_ADCIMCON2_SIGN22_Pos)        /* (ADCHS_ADCIMCON2) AN22 Signed Data Mode bit Mask */
#define ADCHS_ADCIMCON2_SIGN22(value)         (ADCHS_ADCIMCON2_SIGN22_Msk & (_UINT32_(value) << ADCHS_ADCIMCON2_SIGN22_Pos)) /* Assignment of value for SIGN22 in the ADCHS_ADCIMCON2 register */
#define   ADCHS_ADCIMCON2_SIGN22_SIGNED_Val   _UINT32_(0x1)                                        /* (ADCHS_ADCIMCON2) AN22 is using Signed Data mode  */
#define   ADCHS_ADCIMCON2_SIGN22_UNSIGNED_Val _UINT32_(0x0)                                        /* (ADCHS_ADCIMCON2) AN22 is using Unsigned Data mode  */
#define ADCHS_ADCIMCON2_SIGN22_SIGNED         (ADCHS_ADCIMCON2_SIGN22_SIGNED_Val << ADCHS_ADCIMCON2_SIGN22_Pos) /* (ADCHS_ADCIMCON2) AN22 is using Signed Data mode Position */
#define ADCHS_ADCIMCON2_SIGN22_UNSIGNED       (ADCHS_ADCIMCON2_SIGN22_UNSIGNED_Val << ADCHS_ADCIMCON2_SIGN22_Pos) /* (ADCHS_ADCIMCON2) AN22 is using Unsigned Data mode Position */
#define ADCHS_ADCIMCON2_DIFF22_Pos            _UINT32_(13)                                         /* (ADCHS_ADCIMCON2) AN22 Mode bit Position */
#define ADCHS_ADCIMCON2_DIFF22_Msk            (_UINT32_(0x1) << ADCHS_ADCIMCON2_DIFF22_Pos)        /* (ADCHS_ADCIMCON2) AN22 Mode bit Mask */
#define ADCHS_ADCIMCON2_DIFF22(value)         (ADCHS_ADCIMCON2_DIFF22_Msk & (_UINT32_(value) << ADCHS_ADCIMCON2_DIFF22_Pos)) /* Assignment of value for DIFF22 in the ADCHS_ADCIMCON2 register */
#define   ADCHS_ADCIMCON2_DIFF22_DIFF_Val     _UINT32_(0x1)                                        /* (ADCHS_ADCIMCON2) Selects AN22 differential input pair as AN22+ and ANN0-  */
#define   ADCHS_ADCIMCON2_DIFF22_SINGLE_Val   _UINT32_(0x0)                                        /* (ADCHS_ADCIMCON2) AN22 is using Single-ended mode  */
#define ADCHS_ADCIMCON2_DIFF22_DIFF           (ADCHS_ADCIMCON2_DIFF22_DIFF_Val << ADCHS_ADCIMCON2_DIFF22_Pos) /* (ADCHS_ADCIMCON2) Selects AN22 differential input pair as AN22+ and ANN0- Position */
#define ADCHS_ADCIMCON2_DIFF22_SINGLE         (ADCHS_ADCIMCON2_DIFF22_SINGLE_Val << ADCHS_ADCIMCON2_DIFF22_Pos) /* (ADCHS_ADCIMCON2) AN22 is using Single-ended mode Position */
#define ADCHS_ADCIMCON2_Msk                   _UINT32_(0x00003FFF)                                 /* (ADCHS_ADCIMCON2) Register Mask  */


/* -------- ADCHS_ADCGIRQEN1 : (ADCHS Offset: 0x80) (R/W 32)  -------- */
#define ADCHS_ADCGIRQEN1_RESETVALUE           _UINT32_(0x00)                                       /*  (ADCHS_ADCGIRQEN1)   Reset Value */

