Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/test_app/firmware/src/packs/PIC32WM_BZ6204_DFP/component/adchs.h
#define ADCHS_ADCGIRQEN1_AGIEN16(value)       (ADCHS_ADCGIRQEN1_AGIEN16_Msk & (_UINT32_(value) << ADCHS_ADCGIRQEN1_AGIEN16_Pos)) /* Assignment of value for AGIEN16 in the ADCHS_ADCGIRQEN1 register */
#define   ADCHS_ADCGIRQEN1_AGIEN16_ENABLED_Val _UINT32_(0x1)                                        /* (ADCHS_ADCGIRQEN1) Interrupts are enabled for the selected analog input. The interrupt is generated after the converted data is ready (indicated by the AIRDYx bit of the ADCDSTAT1 register)  */
#define   ADCHS_ADCGIRQEN1_AGIEN16_DISABLED_Val _UINT32_(0x0)                                        /* (ADCHS_ADCGIRQEN1) Interrupts are disabled  */
#define ADCHS_ADCGIRQEN1_AGIEN16_ENABLED      (ADCHS_ADCGIRQEN1_AGIEN16_ENABLED_Val << ADCHS_ADCGIRQEN1_AGIEN16_Pos) /* (ADCHS_ADCGIRQEN1) Interrupts are enabled for the selected analog input. The interrupt is generated after the converted data is ready (indicated by the AIRDYx bit of the ADCDSTAT1 register) Position */
#define ADCHS_ADCGIRQEN1_AGIEN16_DISABLED     (ADCHS_ADCGIRQEN1_AGIEN16_DISABLED_Val << ADCHS_ADCGIRQEN1_AGIEN16_Pos) /* (ADCHS_ADCGIRQEN1) Interrupts are disabled Position */
#define ADCHS_ADCGIRQEN1_AGIEN17_Pos          _UINT32_(17)                                         /* (ADCHS_ADCGIRQEN1) ADC Global Interrupt Enable bit 17 Position */
#define ADCHS_ADCGIRQEN1_AGIEN17_Msk          (_UINT32_(0x1) << ADCHS_ADCGIRQEN1_AGIEN17_Pos)      /* (ADCHS_ADCGIRQEN1) ADC Global Interrupt Enable bit 17 Mask */
#define ADCHS_ADCGIRQEN1_AGIEN17(value)       (ADCHS_ADCGIRQEN1_AGIEN17_Msk & (_UINT32_(value) << ADCHS_ADCGIRQEN1_AGIEN17_Pos)) /* Assignment of value for AGIEN17 in the ADCHS_ADCGIRQEN1 register */
#define   ADCHS_ADCGIRQEN1_AGIEN17_ENABLED_Val _UINT32_(0x1)                                        /* (ADCHS_ADCGIRQEN1) Interrupts are enabled for the selected analog input. The interrupt is generated after the converted data is ready (indicated by the AIRDYx bit of the ADCDSTAT1 register)  */
#define   ADCHS_ADCGIRQEN1_AGIEN17_DISABLED_Val _UINT32_(0x0)                                        /* (ADCHS_ADCGIRQEN1) Interrupts are disabled  */
#define ADCHS_ADCGIRQEN1_AGIEN17_ENABLED      (ADCHS_ADCGIRQEN1_AGIEN17_ENABLED_Val << ADCHS_ADCGIRQEN1_AGIEN17_Pos) /* (ADCHS_ADCGIRQEN1) Interrupts are enabled for the selected analog input. The interrupt is generated after the converted data is ready (indicated by the AIRDYx bit of the ADCDSTAT1 register) Position */
#define ADCHS_ADCGIRQEN1_AGIEN17_DISABLED     (ADCHS_ADCGIRQEN1_AGIEN17_DISABLED_Val << ADCHS_ADCGIRQEN1_AGIEN17_Pos) /* (ADCHS_ADCGIRQEN1) Interrupts are disabled Position */
#define ADCHS_ADCGIRQEN1_AGIEN18_Pos          _UINT32_(18)                                         /* (ADCHS_ADCGIRQEN1) ADC Global Interrupt Enable bit 18 Position */
#define ADCHS_ADCGIRQEN1_AGIEN18_Msk          (_UINT32_(0x1) << ADCHS_ADCGIRQEN1_AGIEN18_Pos)      /* (ADCHS_ADCGIRQEN1) ADC Global Interrupt Enable bit 18 Mask */
#define ADCHS_ADCGIRQEN1_AGIEN18(value)       (ADCHS_ADCGIRQEN1_AGIEN18_Msk & (_UINT32_(value) << ADCHS_ADCGIRQEN1_AGIEN18_Pos)) /* Assignment of value for AGIEN18 in the ADCHS_ADCGIRQEN1 register */
#define   ADCHS_ADCGIRQEN1_AGIEN18_ENABLED_Val _UINT32_(0x1)                                        /* (ADCHS_ADCGIRQEN1) Interrupts are enabled for the selected analog input. The interrupt is generated after the converted data is ready (indicated by the AIRDYx bit of the ADCDSTAT1 register)  */
#define   ADCHS_ADCGIRQEN1_AGIEN18_DISABLED_Val _UINT32_(0x0)                                        /* (ADCHS_ADCGIRQEN1) Interrupts are disabled  */
#define ADCHS_ADCGIRQEN1_AGIEN18_ENABLED      (ADCHS_ADCGIRQEN1_AGIEN18_ENABLED_Val << ADCHS_ADCGIRQEN1_AGIEN18_Pos) /* (ADCHS_ADCGIRQEN1) Interrupts are enabled for the selected analog input. The interrupt is generated after the converted data is ready (indicated by the AIRDYx bit of the ADCDSTAT1 register) Position */
#define ADCHS_ADCGIRQEN1_AGIEN18_DISABLED     (ADCHS_ADCGIRQEN1_AGIEN18_DISABLED_Val << ADCHS_ADCGIRQEN1_AGIEN18_Pos) /* (ADCHS_ADCGIRQEN1) Interrupts are disabled Position */
#define ADCHS_ADCGIRQEN1_AGIEN19_Pos          _UINT32_(19)                                         /* (ADCHS_ADCGIRQEN1) ADC Global Interrupt Enable bit 19 Position */
#define ADCHS_ADCGIRQEN1_AGIEN19_Msk          (_UINT32_(0x1) << ADCHS_ADCGIRQEN1_AGIEN19_Pos)      /* (ADCHS_ADCGIRQEN1) ADC Global Interrupt Enable bit 19 Mask */
#define ADCHS_ADCGIRQEN1_AGIEN19(value)       (ADCHS_ADCGIRQEN1_AGIEN19_Msk & (_UINT32_(value) << ADCHS_ADCGIRQEN1_AGIEN19_Pos)) /* Assignment of value for AGIEN19 in the ADCHS_ADCGIRQEN1 register */
#define   ADCHS_ADCGIRQEN1_AGIEN19_ENABLED_Val _UINT32_(0x1)                                        /* (ADCHS_ADCGIRQEN1) Interrupts are enabled for the selected analog input. The interrupt is generated after the converted data is ready (indicated by the AIRDYx bit of the ADCDSTAT1 register)  */
#define   ADCHS_ADCGIRQEN1_AGIEN19_DISABLED_Val _UINT32_(0x0)                                        /* (ADCHS_ADCGIRQEN1) Interrupts are disabled  */
#define ADCHS_ADCGIRQEN1_AGIEN19_ENABLED      (ADCHS_ADCGIRQEN1_AGIEN19_ENABLED_Val << ADCHS_ADCGIRQEN1_AGIEN19_Pos) /* (ADCHS_ADCGIRQEN1) Interrupts are enabled for the selected analog input. The interrupt is generated after the converted data is ready (indicated by the AIRDYx bit of the ADCDSTAT1 register) Position */
#define ADCHS_ADCGIRQEN1_AGIEN19_DISABLED     (ADCHS_ADCGIRQEN1_AGIEN19_DISABLED_Val << ADCHS_ADCGIRQEN1_AGIEN19_Pos) /* (ADCHS_ADCGIRQEN1) Interrupts are disabled Position */
#define ADCHS_ADCGIRQEN1_AGIEN20_Pos          _UINT32_(20)                                         /* (ADCHS_ADCGIRQEN1) ADC Global Interrupt Enable bit 20 Position */
#define ADCHS_ADCGIRQEN1_AGIEN20_Msk          (_UINT32_(0x1) << ADCHS_ADCGIRQEN1_AGIEN20_Pos)      /* (ADCHS_ADCGIRQEN1) ADC Global Interrupt Enable bit 20 Mask */
#define ADCHS_ADCGIRQEN1_AGIEN20(value)       (ADCHS_ADCGIRQEN1_AGIEN20_Msk & (_UINT32_(value) << ADCHS_ADCGIRQEN1_AGIEN20_Pos)) /* Assignment of value for AGIEN20 in the ADCHS_ADCGIRQEN1 register */
#define   ADCHS_ADCGIRQEN1_AGIEN20_ENABLED_Val _UINT32_(0x1)                                        /* (ADCHS_ADCGIRQEN1) Interrupts are enabled for the selected analog input. The interrupt is generated after the converted data is ready (indicated by the AIRDYx bit of the ADCDSTAT1 register)  */
#define   ADCHS_ADCGIRQEN1_AGIEN20_DISABLED_Val _UINT32_(0x0)                                        /* (ADCHS_ADCGIRQEN1) Interrupts are disabled  */
#define ADCHS_ADCGIRQEN1_AGIEN20_ENABLED      (ADCHS_ADCGIRQEN1_AGIEN20_ENABLED_Val << ADCHS_ADCGIRQEN1_AGIEN20_Pos) /* (ADCHS_ADCGIRQEN1) Interrupts are enabled for the selected analog input. The interrupt is generated after the converted data is ready (indicated by the AIRDYx bit of the ADCDSTAT1 register) Position */
#define ADCHS_ADCGIRQEN1_AGIEN20_DISABLED     (ADCHS_ADCGIRQEN1_AGIEN20_DISABLED_Val << ADCHS_ADCGIRQEN1_AGIEN20_Pos) /* (ADCHS_ADCGIRQEN1) Interrupts are disabled Position */
#define ADCHS_ADCGIRQEN1_AGIEN21_Pos          _UINT32_(21)                                         /* (ADCHS_ADCGIRQEN1) ADC Global Interrupt Enable bit 21 Position */
#define ADCHS_ADCGIRQEN1_AGIEN21_Msk          (_UINT32_(0x1) << ADCHS_ADCGIRQEN1_AGIEN21_Pos)      /* (ADCHS_ADCGIRQEN1) ADC Global Interrupt Enable bit 21 Mask */
#define ADCHS_ADCGIRQEN1_AGIEN21(value)       (ADCHS_ADCGIRQEN1_AGIEN21_Msk & (_UINT32_(value) << ADCHS_ADCGIRQEN1_AGIEN21_Pos)) /* Assignment of value for AGIEN21 in the ADCHS_ADCGIRQEN1 register */
#define   ADCHS_ADCGIRQEN1_AGIEN21_ENABLED_Val _UINT32_(0x1)                                        /* (ADCHS_ADCGIRQEN1) Interrupts are enabled for the selected analog input. The interrupt is generated after the converted data is ready (indicated by the AIRDYx bit of the ADCDSTAT1 register)  */
#define   ADCHS_ADCGIRQEN1_AGIEN21_DISABLED_Val _UINT32_(0x0)                                        /* (ADCHS_ADCGIRQEN1) Interrupts are disabled  */
#define ADCHS_ADCGIRQEN1_AGIEN21_ENABLED      (ADCHS_ADCGIRQEN1_AGIEN21_ENABLED_Val << ADCHS_ADCGIRQEN1_AGIEN21_Pos) /* (ADCHS_ADCGIRQEN1) Interrupts are enabled for the selected analog input. The interrupt is generated after the converted data is ready (indicated by the AIRDYx bit of the ADCDSTAT1 register) Position */
#define ADCHS_ADCGIRQEN1_AGIEN21_DISABLED     (ADCHS_ADCGIRQEN1_AGIEN21_DISABLED_Val << ADCHS_ADCGIRQEN1_AGIEN21_Pos) /* (ADCHS_ADCGIRQEN1) Interrupts are disabled Position */
#define ADCHS_ADCGIRQEN1_AGIEN22_Pos          _UINT32_(22)                                         /* (ADCHS_ADCGIRQEN1) ADC Global Interrupt Enable bit 22 Position */
#define ADCHS_ADCGIRQEN1_AGIEN22_Msk          (_UINT32_(0x1) << ADCHS_ADCGIRQEN1_AGIEN22_Pos)      /* (ADCHS_ADCGIRQEN1) ADC Global Interrupt Enable bit 22 Mask */
#define ADCHS_ADCGIRQEN1_AGIEN22(value)       (ADCHS_ADCGIRQEN1_AGIEN22_Msk & (_UINT32_(value) << ADCHS_ADCGIRQEN1_AGIEN22_Pos)) /* Assignment of value for AGIEN22 in the ADCHS_ADCGIRQEN1 register */
#define   ADCHS_ADCGIRQEN1_AGIEN22_ENABLED_Val _UINT32_(0x1)                                        /* (ADCHS_ADCGIRQEN1) Interrupts are enabled for the selected analog input. The interrupt is generated after the converted data is ready (indicated by the AIRDYx bit of the ADCDSTAT1 register)  */
#define   ADCHS_ADCGIRQEN1_AGIEN22_DISABLED_Val _UINT32_(0x0)                                        /* (ADCHS_ADCGIRQEN1) Interrupts are disabled  */
#define ADCHS_ADCGIRQEN1_AGIEN22_ENABLED      (ADCHS_ADCGIRQEN1_AGIEN22_ENABLED_Val << ADCHS_ADCGIRQEN1_AGIEN22_Pos) /* (ADCHS_ADCGIRQEN1) Interrupts are enabled for the selected analog input. The interrupt is generated after the converted data is ready (indicated by the AIRDYx bit of the ADCDSTAT1 register) Position */
#define ADCHS_ADCGIRQEN1_AGIEN22_DISABLED     (ADCHS_ADCGIRQEN1_AGIEN22_DISABLED_Val << ADCHS_ADCGIRQEN1_AGIEN22_Pos) /* (ADCHS_ADCGIRQEN1) Interrupts are disabled Position */
#define ADCHS_ADCGIRQEN1_Msk                  _UINT32_(0x007FFFFF)                                 /* (ADCHS_ADCGIRQEN1) Register Mask  */

#define ADCHS_ADCGIRQEN1_AGIEN_Pos            _UINT32_(0)                                          /* (ADCHS_ADCGIRQEN1 Position) ADC Global Interrupt Enable bit 22 */
#define ADCHS_ADCGIRQEN1_AGIEN_Msk            (_UINT32_(0x7FFFFF) << ADCHS_ADCGIRQEN1_AGIEN_Pos)   /* (ADCHS_ADCGIRQEN1 Mask) AGIEN */
#define ADCHS_ADCGIRQEN1_AGIEN(value)         (ADCHS_ADCGIRQEN1_AGIEN_Msk & (_UINT32_(value) << ADCHS_ADCGIRQEN1_AGIEN_Pos)) 

/* -------- ADCHS_ADCGIRQEN1CLR : (ADCHS Offset: 0x84) (R/W 32) Bit clear register -------- */
#define ADCHS_ADCGIRQEN1CLR_RESETVALUE        _UINT32_(0x00)                                       /*  (ADCHS_ADCGIRQEN1CLR) Bit clear register  Reset Value */

#define ADCHS_ADCGIRQEN1CLR_Msk               _UINT32_(0x00000000)                                 /* (ADCHS_ADCGIRQEN1CLR) Register Mask  */


/* -------- ADCHS_ADCGIRQEN1SET : (ADCHS Offset: 0x88) (R/W 32) Bit set register -------- */
#define ADCHS_ADCGIRQEN1SET_RESETVALUE        _UINT32_(0x00)                                       /*  (ADCHS_ADCGIRQEN1SET) Bit set register  Reset Value */

