Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/test_app/firmware/src/packs/PIC32WM_BZ6204_DFP/component/adchs.h
#define ADCHS_ADCGIRQEN1SET_Msk               _UINT32_(0x00000000)                                 /* (ADCHS_ADCGIRQEN1SET) Register Mask  */


/* -------- ADCHS_ADCGIRQEN1INV : (ADCHS Offset: 0x8C) (R/W 32) Bit invert register -------- */
#define ADCHS_ADCGIRQEN1INV_RESETVALUE        _UINT32_(0x00)                                       /*  (ADCHS_ADCGIRQEN1INV) Bit invert register  Reset Value */

#define ADCHS_ADCGIRQEN1INV_Msk               _UINT32_(0x00000000)                                 /* (ADCHS_ADCGIRQEN1INV) Register Mask  */


/* -------- ADCHS_ADCCSS1 : (ADCHS Offset: 0xA0) (R/W 32)  -------- */
#define ADCHS_ADCCSS1_RESETVALUE              _UINT32_(0x00)                                       /*  (ADCHS_ADCCSS1)   Reset Value */

#define ADCHS_ADCCSS1_CSS0_Pos                _UINT32_(0)                                          /* (ADCHS_ADCCSS1) Analog Common Scan Select bits Position */
#define ADCHS_ADCCSS1_CSS0_Msk                (_UINT32_(0x1) << ADCHS_ADCCSS1_CSS0_Pos)            /* (ADCHS_ADCCSS1) Analog Common Scan Select bits Mask */
#define ADCHS_ADCCSS1_CSS0(value)             (ADCHS_ADCCSS1_CSS0_Msk & (_UINT32_(value) << ADCHS_ADCCSS1_CSS0_Pos)) /* Assignment of value for CSS0 in the ADCHS_ADCCSS1 register */
#define   ADCHS_ADCCSS1_CSS0_SEL_AN0_Val      _UINT32_(0x1)                                        /* (ADCHS_ADCCSS1) Select ANx for input scan (i.e.ANx = CSSx and scan is sequential starting with the lowest to highest enabled CSSx analog input pin)  */
#define   ADCHS_ADCCSS1_CSS0_SKIP_AN0_Val     _UINT32_(0x0)                                        /* (ADCHS_ADCCSS1) Skip ANx for input scan  */
#define ADCHS_ADCCSS1_CSS0_SEL_AN0            (ADCHS_ADCCSS1_CSS0_SEL_AN0_Val << ADCHS_ADCCSS1_CSS0_Pos) /* (ADCHS_ADCCSS1) Select ANx for input scan (i.e.ANx = CSSx and scan is sequential starting with the lowest to highest enabled CSSx analog input pin) Position */
#define ADCHS_ADCCSS1_CSS0_SKIP_AN0           (ADCHS_ADCCSS1_CSS0_SKIP_AN0_Val << ADCHS_ADCCSS1_CSS0_Pos) /* (ADCHS_ADCCSS1) Skip ANx for input scan Position */
#define ADCHS_ADCCSS1_CSS1_Pos                _UINT32_(1)                                          /* (ADCHS_ADCCSS1) Analog Common Scan Select bits Position */
#define ADCHS_ADCCSS1_CSS1_Msk                (_UINT32_(0x1) << ADCHS_ADCCSS1_CSS1_Pos)            /* (ADCHS_ADCCSS1) Analog Common Scan Select bits Mask */
#define ADCHS_ADCCSS1_CSS1(value)             (ADCHS_ADCCSS1_CSS1_Msk & (_UINT32_(value) << ADCHS_ADCCSS1_CSS1_Pos)) /* Assignment of value for CSS1 in the ADCHS_ADCCSS1 register */
#define   ADCHS_ADCCSS1_CSS1_SEL_AN1_Val      _UINT32_(0x1)                                        /* (ADCHS_ADCCSS1) Select ANx for input scan (i.e.ANx = CSSx and scan is sequential starting with the lowest to highest enabled CSSx analog input pin)  */
#define   ADCHS_ADCCSS1_CSS1_SKIP_AN1_Val     _UINT32_(0x0)                                        /* (ADCHS_ADCCSS1) Skip ANx for input scan  */
#define ADCHS_ADCCSS1_CSS1_SEL_AN1            (ADCHS_ADCCSS1_CSS1_SEL_AN1_Val << ADCHS_ADCCSS1_CSS1_Pos) /* (ADCHS_ADCCSS1) Select ANx for input scan (i.e.ANx = CSSx and scan is sequential starting with the lowest to highest enabled CSSx analog input pin) Position */
#define ADCHS_ADCCSS1_CSS1_SKIP_AN1           (ADCHS_ADCCSS1_CSS1_SKIP_AN1_Val << ADCHS_ADCCSS1_CSS1_Pos) /* (ADCHS_ADCCSS1) Skip ANx for input scan Position */
#define ADCHS_ADCCSS1_CSS2_Pos                _UINT32_(2)                                          /* (ADCHS_ADCCSS1) Analog Common Scan Select bits Position */
#define ADCHS_ADCCSS1_CSS2_Msk                (_UINT32_(0x1) << ADCHS_ADCCSS1_CSS2_Pos)            /* (ADCHS_ADCCSS1) Analog Common Scan Select bits Mask */
#define ADCHS_ADCCSS1_CSS2(value)             (ADCHS_ADCCSS1_CSS2_Msk & (_UINT32_(value) << ADCHS_ADCCSS1_CSS2_Pos)) /* Assignment of value for CSS2 in the ADCHS_ADCCSS1 register */
#define   ADCHS_ADCCSS1_CSS2_SEL_AN2_Val      _UINT32_(0x1)                                        /* (ADCHS_ADCCSS1) Select ANx for input scan (i.e.ANx = CSSx and scan is sequential starting with the lowest to highest enabled CSSx analog input pin)  */
#define   ADCHS_ADCCSS1_CSS2_SKIP_AN2_Val     _UINT32_(0x0)                                        /* (ADCHS_ADCCSS1) Skip ANx for input scan  */
#define ADCHS_ADCCSS1_CSS2_SEL_AN2            (ADCHS_ADCCSS1_CSS2_SEL_AN2_Val << ADCHS_ADCCSS1_CSS2_Pos) /* (ADCHS_ADCCSS1) Select ANx for input scan (i.e.ANx = CSSx and scan is sequential starting with the lowest to highest enabled CSSx analog input pin) Position */
#define ADCHS_ADCCSS1_CSS2_SKIP_AN2           (ADCHS_ADCCSS1_CSS2_SKIP_AN2_Val << ADCHS_ADCCSS1_CSS2_Pos) /* (ADCHS_ADCCSS1) Skip ANx for input scan Position */
#define ADCHS_ADCCSS1_CSS3_Pos                _UINT32_(3)                                          /* (ADCHS_ADCCSS1) Analog Common Scan Select bits Position */
#define ADCHS_ADCCSS1_CSS3_Msk                (_UINT32_(0x1) << ADCHS_ADCCSS1_CSS3_Pos)            /* (ADCHS_ADCCSS1) Analog Common Scan Select bits Mask */
#define ADCHS_ADCCSS1_CSS3(value)             (ADCHS_ADCCSS1_CSS3_Msk & (_UINT32_(value) << ADCHS_ADCCSS1_CSS3_Pos)) /* Assignment of value for CSS3 in the ADCHS_ADCCSS1 register */
#define   ADCHS_ADCCSS1_CSS3_SEL_AN3_Val      _UINT32_(0x1)                                        /* (ADCHS_ADCCSS1) Select ANx for input scan (i.e.ANx = CSSx and scan is sequential starting with the lowest to highest enabled CSSx analog input pin)  */
#define   ADCHS_ADCCSS1_CSS3_SKIP_AN3_Val     _UINT32_(0x0)                                        /* (ADCHS_ADCCSS1) Skip ANx for input scan  */
#define ADCHS_ADCCSS1_CSS3_SEL_AN3            (ADCHS_ADCCSS1_CSS3_SEL_AN3_Val << ADCHS_ADCCSS1_CSS3_Pos) /* (ADCHS_ADCCSS1) Select ANx for input scan (i.e.ANx = CSSx and scan is sequential starting with the lowest to highest enabled CSSx analog input pin) Position */
#define ADCHS_ADCCSS1_CSS3_SKIP_AN3           (ADCHS_ADCCSS1_CSS3_SKIP_AN3_Val << ADCHS_ADCCSS1_CSS3_Pos) /* (ADCHS_ADCCSS1) Skip ANx for input scan Position */
#define ADCHS_ADCCSS1_CSS4_Pos                _UINT32_(4)                                          /* (ADCHS_ADCCSS1) Analog Common Scan Select bits Position */
#define ADCHS_ADCCSS1_CSS4_Msk                (_UINT32_(0x1) << ADCHS_ADCCSS1_CSS4_Pos)            /* (ADCHS_ADCCSS1) Analog Common Scan Select bits Mask */
#define ADCHS_ADCCSS1_CSS4(value)             (ADCHS_ADCCSS1_CSS4_Msk & (_UINT32_(value) << ADCHS_ADCCSS1_CSS4_Pos)) /* Assignment of value for CSS4 in the ADCHS_ADCCSS1 register */
#define   ADCHS_ADCCSS1_CSS4_SEL_AN4_Val      _UINT32_(0x1)                                        /* (ADCHS_ADCCSS1) Select ANx for input scan (i.e.ANx = CSSx and scan is sequential starting with the lowest to highest enabled CSSx analog input pin)  */
#define   ADCHS_ADCCSS1_CSS4_SKIP_AN4_Val     _UINT32_(0x0)                                        /* (ADCHS_ADCCSS1) Skip ANx for input scan  */
#define ADCHS_ADCCSS1_CSS4_SEL_AN4            (ADCHS_ADCCSS1_CSS4_SEL_AN4_Val << ADCHS_ADCCSS1_CSS4_Pos) /* (ADCHS_ADCCSS1) Select ANx for input scan (i.e.ANx = CSSx and scan is sequential starting with the lowest to highest enabled CSSx analog input pin) Position */
#define ADCHS_ADCCSS1_CSS4_SKIP_AN4           (ADCHS_ADCCSS1_CSS4_SKIP_AN4_Val << ADCHS_ADCCSS1_CSS4_Pos) /* (ADCHS_ADCCSS1) Skip ANx for input scan Position */
#define ADCHS_ADCCSS1_CSS5_Pos                _UINT32_(5)                                          /* (ADCHS_ADCCSS1) Analog Common Scan Select bits Position */
#define ADCHS_ADCCSS1_CSS5_Msk                (_UINT32_(0x1) << ADCHS_ADCCSS1_CSS5_Pos)            /* (ADCHS_ADCCSS1) Analog Common Scan Select bits Mask */
#define ADCHS_ADCCSS1_CSS5(value)             (ADCHS_ADCCSS1_CSS5_Msk & (_UINT32_(value) << ADCHS_ADCCSS1_CSS5_Pos)) /* Assignment of value for CSS5 in the ADCHS_ADCCSS1 register */
#define   ADCHS_ADCCSS1_CSS5_SEL_AN5_Val      _UINT32_(0x1)                                        /* (ADCHS_ADCCSS1) Select ANx for input scan (i.e.ANx = CSSx and scan is sequential starting with the lowest to highest enabled CSSx analog input pin)  */
#define   ADCHS_ADCCSS1_CSS5_SKIP_AN5_Val     _UINT32_(0x0)                                        /* (ADCHS_ADCCSS1) Skip ANx for input scan  */
#define ADCHS_ADCCSS1_CSS5_SEL_AN5            (ADCHS_ADCCSS1_CSS5_SEL_AN5_Val << ADCHS_ADCCSS1_CSS5_Pos) /* (ADCHS_ADCCSS1) Select ANx for input scan (i.e.ANx = CSSx and scan is sequential starting with the lowest to highest enabled CSSx analog input pin) Position */
#define ADCHS_ADCCSS1_CSS5_SKIP_AN5           (ADCHS_ADCCSS1_CSS5_SKIP_AN5_Val << ADCHS_ADCCSS1_CSS5_Pos) /* (ADCHS_ADCCSS1) Skip ANx for input scan Position */
#define ADCHS_ADCCSS1_CSS6_Pos                _UINT32_(6)                                          /* (ADCHS_ADCCSS1) Analog Common Scan Select bits Position */
#define ADCHS_ADCCSS1_CSS6_Msk                (_UINT32_(0x1) << ADCHS_ADCCSS1_CSS6_Pos)            /* (ADCHS_ADCCSS1) Analog Common Scan Select bits Mask */
#define ADCHS_ADCCSS1_CSS6(value)             (ADCHS_ADCCSS1_CSS6_Msk & (_UINT32_(value) << ADCHS_ADCCSS1_CSS6_Pos)) /* Assignment of value for CSS6 in the ADCHS_ADCCSS1 register */
#define   ADCHS_ADCCSS1_CSS6_SEL_AN6_Val      _UINT32_(0x1)                                        /* (ADCHS_ADCCSS1) Select ANx for input scan (i.e.ANx = CSSx and scan is sequential starting with the lowest to highest enabled CSSx analog input pin)  */
#define   ADCHS_ADCCSS1_CSS6_SKIP_AN6_Val     _UINT32_(0x0)                                        /* (ADCHS_ADCCSS1) Skip ANx for input scan  */
#define ADCHS_ADCCSS1_CSS6_SEL_AN6            (ADCHS_ADCCSS1_CSS6_SEL_AN6_Val << ADCHS_ADCCSS1_CSS6_Pos) /* (ADCHS_ADCCSS1) Select ANx for input scan (i.e.ANx = CSSx and scan is sequential starting with the lowest to highest enabled CSSx analog input pin) Position */
#define ADCHS_ADCCSS1_CSS6_SKIP_AN6           (ADCHS_ADCCSS1_CSS6_SKIP_AN6_Val << ADCHS_ADCCSS1_CSS6_Pos) /* (ADCHS_ADCCSS1) Skip ANx for input scan Position */
#define ADCHS_ADCCSS1_CSS7_Pos                _UINT32_(7)                                          /* (ADCHS_ADCCSS1) Analog Common Scan Select bits Position */
#define ADCHS_ADCCSS1_CSS7_Msk                (_UINT32_(0x1) << ADCHS_ADCCSS1_CSS7_Pos)            /* (ADCHS_ADCCSS1) Analog Common Scan Select bits Mask */
#define ADCHS_ADCCSS1_CSS7(value)             (ADCHS_ADCCSS1_CSS7_Msk & (_UINT32_(value) << ADCHS_ADCCSS1_CSS7_Pos)) /* Assignment of value for CSS7 in the ADCHS_ADCCSS1 register */
#define   ADCHS_ADCCSS1_CSS7_SEL_AN7_Val      _UINT32_(0x1)                                        /* (ADCHS_ADCCSS1) Select ANx for input scan (i.e.ANx = CSSx and scan is sequential starting with the lowest to highest enabled CSSx analog input pin)  */
#define   ADCHS_ADCCSS1_CSS7_SKIP_AN7_Val     _UINT32_(0x0)                                        /* (ADCHS_ADCCSS1) Skip ANx for input scan  */
#define ADCHS_ADCCSS1_CSS7_SEL_AN7            (ADCHS_ADCCSS1_CSS7_SEL_AN7_Val << ADCHS_ADCCSS1_CSS7_Pos) /* (ADCHS_ADCCSS1) Select ANx for input scan (i.e.ANx = CSSx and scan is sequential starting with the lowest to highest enabled CSSx analog input pin) Position */
#define ADCHS_ADCCSS1_CSS7_SKIP_AN7           (ADCHS_ADCCSS1_CSS7_SKIP_AN7_Val << ADCHS_ADCCSS1_CSS7_Pos) /* (ADCHS_ADCCSS1) Skip ANx for input scan Position */
#define ADCHS_ADCCSS1_CSS8_Pos                _UINT32_(8)                                          /* (ADCHS_ADCCSS1) Analog Common Scan Select bits Position */
#define ADCHS_ADCCSS1_CSS8_Msk                (_UINT32_(0x1) << ADCHS_ADCCSS1_CSS8_Pos)            /* (ADCHS_ADCCSS1) Analog Common Scan Select bits Mask */
#define ADCHS_ADCCSS1_CSS8(value)             (ADCHS_ADCCSS1_CSS8_Msk & (_UINT32_(value) << ADCHS_ADCCSS1_CSS8_Pos)) /* Assignment of value for CSS8 in the ADCHS_ADCCSS1 register */
#define   ADCHS_ADCCSS1_CSS8_SEL_AN8_Val      _UINT32_(0x1)                                        /* (ADCHS_ADCCSS1) Select ANx for input scan (i.e.ANx = CSSx and scan is sequential starting with the lowest to highest enabled CSSx analog input pin)  */
#define   ADCHS_ADCCSS1_CSS8_SKIP_AN8_Val     _UINT32_(0x0)                                        /* (ADCHS_ADCCSS1) Skip ANx for input scan  */
#define ADCHS_ADCCSS1_CSS8_SEL_AN8            (ADCHS_ADCCSS1_CSS8_SEL_AN8_Val << ADCHS_ADCCSS1_CSS8_Pos) /* (ADCHS_ADCCSS1) Select ANx for input scan (i.e.ANx = CSSx and scan is sequential starting with the lowest to highest enabled CSSx analog input pin) Position */
#define ADCHS_ADCCSS1_CSS8_SKIP_AN8           (ADCHS_ADCCSS1_CSS8_SKIP_AN8_Val << ADCHS_ADCCSS1_CSS8_Pos) /* (ADCHS_ADCCSS1) Skip ANx for input scan Position */
#define ADCHS_ADCCSS1_CSS9_Pos                _UINT32_(9)                                          /* (ADCHS_ADCCSS1) Analog Common Scan Select bits Position */
#define ADCHS_ADCCSS1_CSS9_Msk                (_UINT32_(0x1) << ADCHS_ADCCSS1_CSS9_Pos)            /* (ADCHS_ADCCSS1) Analog Common Scan Select bits Mask */
#define ADCHS_ADCCSS1_CSS9(value)             (ADCHS_ADCCSS1_CSS9_Msk & (_UINT32_(value) << ADCHS_ADCCSS1_CSS9_Pos)) /* Assignment of value for CSS9 in the ADCHS_ADCCSS1 register */
#define   ADCHS_ADCCSS1_CSS9_SEL_AN9_Val      _UINT32_(0x1)                                        /* (ADCHS_ADCCSS1) Select ANx for input scan (i.e.ANx = CSSx and scan is sequential starting with the lowest to highest enabled CSSx analog input pin)  */
#define   ADCHS_ADCCSS1_CSS9_SKIP_AN9_Val     _UINT32_(0x0)                                        /* (ADCHS_ADCCSS1) Skip ANx for input scan  */
#define ADCHS_ADCCSS1_CSS9_SEL_AN9            (ADCHS_ADCCSS1_CSS9_SEL_AN9_Val << ADCHS_ADCCSS1_CSS9_Pos) /* (ADCHS_ADCCSS1) Select ANx for input scan (i.e.ANx = CSSx and scan is sequential starting with the lowest to highest enabled CSSx analog input pin) Position */
#define ADCHS_ADCCSS1_CSS9_SKIP_AN9           (ADCHS_ADCCSS1_CSS9_SKIP_AN9_Val << ADCHS_ADCCSS1_CSS9_Pos) /* (ADCHS_ADCCSS1) Skip ANx for input scan Position */
#define ADCHS_ADCCSS1_CSS10_Pos               _UINT32_(10)                                         /* (ADCHS_ADCCSS1) Analog Common Scan Select bits Position */
#define ADCHS_ADCCSS1_CSS10_Msk               (_UINT32_(0x1) << ADCHS_ADCCSS1_CSS10_Pos)           /* (ADCHS_ADCCSS1) Analog Common Scan Select bits Mask */
#define ADCHS_ADCCSS1_CSS10(value)            (ADCHS_ADCCSS1_CSS10_Msk & (_UINT32_(value) << ADCHS_ADCCSS1_CSS10_Pos)) /* Assignment of value for CSS10 in the ADCHS_ADCCSS1 register */
#define   ADCHS_ADCCSS1_CSS10_SEL_AN10_Val    _UINT32_(0x1)                                        /* (ADCHS_ADCCSS1) Select ANx for input scan (i.e.ANx = CSSx and scan is sequential starting with the lowest to highest enabled CSSx analog input pin)  */
#define   ADCHS_ADCCSS1_CSS10_SKIP_AN10_Val   _UINT32_(0x0)                                        /* (ADCHS_ADCCSS1) Skip ANx for input scan  */
#define ADCHS_ADCCSS1_CSS10_SEL_AN10          (ADCHS_ADCCSS1_CSS10_SEL_AN10_Val << ADCHS_ADCCSS1_CSS10_Pos) /* (ADCHS_ADCCSS1) Select ANx for input scan (i.e.ANx = CSSx and scan is sequential starting with the lowest to highest enabled CSSx analog input pin) Position */
#define ADCHS_ADCCSS1_CSS10_SKIP_AN10         (ADCHS_ADCCSS1_CSS10_SKIP_AN10_Val << ADCHS_ADCCSS1_CSS10_Pos) /* (ADCHS_ADCCSS1) Skip ANx for input scan Position */
#define ADCHS_ADCCSS1_CSS11_Pos               _UINT32_(11)                                         /* (ADCHS_ADCCSS1) Analog Common Scan Select bits Position */
#define ADCHS_ADCCSS1_CSS11_Msk               (_UINT32_(0x1) << ADCHS_ADCCSS1_CSS11_Pos)           /* (ADCHS_ADCCSS1) Analog Common Scan Select bits Mask */
#define ADCHS_ADCCSS1_CSS11(value)            (ADCHS_ADCCSS1_CSS11_Msk & (_UINT32_(value) << ADCHS_ADCCSS1_CSS11_Pos)) /* Assignment of value for CSS11 in the ADCHS_ADCCSS1 register */
#define   ADCHS_ADCCSS1_CSS11_SEL_AN11_Val    _UINT32_(0x1)                                        /* (ADCHS_ADCCSS1) Select ANx for input scan (i.e.ANx = CSSx and scan is sequential starting with the lowest to highest enabled CSSx analog input pin)  */
#define   ADCHS_ADCCSS1_CSS11_SKIP_AN11_Val   _UINT32_(0x0)                                        /* (ADCHS_ADCCSS1) Skip ANx for input scan  */
#define ADCHS_ADCCSS1_CSS11_SEL_AN11          (ADCHS_ADCCSS1_CSS11_SEL_AN11_Val << ADCHS_ADCCSS1_CSS11_Pos) /* (ADCHS_ADCCSS1) Select ANx for input scan (i.e.ANx = CSSx and scan is sequential starting with the lowest to highest enabled CSSx analog input pin) Position */
#define ADCHS_ADCCSS1_CSS11_SKIP_AN11         (ADCHS_ADCCSS1_CSS11_SKIP_AN11_Val << ADCHS_ADCCSS1_CSS11_Pos) /* (ADCHS_ADCCSS1) Skip ANx for input scan Position */
#define ADCHS_ADCCSS1_CSS12_Pos               _UINT32_(12)                                         /* (ADCHS_ADCCSS1) Analog Common Scan Select bits Position */
#define ADCHS_ADCCSS1_CSS12_Msk               (_UINT32_(0x1) << ADCHS_ADCCSS1_CSS12_Pos)           /* (ADCHS_ADCCSS1) Analog Common Scan Select bits Mask */
#define ADCHS_ADCCSS1_CSS12(value)            (ADCHS_ADCCSS1_CSS12_Msk & (_UINT32_(value) << ADCHS_ADCCSS1_CSS12_Pos)) /* Assignment of value for CSS12 in the ADCHS_ADCCSS1 register */
#define   ADCHS_ADCCSS1_CSS12_SEL_AN12_Val    _UINT32_(0x1)                                        /* (ADCHS_ADCCSS1) Select ANx for input scan (i.e.ANx = CSSx and scan is sequential starting with the lowest to highest enabled CSSx analog input pin)  */
#define   ADCHS_ADCCSS1_CSS12_SKIP_AN12_Val   _UINT32_(0x0)                                        /* (ADCHS_ADCCSS1) Skip ANx for input scan  */
#define ADCHS_ADCCSS1_CSS12_SEL_AN12          (ADCHS_ADCCSS1_CSS12_SEL_AN12_Val << ADCHS_ADCCSS1_CSS12_Pos) /* (ADCHS_ADCCSS1) Select ANx for input scan (i.e.ANx = CSSx and scan is sequential starting with the lowest to highest enabled CSSx analog input pin) Position */
#define ADCHS_ADCCSS1_CSS12_SKIP_AN12         (ADCHS_ADCCSS1_CSS12_SKIP_AN12_Val << ADCHS_ADCCSS1_CSS12_Pos) /* (ADCHS_ADCCSS1) Skip ANx for input scan Position */
#define ADCHS_ADCCSS1_CSS13_Pos               _UINT32_(13)                                         /* (ADCHS_ADCCSS1) Analog Common Scan Select bits Position */
#define ADCHS_ADCCSS1_CSS13_Msk               (_UINT32_(0x1) << ADCHS_ADCCSS1_CSS13_Pos)           /* (ADCHS_ADCCSS1) Analog Common Scan Select bits Mask */
#define ADCHS_ADCCSS1_CSS13(value)            (ADCHS_ADCCSS1_CSS13_Msk & (_UINT32_(value) << ADCHS_ADCCSS1_CSS13_Pos)) /* Assignment of value for CSS13 in the ADCHS_ADCCSS1 register */
#define   ADCHS_ADCCSS1_CSS13_SEL_AN13_Val    _UINT32_(0x1)                                        /* (ADCHS_ADCCSS1) Select ANx for input scan (i.e.ANx = CSSx and scan is sequential starting with the lowest to highest enabled CSSx analog input pin)  */
#define   ADCHS_ADCCSS1_CSS13_SKIP_AN13_Val   _UINT32_(0x0)                                        /* (ADCHS_ADCCSS1) Skip ANx for input scan  */
#define ADCHS_ADCCSS1_CSS13_SEL_AN13          (ADCHS_ADCCSS1_CSS13_SEL_AN13_Val << ADCHS_ADCCSS1_CSS13_Pos) /* (ADCHS_ADCCSS1) Select ANx for input scan (i.e.ANx = CSSx and scan is sequential starting with the lowest to highest enabled CSSx analog input pin) Position */
#define ADCHS_ADCCSS1_CSS13_SKIP_AN13         (ADCHS_ADCCSS1_CSS13_SKIP_AN13_Val << ADCHS_ADCCSS1_CSS13_Pos) /* (ADCHS_ADCCSS1) Skip ANx for input scan Position */
#define ADCHS_ADCCSS1_CSS14_Pos               _UINT32_(14)                                         /* (ADCHS_ADCCSS1) Analog Common Scan Select bits Position */
#define ADCHS_ADCCSS1_CSS14_Msk               (_UINT32_(0x1) << ADCHS_ADCCSS1_CSS14_Pos)           /* (ADCHS_ADCCSS1) Analog Common Scan Select bits Mask */
#define ADCHS_ADCCSS1_CSS14(value)            (ADCHS_ADCCSS1_CSS14_Msk & (_UINT32_(value) << ADCHS_ADCCSS1_CSS14_Pos)) /* Assignment of value for CSS14 in the ADCHS_ADCCSS1 register */
#define   ADCHS_ADCCSS1_CSS14_SEL_AN14_Val    _UINT32_(0x1)                                        /* (ADCHS_ADCCSS1) Select ANx for input scan (i.e.ANx = CSSx and scan is sequential starting with the lowest to highest enabled CSSx analog input pin)  */
#define   ADCHS_ADCCSS1_CSS14_SKIP_AN14_Val   _UINT32_(0x0)                                        /* (ADCHS_ADCCSS1) Skip ANx for input scan  */
#define ADCHS_ADCCSS1_CSS14_SEL_AN14          (ADCHS_ADCCSS1_CSS14_SEL_AN14_Val << ADCHS_ADCCSS1_CSS14_Pos) /* (ADCHS_ADCCSS1) Select ANx for input scan (i.e.ANx = CSSx and scan is sequential starting with the lowest to highest enabled CSSx analog input pin) Position */
#define ADCHS_ADCCSS1_CSS14_SKIP_AN14         (ADCHS_ADCCSS1_CSS14_SKIP_AN14_Val << ADCHS_ADCCSS1_CSS14_Pos) /* (ADCHS_ADCCSS1) Skip ANx for input scan Position */
#define ADCHS_ADCCSS1_CSS15_Pos               _UINT32_(15)                                         /* (ADCHS_ADCCSS1) Analog Common Scan Select bits Position */
#define ADCHS_ADCCSS1_CSS15_Msk               (_UINT32_(0x1) << ADCHS_ADCCSS1_CSS15_Pos)           /* (ADCHS_ADCCSS1) Analog Common Scan Select bits Mask */
#define ADCHS_ADCCSS1_CSS15(value)            (ADCHS_ADCCSS1_CSS15_Msk & (_UINT32_(value) << ADCHS_ADCCSS1_CSS15_Pos)) /* Assignment of value for CSS15 in the ADCHS_ADCCSS1 register */
#define   ADCHS_ADCCSS1_CSS15_SEL_AN15_Val    _UINT32_(0x1)                                        /* (ADCHS_ADCCSS1) Select ANx for input scan (i.e.ANx = CSSx and scan is sequential starting with the lowest to highest enabled CSSx analog input pin)  */
#define   ADCHS_ADCCSS1_CSS15_SKIP_AN15_Val   _UINT32_(0x0)                                        /* (ADCHS_ADCCSS1) Skip ANx for input scan  */
#define ADCHS_ADCCSS1_CSS15_SEL_AN15          (ADCHS_ADCCSS1_CSS15_SEL_AN15_Val << ADCHS_ADCCSS1_CSS15_Pos) /* (ADCHS_ADCCSS1) Select ANx for input scan (i.e.ANx = CSSx and scan is sequential starting with the lowest to highest enabled CSSx analog input pin) Position */
#define ADCHS_ADCCSS1_CSS15_SKIP_AN15         (ADCHS_ADCCSS1_CSS15_SKIP_AN15_Val << ADCHS_ADCCSS1_CSS15_Pos) /* (ADCHS_ADCCSS1) Skip ANx for input scan Position */
#define ADCHS_ADCCSS1_CSS16_Pos               _UINT32_(16)                                         /* (ADCHS_ADCCSS1) Analog Common Scan Select bits Position */
#define ADCHS_ADCCSS1_CSS16_Msk               (_UINT32_(0x1) << ADCHS_ADCCSS1_CSS16_Pos)           /* (ADCHS_ADCCSS1) Analog Common Scan Select bits Mask */
#define ADCHS_ADCCSS1_CSS16(value)            (ADCHS_ADCCSS1_CSS16_Msk & (_UINT32_(value) << ADCHS_ADCCSS1_CSS16_Pos)) /* Assignment of value for CSS16 in the ADCHS_ADCCSS1 register */
#define   ADCHS_ADCCSS1_CSS16_SEL_AN16_Val    _UINT32_(0x1)                                        /* (ADCHS_ADCCSS1) Select ANx for input scan (i.e.ANx = CSSx and scan is sequential starting with the lowest to highest enabled CSSx analog input pin)  */
#define   ADCHS_ADCCSS1_CSS16_SKIP_AN16_Val   _UINT32_(0x0)                                        /* (ADCHS_ADCCSS1) Skip ANx for input scan  */
#define ADCHS_ADCCSS1_CSS16_SEL_AN16          (ADCHS_ADCCSS1_CSS16_SEL_AN16_Val << ADCHS_ADCCSS1_CSS16_Pos) /* (ADCHS_ADCCSS1) Select ANx for input scan (i.e.ANx = CSSx and scan is sequential starting with the lowest to highest enabled CSSx analog input pin) Position */
#define ADCHS_ADCCSS1_CSS16_SKIP_AN16         (ADCHS_ADCCSS1_CSS16_SKIP_AN16_Val << ADCHS_ADCCSS1_CSS16_Pos) /* (ADCHS_ADCCSS1) Skip ANx for input scan Position */
#define ADCHS_ADCCSS1_CSS17_Pos               _UINT32_(17)                                         /* (ADCHS_ADCCSS1) Analog Common Scan Select bits Position */
#define ADCHS_ADCCSS1_CSS17_Msk               (_UINT32_(0x1) << ADCHS_ADCCSS1_CSS17_Pos)           /* (ADCHS_ADCCSS1) Analog Common Scan Select bits Mask */
#define ADCHS_ADCCSS1_CSS17(value)            (ADCHS_ADCCSS1_CSS17_Msk & (_UINT32_(value) << ADCHS_ADCCSS1_CSS17_Pos)) /* Assignment of value for CSS17 in the ADCHS_ADCCSS1 register */
