Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/test_app/firmware/src/packs/PIC32WM_BZ6204_DFP/component/adchs.h
#define   ADCHS_ADCCSS1_CSS17_SEL_AN17_Val    _UINT32_(0x1)                                        /* (ADCHS_ADCCSS1) Select ANx for input scan (i.e.ANx = CSSx and scan is sequential starting with the lowest to highest enabled CSSx analog input pin)  */
#define   ADCHS_ADCCSS1_CSS17_SKIP_AN17_Val   _UINT32_(0x0)                                        /* (ADCHS_ADCCSS1) Skip ANx for input scan  */
#define ADCHS_ADCCSS1_CSS17_SEL_AN17          (ADCHS_ADCCSS1_CSS17_SEL_AN17_Val << ADCHS_ADCCSS1_CSS17_Pos) /* (ADCHS_ADCCSS1) Select ANx for input scan (i.e.ANx = CSSx and scan is sequential starting with the lowest to highest enabled CSSx analog input pin) Position */
#define ADCHS_ADCCSS1_CSS17_SKIP_AN17         (ADCHS_ADCCSS1_CSS17_SKIP_AN17_Val << ADCHS_ADCCSS1_CSS17_Pos) /* (ADCHS_ADCCSS1) Skip ANx for input scan Position */
#define ADCHS_ADCCSS1_CSS18_Pos               _UINT32_(18)                                         /* (ADCHS_ADCCSS1) Analog Common Scan Select bits Position */
#define ADCHS_ADCCSS1_CSS18_Msk               (_UINT32_(0x1) << ADCHS_ADCCSS1_CSS18_Pos)           /* (ADCHS_ADCCSS1) Analog Common Scan Select bits Mask */
#define ADCHS_ADCCSS1_CSS18(value)            (ADCHS_ADCCSS1_CSS18_Msk & (_UINT32_(value) << ADCHS_ADCCSS1_CSS18_Pos)) /* Assignment of value for CSS18 in the ADCHS_ADCCSS1 register */
#define   ADCHS_ADCCSS1_CSS18_SEL_AN18_Val    _UINT32_(0x1)                                        /* (ADCHS_ADCCSS1) Select ANx for input scan (i.e.ANx = CSSx and scan is sequential starting with the lowest to highest enabled CSSx analog input pin)  */
#define   ADCHS_ADCCSS1_CSS18_SKIP_AN18_Val   _UINT32_(0x0)                                        /* (ADCHS_ADCCSS1) Skip ANx for input scan  */
#define ADCHS_ADCCSS1_CSS18_SEL_AN18          (ADCHS_ADCCSS1_CSS18_SEL_AN18_Val << ADCHS_ADCCSS1_CSS18_Pos) /* (ADCHS_ADCCSS1) Select ANx for input scan (i.e.ANx = CSSx and scan is sequential starting with the lowest to highest enabled CSSx analog input pin) Position */
#define ADCHS_ADCCSS1_CSS18_SKIP_AN18         (ADCHS_ADCCSS1_CSS18_SKIP_AN18_Val << ADCHS_ADCCSS1_CSS18_Pos) /* (ADCHS_ADCCSS1) Skip ANx for input scan Position */
#define ADCHS_ADCCSS1_CSS19_Pos               _UINT32_(19)                                         /* (ADCHS_ADCCSS1) Analog Common Scan Select bits Position */
#define ADCHS_ADCCSS1_CSS19_Msk               (_UINT32_(0x1) << ADCHS_ADCCSS1_CSS19_Pos)           /* (ADCHS_ADCCSS1) Analog Common Scan Select bits Mask */
#define ADCHS_ADCCSS1_CSS19(value)            (ADCHS_ADCCSS1_CSS19_Msk & (_UINT32_(value) << ADCHS_ADCCSS1_CSS19_Pos)) /* Assignment of value for CSS19 in the ADCHS_ADCCSS1 register */
#define   ADCHS_ADCCSS1_CSS19_SEL_AN19_Val    _UINT32_(0x1)                                        /* (ADCHS_ADCCSS1) Select ANx for input scan (i.e.ANx = CSSx and scan is sequential starting with the lowest to highest enabled CSSx analog input pin)  */
#define   ADCHS_ADCCSS1_CSS19_SKIP_AN19_Val   _UINT32_(0x0)                                        /* (ADCHS_ADCCSS1) Skip ANx for input scan  */
#define ADCHS_ADCCSS1_CSS19_SEL_AN19          (ADCHS_ADCCSS1_CSS19_SEL_AN19_Val << ADCHS_ADCCSS1_CSS19_Pos) /* (ADCHS_ADCCSS1) Select ANx for input scan (i.e.ANx = CSSx and scan is sequential starting with the lowest to highest enabled CSSx analog input pin) Position */
#define ADCHS_ADCCSS1_CSS19_SKIP_AN19         (ADCHS_ADCCSS1_CSS19_SKIP_AN19_Val << ADCHS_ADCCSS1_CSS19_Pos) /* (ADCHS_ADCCSS1) Skip ANx for input scan Position */
#define ADCHS_ADCCSS1_CSS20_Pos               _UINT32_(20)                                         /* (ADCHS_ADCCSS1) Analog Common Scan Select bits Position */
#define ADCHS_ADCCSS1_CSS20_Msk               (_UINT32_(0x1) << ADCHS_ADCCSS1_CSS20_Pos)           /* (ADCHS_ADCCSS1) Analog Common Scan Select bits Mask */
#define ADCHS_ADCCSS1_CSS20(value)            (ADCHS_ADCCSS1_CSS20_Msk & (_UINT32_(value) << ADCHS_ADCCSS1_CSS20_Pos)) /* Assignment of value for CSS20 in the ADCHS_ADCCSS1 register */
#define   ADCHS_ADCCSS1_CSS20_SEL_AN20_Val    _UINT32_(0x1)                                        /* (ADCHS_ADCCSS1) Select ANx for input scan (i.e.ANx = CSSx and scan is sequential starting with the lowest to highest enabled CSSx analog input pin)  */
#define   ADCHS_ADCCSS1_CSS20_SKIP_AN20_Val   _UINT32_(0x0)                                        /* (ADCHS_ADCCSS1) Skip ANx for input scan  */
#define ADCHS_ADCCSS1_CSS20_SEL_AN20          (ADCHS_ADCCSS1_CSS20_SEL_AN20_Val << ADCHS_ADCCSS1_CSS20_Pos) /* (ADCHS_ADCCSS1) Select ANx for input scan (i.e.ANx = CSSx and scan is sequential starting with the lowest to highest enabled CSSx analog input pin) Position */
#define ADCHS_ADCCSS1_CSS20_SKIP_AN20         (ADCHS_ADCCSS1_CSS20_SKIP_AN20_Val << ADCHS_ADCCSS1_CSS20_Pos) /* (ADCHS_ADCCSS1) Skip ANx for input scan Position */
#define ADCHS_ADCCSS1_CSS21_Pos               _UINT32_(21)                                         /* (ADCHS_ADCCSS1) Analog Common Scan Select bits Position */
#define ADCHS_ADCCSS1_CSS21_Msk               (_UINT32_(0x1) << ADCHS_ADCCSS1_CSS21_Pos)           /* (ADCHS_ADCCSS1) Analog Common Scan Select bits Mask */
#define ADCHS_ADCCSS1_CSS21(value)            (ADCHS_ADCCSS1_CSS21_Msk & (_UINT32_(value) << ADCHS_ADCCSS1_CSS21_Pos)) /* Assignment of value for CSS21 in the ADCHS_ADCCSS1 register */
#define   ADCHS_ADCCSS1_CSS21_SEL_AN21_Val    _UINT32_(0x1)                                        /* (ADCHS_ADCCSS1) Select ANx for input scan (i.e.ANx = CSSx and scan is sequential starting with the lowest to highest enabled CSSx analog input pin)  */
#define   ADCHS_ADCCSS1_CSS21_SKIP_AN21_Val   _UINT32_(0x0)                                        /* (ADCHS_ADCCSS1) Skip ANx for input scan  */
#define ADCHS_ADCCSS1_CSS21_SEL_AN21          (ADCHS_ADCCSS1_CSS21_SEL_AN21_Val << ADCHS_ADCCSS1_CSS21_Pos) /* (ADCHS_ADCCSS1) Select ANx for input scan (i.e.ANx = CSSx and scan is sequential starting with the lowest to highest enabled CSSx analog input pin) Position */
#define ADCHS_ADCCSS1_CSS21_SKIP_AN21         (ADCHS_ADCCSS1_CSS21_SKIP_AN21_Val << ADCHS_ADCCSS1_CSS21_Pos) /* (ADCHS_ADCCSS1) Skip ANx for input scan Position */
#define ADCHS_ADCCSS1_CSS22_Pos               _UINT32_(22)                                         /* (ADCHS_ADCCSS1) Analog Common Scan Select bits Position */
#define ADCHS_ADCCSS1_CSS22_Msk               (_UINT32_(0x1) << ADCHS_ADCCSS1_CSS22_Pos)           /* (ADCHS_ADCCSS1) Analog Common Scan Select bits Mask */
#define ADCHS_ADCCSS1_CSS22(value)            (ADCHS_ADCCSS1_CSS22_Msk & (_UINT32_(value) << ADCHS_ADCCSS1_CSS22_Pos)) /* Assignment of value for CSS22 in the ADCHS_ADCCSS1 register */
#define   ADCHS_ADCCSS1_CSS22_SEL_AN22_Val    _UINT32_(0x1)                                        /* (ADCHS_ADCCSS1) Select ANx for input scan (i.e.ANx = CSSx and scan is sequential starting with the lowest to highest enabled CSSx analog input pin)  */
#define   ADCHS_ADCCSS1_CSS22_SKIP_AN22_Val   _UINT32_(0x0)                                        /* (ADCHS_ADCCSS1) Skip ANx for input scan  */
#define ADCHS_ADCCSS1_CSS22_SEL_AN22          (ADCHS_ADCCSS1_CSS22_SEL_AN22_Val << ADCHS_ADCCSS1_CSS22_Pos) /* (ADCHS_ADCCSS1) Select ANx for input scan (i.e.ANx = CSSx and scan is sequential starting with the lowest to highest enabled CSSx analog input pin) Position */
#define ADCHS_ADCCSS1_CSS22_SKIP_AN22         (ADCHS_ADCCSS1_CSS22_SKIP_AN22_Val << ADCHS_ADCCSS1_CSS22_Pos) /* (ADCHS_ADCCSS1) Skip ANx for input scan Position */
#define ADCHS_ADCCSS1_Msk                     _UINT32_(0x007FFFFF)                                 /* (ADCHS_ADCCSS1) Register Mask  */

#define ADCHS_ADCCSS1_CSS_Pos                 _UINT32_(0)                                          /* (ADCHS_ADCCSS1 Position) Analog Common Scan Select bits */
#define ADCHS_ADCCSS1_CSS_Msk                 (_UINT32_(0x7FFFFF) << ADCHS_ADCCSS1_CSS_Pos)        /* (ADCHS_ADCCSS1 Mask) CSS */
#define ADCHS_ADCCSS1_CSS(value)              (ADCHS_ADCCSS1_CSS_Msk & (_UINT32_(value) << ADCHS_ADCCSS1_CSS_Pos)) 

/* -------- ADCHS_ADCCSS1CLR : (ADCHS Offset: 0xA4) (R/W 32) Bit clear register -------- */
#define ADCHS_ADCCSS1CLR_RESETVALUE           _UINT32_(0x00)                                       /*  (ADCHS_ADCCSS1CLR) Bit clear register  Reset Value */

#define ADCHS_ADCCSS1CLR_Msk                  _UINT32_(0x00000000)                                 /* (ADCHS_ADCCSS1CLR) Register Mask  */


/* -------- ADCHS_ADCCSS1SET : (ADCHS Offset: 0xA8) (R/W 32) Bit set register -------- */
#define ADCHS_ADCCSS1SET_RESETVALUE           _UINT32_(0x00)                                       /*  (ADCHS_ADCCSS1SET) Bit set register  Reset Value */

#define ADCHS_ADCCSS1SET_Msk                  _UINT32_(0x00000000)                                 /* (ADCHS_ADCCSS1SET) Register Mask  */


/* -------- ADCHS_ADCCSS1INV : (ADCHS Offset: 0xAC) (R/W 32) Bit invert register -------- */
#define ADCHS_ADCCSS1INV_RESETVALUE           _UINT32_(0x00)                                       /*  (ADCHS_ADCCSS1INV) Bit invert register  Reset Value */

