Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/test_app/firmware/src/packs/PIC32WM_BZ6204_DFP/component/adchs.h
#define ADCHS_ADCCSS1INV_Msk                  _UINT32_(0x00000000)                                 /* (ADCHS_ADCCSS1INV) Register Mask  */


/* -------- ADCHS_ADCDSTAT1 : (ADCHS Offset: 0xC0) (R/W 32)  -------- */
#define ADCHS_ADCDSTAT1_RESETVALUE            _UINT32_(0x00)                                       /*  (ADCHS_ADCDSTAT1)   Reset Value */

#define ADCHS_ADCDSTAT1_ARDY0_Pos             _UINT32_(0)                                          /* (ADCHS_ADCDSTAT1)  Position */
#define ADCHS_ADCDSTAT1_ARDY0_Msk             (_UINT32_(0x1) << ADCHS_ADCDSTAT1_ARDY0_Pos)         /* (ADCHS_ADCDSTAT1)  Mask */
#define ADCHS_ADCDSTAT1_ARDY0(value)          (ADCHS_ADCDSTAT1_ARDY0_Msk & (_UINT32_(value) << ADCHS_ADCDSTAT1_ARDY0_Pos)) /* Assignment of value for ARDY0 in the ADCHS_ADCDSTAT1 register */
#define ADCHS_ADCDSTAT1_ARDY1_Pos             _UINT32_(1)                                          /* (ADCHS_ADCDSTAT1)  Position */
#define ADCHS_ADCDSTAT1_ARDY1_Msk             (_UINT32_(0x1) << ADCHS_ADCDSTAT1_ARDY1_Pos)         /* (ADCHS_ADCDSTAT1)  Mask */
#define ADCHS_ADCDSTAT1_ARDY1(value)          (ADCHS_ADCDSTAT1_ARDY1_Msk & (_UINT32_(value) << ADCHS_ADCDSTAT1_ARDY1_Pos)) /* Assignment of value for ARDY1 in the ADCHS_ADCDSTAT1 register */
#define ADCHS_ADCDSTAT1_ARDY2_Pos             _UINT32_(2)                                          /* (ADCHS_ADCDSTAT1)  Position */
#define ADCHS_ADCDSTAT1_ARDY2_Msk             (_UINT32_(0x1) << ADCHS_ADCDSTAT1_ARDY2_Pos)         /* (ADCHS_ADCDSTAT1)  Mask */
#define ADCHS_ADCDSTAT1_ARDY2(value)          (ADCHS_ADCDSTAT1_ARDY2_Msk & (_UINT32_(value) << ADCHS_ADCDSTAT1_ARDY2_Pos)) /* Assignment of value for ARDY2 in the ADCHS_ADCDSTAT1 register */
#define ADCHS_ADCDSTAT1_ARDY3_Pos             _UINT32_(3)                                          /* (ADCHS_ADCDSTAT1)  Position */
#define ADCHS_ADCDSTAT1_ARDY3_Msk             (_UINT32_(0x1) << ADCHS_ADCDSTAT1_ARDY3_Pos)         /* (ADCHS_ADCDSTAT1)  Mask */
#define ADCHS_ADCDSTAT1_ARDY3(value)          (ADCHS_ADCDSTAT1_ARDY3_Msk & (_UINT32_(value) << ADCHS_ADCDSTAT1_ARDY3_Pos)) /* Assignment of value for ARDY3 in the ADCHS_ADCDSTAT1 register */
#define ADCHS_ADCDSTAT1_ARDY4_Pos             _UINT32_(4)                                          /* (ADCHS_ADCDSTAT1)  Position */
#define ADCHS_ADCDSTAT1_ARDY4_Msk             (_UINT32_(0x1) << ADCHS_ADCDSTAT1_ARDY4_Pos)         /* (ADCHS_ADCDSTAT1)  Mask */
#define ADCHS_ADCDSTAT1_ARDY4(value)          (ADCHS_ADCDSTAT1_ARDY4_Msk & (_UINT32_(value) << ADCHS_ADCDSTAT1_ARDY4_Pos)) /* Assignment of value for ARDY4 in the ADCHS_ADCDSTAT1 register */
#define ADCHS_ADCDSTAT1_ARDY5_Pos             _UINT32_(5)                                          /* (ADCHS_ADCDSTAT1)  Position */
#define ADCHS_ADCDSTAT1_ARDY5_Msk             (_UINT32_(0x1) << ADCHS_ADCDSTAT1_ARDY5_Pos)         /* (ADCHS_ADCDSTAT1)  Mask */
#define ADCHS_ADCDSTAT1_ARDY5(value)          (ADCHS_ADCDSTAT1_ARDY5_Msk & (_UINT32_(value) << ADCHS_ADCDSTAT1_ARDY5_Pos)) /* Assignment of value for ARDY5 in the ADCHS_ADCDSTAT1 register */
#define ADCHS_ADCDSTAT1_ARDY6_Pos             _UINT32_(6)                                          /* (ADCHS_ADCDSTAT1)  Position */
#define ADCHS_ADCDSTAT1_ARDY6_Msk             (_UINT32_(0x1) << ADCHS_ADCDSTAT1_ARDY6_Pos)         /* (ADCHS_ADCDSTAT1)  Mask */
#define ADCHS_ADCDSTAT1_ARDY6(value)          (ADCHS_ADCDSTAT1_ARDY6_Msk & (_UINT32_(value) << ADCHS_ADCDSTAT1_ARDY6_Pos)) /* Assignment of value for ARDY6 in the ADCHS_ADCDSTAT1 register */
#define ADCHS_ADCDSTAT1_ARDY7_Pos             _UINT32_(7)                                          /* (ADCHS_ADCDSTAT1)  Position */
#define ADCHS_ADCDSTAT1_ARDY7_Msk             (_UINT32_(0x1) << ADCHS_ADCDSTAT1_ARDY7_Pos)         /* (ADCHS_ADCDSTAT1)  Mask */
#define ADCHS_ADCDSTAT1_ARDY7(value)          (ADCHS_ADCDSTAT1_ARDY7_Msk & (_UINT32_(value) << ADCHS_ADCDSTAT1_ARDY7_Pos)) /* Assignment of value for ARDY7 in the ADCHS_ADCDSTAT1 register */
#define ADCHS_ADCDSTAT1_ARDY8_Pos             _UINT32_(8)                                          /* (ADCHS_ADCDSTAT1)  Position */
#define ADCHS_ADCDSTAT1_ARDY8_Msk             (_UINT32_(0x1) << ADCHS_ADCDSTAT1_ARDY8_Pos)         /* (ADCHS_ADCDSTAT1)  Mask */
#define ADCHS_ADCDSTAT1_ARDY8(value)          (ADCHS_ADCDSTAT1_ARDY8_Msk & (_UINT32_(value) << ADCHS_ADCDSTAT1_ARDY8_Pos)) /* Assignment of value for ARDY8 in the ADCHS_ADCDSTAT1 register */
#define ADCHS_ADCDSTAT1_ARDY9_Pos             _UINT32_(9)                                          /* (ADCHS_ADCDSTAT1)  Position */
#define ADCHS_ADCDSTAT1_ARDY9_Msk             (_UINT32_(0x1) << ADCHS_ADCDSTAT1_ARDY9_Pos)         /* (ADCHS_ADCDSTAT1)  Mask */
#define ADCHS_ADCDSTAT1_ARDY9(value)          (ADCHS_ADCDSTAT1_ARDY9_Msk & (_UINT32_(value) << ADCHS_ADCDSTAT1_ARDY9_Pos)) /* Assignment of value for ARDY9 in the ADCHS_ADCDSTAT1 register */
#define ADCHS_ADCDSTAT1_ARDY10_Pos            _UINT32_(10)                                         /* (ADCHS_ADCDSTAT1)  Position */
#define ADCHS_ADCDSTAT1_ARDY10_Msk            (_UINT32_(0x1) << ADCHS_ADCDSTAT1_ARDY10_Pos)        /* (ADCHS_ADCDSTAT1)  Mask */
#define ADCHS_ADCDSTAT1_ARDY10(value)         (ADCHS_ADCDSTAT1_ARDY10_Msk & (_UINT32_(value) << ADCHS_ADCDSTAT1_ARDY10_Pos)) /* Assignment of value for ARDY10 in the ADCHS_ADCDSTAT1 register */
#define ADCHS_ADCDSTAT1_ARDY11_Pos            _UINT32_(11)                                         /* (ADCHS_ADCDSTAT1)  Position */
#define ADCHS_ADCDSTAT1_ARDY11_Msk            (_UINT32_(0x1) << ADCHS_ADCDSTAT1_ARDY11_Pos)        /* (ADCHS_ADCDSTAT1)  Mask */
#define ADCHS_ADCDSTAT1_ARDY11(value)         (ADCHS_ADCDSTAT1_ARDY11_Msk & (_UINT32_(value) << ADCHS_ADCDSTAT1_ARDY11_Pos)) /* Assignment of value for ARDY11 in the ADCHS_ADCDSTAT1 register */
#define ADCHS_ADCDSTAT1_ARDY12_Pos            _UINT32_(12)                                         /* (ADCHS_ADCDSTAT1)  Position */
#define ADCHS_ADCDSTAT1_ARDY12_Msk            (_UINT32_(0x1) << ADCHS_ADCDSTAT1_ARDY12_Pos)        /* (ADCHS_ADCDSTAT1)  Mask */
#define ADCHS_ADCDSTAT1_ARDY12(value)         (ADCHS_ADCDSTAT1_ARDY12_Msk & (_UINT32_(value) << ADCHS_ADCDSTAT1_ARDY12_Pos)) /* Assignment of value for ARDY12 in the ADCHS_ADCDSTAT1 register */
#define ADCHS_ADCDSTAT1_ARDY13_Pos            _UINT32_(13)                                         /* (ADCHS_ADCDSTAT1)  Position */
#define ADCHS_ADCDSTAT1_ARDY13_Msk            (_UINT32_(0x1) << ADCHS_ADCDSTAT1_ARDY13_Pos)        /* (ADCHS_ADCDSTAT1)  Mask */
#define ADCHS_ADCDSTAT1_ARDY13(value)         (ADCHS_ADCDSTAT1_ARDY13_Msk & (_UINT32_(value) << ADCHS_ADCDSTAT1_ARDY13_Pos)) /* Assignment of value for ARDY13 in the ADCHS_ADCDSTAT1 register */
#define ADCHS_ADCDSTAT1_ARDY14_Pos            _UINT32_(14)                                         /* (ADCHS_ADCDSTAT1)  Position */
#define ADCHS_ADCDSTAT1_ARDY14_Msk            (_UINT32_(0x1) << ADCHS_ADCDSTAT1_ARDY14_Pos)        /* (ADCHS_ADCDSTAT1)  Mask */
#define ADCHS_ADCDSTAT1_ARDY14(value)         (ADCHS_ADCDSTAT1_ARDY14_Msk & (_UINT32_(value) << ADCHS_ADCDSTAT1_ARDY14_Pos)) /* Assignment of value for ARDY14 in the ADCHS_ADCDSTAT1 register */
#define ADCHS_ADCDSTAT1_ARDY15_Pos            _UINT32_(15)                                         /* (ADCHS_ADCDSTAT1)  Position */
#define ADCHS_ADCDSTAT1_ARDY15_Msk            (_UINT32_(0x1) << ADCHS_ADCDSTAT1_ARDY15_Pos)        /* (ADCHS_ADCDSTAT1)  Mask */
#define ADCHS_ADCDSTAT1_ARDY15(value)         (ADCHS_ADCDSTAT1_ARDY15_Msk & (_UINT32_(value) << ADCHS_ADCDSTAT1_ARDY15_Pos)) /* Assignment of value for ARDY15 in the ADCHS_ADCDSTAT1 register */
#define ADCHS_ADCDSTAT1_ARDY16_Pos            _UINT32_(16)                                         /* (ADCHS_ADCDSTAT1)  Position */
#define ADCHS_ADCDSTAT1_ARDY16_Msk            (_UINT32_(0x1) << ADCHS_ADCDSTAT1_ARDY16_Pos)        /* (ADCHS_ADCDSTAT1)  Mask */
#define ADCHS_ADCDSTAT1_ARDY16(value)         (ADCHS_ADCDSTAT1_ARDY16_Msk & (_UINT32_(value) << ADCHS_ADCDSTAT1_ARDY16_Pos)) /* Assignment of value for ARDY16 in the ADCHS_ADCDSTAT1 register */
#define ADCHS_ADCDSTAT1_ARDY17_Pos            _UINT32_(17)                                         /* (ADCHS_ADCDSTAT1)  Position */
#define ADCHS_ADCDSTAT1_ARDY17_Msk            (_UINT32_(0x1) << ADCHS_ADCDSTAT1_ARDY17_Pos)        /* (ADCHS_ADCDSTAT1)  Mask */
#define ADCHS_ADCDSTAT1_ARDY17(value)         (ADCHS_ADCDSTAT1_ARDY17_Msk & (_UINT32_(value) << ADCHS_ADCDSTAT1_ARDY17_Pos)) /* Assignment of value for ARDY17 in the ADCHS_ADCDSTAT1 register */
#define ADCHS_ADCDSTAT1_ARDY18_Pos            _UINT32_(18)                                         /* (ADCHS_ADCDSTAT1)  Position */
#define ADCHS_ADCDSTAT1_ARDY18_Msk            (_UINT32_(0x1) << ADCHS_ADCDSTAT1_ARDY18_Pos)        /* (ADCHS_ADCDSTAT1)  Mask */
#define ADCHS_ADCDSTAT1_ARDY18(value)         (ADCHS_ADCDSTAT1_ARDY18_Msk & (_UINT32_(value) << ADCHS_ADCDSTAT1_ARDY18_Pos)) /* Assignment of value for ARDY18 in the ADCHS_ADCDSTAT1 register */
#define ADCHS_ADCDSTAT1_ARDY19_Pos            _UINT32_(19)                                         /* (ADCHS_ADCDSTAT1)  Position */
#define ADCHS_ADCDSTAT1_ARDY19_Msk            (_UINT32_(0x1) << ADCHS_ADCDSTAT1_ARDY19_Pos)        /* (ADCHS_ADCDSTAT1)  Mask */
#define ADCHS_ADCDSTAT1_ARDY19(value)         (ADCHS_ADCDSTAT1_ARDY19_Msk & (_UINT32_(value) << ADCHS_ADCDSTAT1_ARDY19_Pos)) /* Assignment of value for ARDY19 in the ADCHS_ADCDSTAT1 register */
#define ADCHS_ADCDSTAT1_ARDY20_Pos            _UINT32_(20)                                         /* (ADCHS_ADCDSTAT1)  Position */
#define ADCHS_ADCDSTAT1_ARDY20_Msk            (_UINT32_(0x1) << ADCHS_ADCDSTAT1_ARDY20_Pos)        /* (ADCHS_ADCDSTAT1)  Mask */
#define ADCHS_ADCDSTAT1_ARDY20(value)         (ADCHS_ADCDSTAT1_ARDY20_Msk & (_UINT32_(value) << ADCHS_ADCDSTAT1_ARDY20_Pos)) /* Assignment of value for ARDY20 in the ADCHS_ADCDSTAT1 register */
#define ADCHS_ADCDSTAT1_ARDY21_Pos            _UINT32_(21)                                         /* (ADCHS_ADCDSTAT1)  Position */
#define ADCHS_ADCDSTAT1_ARDY21_Msk            (_UINT32_(0x1) << ADCHS_ADCDSTAT1_ARDY21_Pos)        /* (ADCHS_ADCDSTAT1)  Mask */
#define ADCHS_ADCDSTAT1_ARDY21(value)         (ADCHS_ADCDSTAT1_ARDY21_Msk & (_UINT32_(value) << ADCHS_ADCDSTAT1_ARDY21_Pos)) /* Assignment of value for ARDY21 in the ADCHS_ADCDSTAT1 register */
#define ADCHS_ADCDSTAT1_ARDY22_Pos            _UINT32_(22)                                         /* (ADCHS_ADCDSTAT1)  Position */
#define ADCHS_ADCDSTAT1_ARDY22_Msk            (_UINT32_(0x1) << ADCHS_ADCDSTAT1_ARDY22_Pos)        /* (ADCHS_ADCDSTAT1)  Mask */
#define ADCHS_ADCDSTAT1_ARDY22(value)         (ADCHS_ADCDSTAT1_ARDY22_Msk & (_UINT32_(value) << ADCHS_ADCDSTAT1_ARDY22_Pos)) /* Assignment of value for ARDY22 in the ADCHS_ADCDSTAT1 register */
#define ADCHS_ADCDSTAT1_Msk                   _UINT32_(0x007FFFFF)                                 /* (ADCHS_ADCDSTAT1) Register Mask  */

