Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/test_app/firmware/src/packs/PIC32WM_BZ6204_DFP/component/adchs.h
/* -------- ADCHS_ADCCMPEN0CLR : (ADCHS Offset: 0xE4) (R/W 32) Bit clear register -------- */
#define ADCHS_ADCCMPEN0CLR_RESETVALUE         _UINT32_(0x00)                                       /*  (ADCHS_ADCCMPEN0CLR) Bit clear register  Reset Value */

#define ADCHS_ADCCMPEN0CLR_Msk                _UINT32_(0x00000000)                                 /* (ADCHS_ADCCMPEN0CLR) Register Mask  */


/* -------- ADCHS_ADCCMPEN0SET : (ADCHS Offset: 0xE8) (R/W 32) Bit set register -------- */
#define ADCHS_ADCCMPEN0SET_RESETVALUE         _UINT32_(0x00)                                       /*  (ADCHS_ADCCMPEN0SET) Bit set register  Reset Value */

#define ADCHS_ADCCMPEN0SET_Msk                _UINT32_(0x00000000)                                 /* (ADCHS_ADCCMPEN0SET) Register Mask  */


/* -------- ADCHS_ADCCMPEN0INV : (ADCHS Offset: 0xEC) (R/W 32) Bit invert register -------- */
#define ADCHS_ADCCMPEN0INV_RESETVALUE         _UINT32_(0x00)                                       /*  (ADCHS_ADCCMPEN0INV) Bit invert register  Reset Value */

#define ADCHS_ADCCMPEN0INV_Msk                _UINT32_(0x00000000)                                 /* (ADCHS_ADCCMPEN0INV) Register Mask  */


/* -------- ADCHS_ADCCMP1 : (ADCHS Offset: 0xF0) (R/W 32)  -------- */
#define ADCHS_ADCCMP1_RESETVALUE              _UINT32_(0x00)                                       /*  (ADCHS_ADCCMP1)   Reset Value */

#define ADCHS_ADCCMP1_ADCMPLO_Pos             _UINT32_(0)                                          /* (ADCHS_ADCCMP1)  Position */
#define ADCHS_ADCCMP1_ADCMPLO_Msk             (_UINT32_(0xFFFF) << ADCHS_ADCCMP1_ADCMPLO_Pos)      /* (ADCHS_ADCCMP1)  Mask */
#define ADCHS_ADCCMP1_ADCMPLO(value)          (ADCHS_ADCCMP1_ADCMPLO_Msk & (_UINT32_(value) << ADCHS_ADCCMP1_ADCMPLO_Pos)) /* Assignment of value for ADCMPLO in the ADCHS_ADCCMP1 register */
#define ADCHS_ADCCMP1_ADCMPHI_Pos             _UINT32_(16)                                         /* (ADCHS_ADCCMP1)  Position */
#define ADCHS_ADCCMP1_ADCMPHI_Msk             (_UINT32_(0xFFFF) << ADCHS_ADCCMP1_ADCMPHI_Pos)      /* (ADCHS_ADCCMP1)  Mask */
#define ADCHS_ADCCMP1_ADCMPHI(value)          (ADCHS_ADCCMP1_ADCMPHI_Msk & (_UINT32_(value) << ADCHS_ADCCMP1_ADCMPHI_Pos)) /* Assignment of value for ADCMPHI in the ADCHS_ADCCMP1 register */
#define ADCHS_ADCCMP1_Msk                     _UINT32_(0xFFFFFFFF)                                 /* (ADCHS_ADCCMP1) Register Mask  */


/* -------- ADCHS_ADCCMP0CLR : (ADCHS Offset: 0xF4) (R/W 32) Bit clear register -------- */
#define ADCHS_ADCCMP0CLR_RESETVALUE           _UINT32_(0x00)                                       /*  (ADCHS_ADCCMP0CLR) Bit clear register  Reset Value */

#define ADCHS_ADCCMP0CLR_Msk                  _UINT32_(0x00000000)                                 /* (ADCHS_ADCCMP0CLR) Register Mask  */


/* -------- ADCHS_ADCCMP0SET : (ADCHS Offset: 0xF8) (R/W 32) Bit set register -------- */
#define ADCHS_ADCCMP0SET_RESETVALUE           _UINT32_(0x00)                                       /*  (ADCHS_ADCCMP0SET) Bit set register  Reset Value */

#define ADCHS_ADCCMP0SET_Msk                  _UINT32_(0x00000000)                                 /* (ADCHS_ADCCMP0SET) Register Mask  */


/* -------- ADCHS_ADCCMP0INV : (ADCHS Offset: 0xFC) (R/W 32) Bit invert register -------- */
#define ADCHS_ADCCMP0INV_RESETVALUE           _UINT32_(0x00)                                       /*  (ADCHS_ADCCMP0INV) Bit invert register  Reset Value */

#define ADCHS_ADCCMP0INV_Msk                  _UINT32_(0x00000000)                                 /* (ADCHS_ADCCMP0INV) Register Mask  */


/* -------- ADCHS_ADCCMPEN2 : (ADCHS Offset: 0x100) (R/W 32)  -------- */
#define ADCHS_ADCCMPEN2_RESETVALUE            _UINT32_(0x00)                                       /*  (ADCHS_ADCCMPEN2)   Reset Value */

#define ADCHS_ADCCMPEN2_CMPE0_Pos             _UINT32_(0)                                          /* (ADCHS_ADCCMPEN2)  Position */
#define ADCHS_ADCCMPEN2_CMPE0_Msk             (_UINT32_(0x1) << ADCHS_ADCCMPEN2_CMPE0_Pos)         /* (ADCHS_ADCCMPEN2)  Mask */
#define ADCHS_ADCCMPEN2_CMPE0(value)          (ADCHS_ADCCMPEN2_CMPE0_Msk & (_UINT32_(value) << ADCHS_ADCCMPEN2_CMPE0_Pos)) /* Assignment of value for CMPE0 in the ADCHS_ADCCMPEN2 register */
#define ADCHS_ADCCMPEN2_CMPE1_Pos             _UINT32_(1)                                          /* (ADCHS_ADCCMPEN2)  Position */
#define ADCHS_ADCCMPEN2_CMPE1_Msk             (_UINT32_(0x1) << ADCHS_ADCCMPEN2_CMPE1_Pos)         /* (ADCHS_ADCCMPEN2)  Mask */
#define ADCHS_ADCCMPEN2_CMPE1(value)          (ADCHS_ADCCMPEN2_CMPE1_Msk & (_UINT32_(value) << ADCHS_ADCCMPEN2_CMPE1_Pos)) /* Assignment of value for CMPE1 in the ADCHS_ADCCMPEN2 register */
#define ADCHS_ADCCMPEN2_CMPE2_Pos             _UINT32_(2)                                          /* (ADCHS_ADCCMPEN2)  Position */
#define ADCHS_ADCCMPEN2_CMPE2_Msk             (_UINT32_(0x1) << ADCHS_ADCCMPEN2_CMPE2_Pos)         /* (ADCHS_ADCCMPEN2)  Mask */
#define ADCHS_ADCCMPEN2_CMPE2(value)          (ADCHS_ADCCMPEN2_CMPE2_Msk & (_UINT32_(value) << ADCHS_ADCCMPEN2_CMPE2_Pos)) /* Assignment of value for CMPE2 in the ADCHS_ADCCMPEN2 register */
#define ADCHS_ADCCMPEN2_CMPE3_Pos             _UINT32_(3)                                          /* (ADCHS_ADCCMPEN2)  Position */
#define ADCHS_ADCCMPEN2_CMPE3_Msk             (_UINT32_(0x1) << ADCHS_ADCCMPEN2_CMPE3_Pos)         /* (ADCHS_ADCCMPEN2)  Mask */
#define ADCHS_ADCCMPEN2_CMPE3(value)          (ADCHS_ADCCMPEN2_CMPE3_Msk & (_UINT32_(value) << ADCHS_ADCCMPEN2_CMPE3_Pos)) /* Assignment of value for CMPE3 in the ADCHS_ADCCMPEN2 register */
#define ADCHS_ADCCMPEN2_CMPE4_Pos             _UINT32_(4)                                          /* (ADCHS_ADCCMPEN2)  Position */
#define ADCHS_ADCCMPEN2_CMPE4_Msk             (_UINT32_(0x1) << ADCHS_ADCCMPEN2_CMPE4_Pos)         /* (ADCHS_ADCCMPEN2)  Mask */
#define ADCHS_ADCCMPEN2_CMPE4(value)          (ADCHS_ADCCMPEN2_CMPE4_Msk & (_UINT32_(value) << ADCHS_ADCCMPEN2_CMPE4_Pos)) /* Assignment of value for CMPE4 in the ADCHS_ADCCMPEN2 register */
#define ADCHS_ADCCMPEN2_CMPE5_Pos             _UINT32_(5)                                          /* (ADCHS_ADCCMPEN2)  Position */
#define ADCHS_ADCCMPEN2_CMPE5_Msk             (_UINT32_(0x1) << ADCHS_ADCCMPEN2_CMPE5_Pos)         /* (ADCHS_ADCCMPEN2)  Mask */
#define ADCHS_ADCCMPEN2_CMPE5(value)          (ADCHS_ADCCMPEN2_CMPE5_Msk & (_UINT32_(value) << ADCHS_ADCCMPEN2_CMPE5_Pos)) /* Assignment of value for CMPE5 in the ADCHS_ADCCMPEN2 register */
#define ADCHS_ADCCMPEN2_CMPE6_Pos             _UINT32_(6)                                          /* (ADCHS_ADCCMPEN2)  Position */
#define ADCHS_ADCCMPEN2_CMPE6_Msk             (_UINT32_(0x1) << ADCHS_ADCCMPEN2_CMPE6_Pos)         /* (ADCHS_ADCCMPEN2)  Mask */
#define ADCHS_ADCCMPEN2_CMPE6(value)          (ADCHS_ADCCMPEN2_CMPE6_Msk & (_UINT32_(value) << ADCHS_ADCCMPEN2_CMPE6_Pos)) /* Assignment of value for CMPE6 in the ADCHS_ADCCMPEN2 register */
#define ADCHS_ADCCMPEN2_CMPE7_Pos             _UINT32_(7)                                          /* (ADCHS_ADCCMPEN2)  Position */
#define ADCHS_ADCCMPEN2_CMPE7_Msk             (_UINT32_(0x1) << ADCHS_ADCCMPEN2_CMPE7_Pos)         /* (ADCHS_ADCCMPEN2)  Mask */
#define ADCHS_ADCCMPEN2_CMPE7(value)          (ADCHS_ADCCMPEN2_CMPE7_Msk & (_UINT32_(value) << ADCHS_ADCCMPEN2_CMPE7_Pos)) /* Assignment of value for CMPE7 in the ADCHS_ADCCMPEN2 register */
#define ADCHS_ADCCMPEN2_CMPE8_Pos             _UINT32_(8)                                          /* (ADCHS_ADCCMPEN2)  Position */
#define ADCHS_ADCCMPEN2_CMPE8_Msk             (_UINT32_(0x1) << ADCHS_ADCCMPEN2_CMPE8_Pos)         /* (ADCHS_ADCCMPEN2)  Mask */
#define ADCHS_ADCCMPEN2_CMPE8(value)          (ADCHS_ADCCMPEN2_CMPE8_Msk & (_UINT32_(value) << ADCHS_ADCCMPEN2_CMPE8_Pos)) /* Assignment of value for CMPE8 in the ADCHS_ADCCMPEN2 register */
#define ADCHS_ADCCMPEN2_CMPE9_Pos             _UINT32_(9)                                          /* (ADCHS_ADCCMPEN2)  Position */
#define ADCHS_ADCCMPEN2_CMPE9_Msk             (_UINT32_(0x1) << ADCHS_ADCCMPEN2_CMPE9_Pos)         /* (ADCHS_ADCCMPEN2)  Mask */
#define ADCHS_ADCCMPEN2_CMPE9(value)          (ADCHS_ADCCMPEN2_CMPE9_Msk & (_UINT32_(value) << ADCHS_ADCCMPEN2_CMPE9_Pos)) /* Assignment of value for CMPE9 in the ADCHS_ADCCMPEN2 register */
#define ADCHS_ADCCMPEN2_CMPE10_Pos            _UINT32_(10)                                         /* (ADCHS_ADCCMPEN2)  Position */
#define ADCHS_ADCCMPEN2_CMPE10_Msk            (_UINT32_(0x1) << ADCHS_ADCCMPEN2_CMPE10_Pos)        /* (ADCHS_ADCCMPEN2)  Mask */
#define ADCHS_ADCCMPEN2_CMPE10(value)         (ADCHS_ADCCMPEN2_CMPE10_Msk & (_UINT32_(value) << ADCHS_ADCCMPEN2_CMPE10_Pos)) /* Assignment of value for CMPE10 in the ADCHS_ADCCMPEN2 register */
#define ADCHS_ADCCMPEN2_CMPE11_Pos            _UINT32_(11)                                         /* (ADCHS_ADCCMPEN2)  Position */
#define ADCHS_ADCCMPEN2_CMPE11_Msk            (_UINT32_(0x1) << ADCHS_ADCCMPEN2_CMPE11_Pos)        /* (ADCHS_ADCCMPEN2)  Mask */
#define ADCHS_ADCCMPEN2_CMPE11(value)         (ADCHS_ADCCMPEN2_CMPE11_Msk & (_UINT32_(value) << ADCHS_ADCCMPEN2_CMPE11_Pos)) /* Assignment of value for CMPE11 in the ADCHS_ADCCMPEN2 register */
#define ADCHS_ADCCMPEN2_CMPE12_Pos            _UINT32_(12)                                         /* (ADCHS_ADCCMPEN2)  Position */
#define ADCHS_ADCCMPEN2_CMPE12_Msk            (_UINT32_(0x1) << ADCHS_ADCCMPEN2_CMPE12_Pos)        /* (ADCHS_ADCCMPEN2)  Mask */
#define ADCHS_ADCCMPEN2_CMPE12(value)         (ADCHS_ADCCMPEN2_CMPE12_Msk & (_UINT32_(value) << ADCHS_ADCCMPEN2_CMPE12_Pos)) /* Assignment of value for CMPE12 in the ADCHS_ADCCMPEN2 register */
#define ADCHS_ADCCMPEN2_CMPE13_Pos            _UINT32_(13)                                         /* (ADCHS_ADCCMPEN2)  Position */
#define ADCHS_ADCCMPEN2_CMPE13_Msk            (_UINT32_(0x1) << ADCHS_ADCCMPEN2_CMPE13_Pos)        /* (ADCHS_ADCCMPEN2)  Mask */
#define ADCHS_ADCCMPEN2_CMPE13(value)         (ADCHS_ADCCMPEN2_CMPE13_Msk & (_UINT32_(value) << ADCHS_ADCCMPEN2_CMPE13_Pos)) /* Assignment of value for CMPE13 in the ADCHS_ADCCMPEN2 register */
#define ADCHS_ADCCMPEN2_CMPE14_Pos            _UINT32_(14)                                         /* (ADCHS_ADCCMPEN2)  Position */
#define ADCHS_ADCCMPEN2_CMPE14_Msk            (_UINT32_(0x1) << ADCHS_ADCCMPEN2_CMPE14_Pos)        /* (ADCHS_ADCCMPEN2)  Mask */
#define ADCHS_ADCCMPEN2_CMPE14(value)         (ADCHS_ADCCMPEN2_CMPE14_Msk & (_UINT32_(value) << ADCHS_ADCCMPEN2_CMPE14_Pos)) /* Assignment of value for CMPE14 in the ADCHS_ADCCMPEN2 register */
#define ADCHS_ADCCMPEN2_CMPE15_Pos            _UINT32_(15)                                         /* (ADCHS_ADCCMPEN2)  Position */
#define ADCHS_ADCCMPEN2_CMPE15_Msk            (_UINT32_(0x1) << ADCHS_ADCCMPEN2_CMPE15_Pos)        /* (ADCHS_ADCCMPEN2)  Mask */
#define ADCHS_ADCCMPEN2_CMPE15(value)         (ADCHS_ADCCMPEN2_CMPE15_Msk & (_UINT32_(value) << ADCHS_ADCCMPEN2_CMPE15_Pos)) /* Assignment of value for CMPE15 in the ADCHS_ADCCMPEN2 register */
#define ADCHS_ADCCMPEN2_CMPE16_Pos            _UINT32_(16)                                         /* (ADCHS_ADCCMPEN2)  Position */
#define ADCHS_ADCCMPEN2_CMPE16_Msk            (_UINT32_(0x1) << ADCHS_ADCCMPEN2_CMPE16_Pos)        /* (ADCHS_ADCCMPEN2)  Mask */
#define ADCHS_ADCCMPEN2_CMPE16(value)         (ADCHS_ADCCMPEN2_CMPE16_Msk & (_UINT32_(value) << ADCHS_ADCCMPEN2_CMPE16_Pos)) /* Assignment of value for CMPE16 in the ADCHS_ADCCMPEN2 register */
#define ADCHS_ADCCMPEN2_CMPE17_Pos            _UINT32_(17)                                         /* (ADCHS_ADCCMPEN2)  Position */
#define ADCHS_ADCCMPEN2_CMPE17_Msk            (_UINT32_(0x1) << ADCHS_ADCCMPEN2_CMPE17_Pos)        /* (ADCHS_ADCCMPEN2)  Mask */
#define ADCHS_ADCCMPEN2_CMPE17(value)         (ADCHS_ADCCMPEN2_CMPE17_Msk & (_UINT32_(value) << ADCHS_ADCCMPEN2_CMPE17_Pos)) /* Assignment of value for CMPE17 in the ADCHS_ADCCMPEN2 register */
#define ADCHS_ADCCMPEN2_CMPE18_Pos            _UINT32_(18)                                         /* (ADCHS_ADCCMPEN2)  Position */
#define ADCHS_ADCCMPEN2_CMPE18_Msk            (_UINT32_(0x1) << ADCHS_ADCCMPEN2_CMPE18_Pos)        /* (ADCHS_ADCCMPEN2)  Mask */
#define ADCHS_ADCCMPEN2_CMPE18(value)         (ADCHS_ADCCMPEN2_CMPE18_Msk & (_UINT32_(value) << ADCHS_ADCCMPEN2_CMPE18_Pos)) /* Assignment of value for CMPE18 in the ADCHS_ADCCMPEN2 register */
#define ADCHS_ADCCMPEN2_CMPE19_Pos            _UINT32_(19)                                         /* (ADCHS_ADCCMPEN2)  Position */
#define ADCHS_ADCCMPEN2_CMPE19_Msk            (_UINT32_(0x1) << ADCHS_ADCCMPEN2_CMPE19_Pos)        /* (ADCHS_ADCCMPEN2)  Mask */
#define ADCHS_ADCCMPEN2_CMPE19(value)         (ADCHS_ADCCMPEN2_CMPE19_Msk & (_UINT32_(value) << ADCHS_ADCCMPEN2_CMPE19_Pos)) /* Assignment of value for CMPE19 in the ADCHS_ADCCMPEN2 register */
#define ADCHS_ADCCMPEN2_CMPE20_Pos            _UINT32_(20)                                         /* (ADCHS_ADCCMPEN2)  Position */
#define ADCHS_ADCCMPEN2_CMPE20_Msk            (_UINT32_(0x1) << ADCHS_ADCCMPEN2_CMPE20_Pos)        /* (ADCHS_ADCCMPEN2)  Mask */
#define ADCHS_ADCCMPEN2_CMPE20(value)         (ADCHS_ADCCMPEN2_CMPE20_Msk & (_UINT32_(value) << ADCHS_ADCCMPEN2_CMPE20_Pos)) /* Assignment of value for CMPE20 in the ADCHS_ADCCMPEN2 register */
#define ADCHS_ADCCMPEN2_CMPE21_Pos            _UINT32_(21)                                         /* (ADCHS_ADCCMPEN2)  Position */
#define ADCHS_ADCCMPEN2_CMPE21_Msk            (_UINT32_(0x1) << ADCHS_ADCCMPEN2_CMPE21_Pos)        /* (ADCHS_ADCCMPEN2)  Mask */
#define ADCHS_ADCCMPEN2_CMPE21(value)         (ADCHS_ADCCMPEN2_CMPE21_Msk & (_UINT32_(value) << ADCHS_ADCCMPEN2_CMPE21_Pos)) /* Assignment of value for CMPE21 in the ADCHS_ADCCMPEN2 register */
#define ADCHS_ADCCMPEN2_CMPE22_Pos            _UINT32_(22)                                         /* (ADCHS_ADCCMPEN2)  Position */
#define ADCHS_ADCCMPEN2_CMPE22_Msk            (_UINT32_(0x1) << ADCHS_ADCCMPEN2_CMPE22_Pos)        /* (ADCHS_ADCCMPEN2)  Mask */
#define ADCHS_ADCCMPEN2_CMPE22(value)         (ADCHS_ADCCMPEN2_CMPE22_Msk & (_UINT32_(value) << ADCHS_ADCCMPEN2_CMPE22_Pos)) /* Assignment of value for CMPE22 in the ADCHS_ADCCMPEN2 register */
#define ADCHS_ADCCMPEN2_Msk                   _UINT32_(0x007FFFFF)                                 /* (ADCHS_ADCCMPEN2) Register Mask  */

