Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/test_app/firmware/src/packs/PIC32WM_BZ6204_DFP/component/adchs.h
/* -------- ADCHS_ADCFLTR0CLR : (ADCHS Offset: 0x1A4) (R/W 32) Bit clear register -------- */
#define ADCHS_ADCFLTR0CLR_RESETVALUE          _UINT32_(0x00)                                       /*  (ADCHS_ADCFLTR0CLR) Bit clear register  Reset Value */

#define ADCHS_ADCFLTR0CLR_Msk                 _UINT32_(0x00000000)                                 /* (ADCHS_ADCFLTR0CLR) Register Mask  */


/* -------- ADCHS_ADCFLTR0SET : (ADCHS Offset: 0x1A8) (R/W 32) Bit set register -------- */
#define ADCHS_ADCFLTR0SET_RESETVALUE          _UINT32_(0x00)                                       /*  (ADCHS_ADCFLTR0SET) Bit set register  Reset Value */

#define ADCHS_ADCFLTR0SET_Msk                 _UINT32_(0x00000000)                                 /* (ADCHS_ADCFLTR0SET) Register Mask  */


/* -------- ADCHS_ADCFLTR0INV : (ADCHS Offset: 0x1AC) (R/W 32) Bit invert register -------- */
#define ADCHS_ADCFLTR0INV_RESETVALUE          _UINT32_(0x00)                                       /*  (ADCHS_ADCFLTR0INV) Bit invert register  Reset Value */

#define ADCHS_ADCFLTR0INV_Msk                 _UINT32_(0x00000000)                                 /* (ADCHS_ADCFLTR0INV) Register Mask  */


/* -------- ADCHS_ADCFLTR2 : (ADCHS Offset: 0x1B0) (R/W 32)  -------- */
#define ADCHS_ADCFLTR2_RESETVALUE             _UINT32_(0x00)                                       /*  (ADCHS_ADCFLTR2)   Reset Value */

#define ADCHS_ADCFLTR2_FLT_DATA1_Pos          _UINT32_(0)                                          /* (ADCHS_ADCFLTR2)  Position */
#define ADCHS_ADCFLTR2_FLT_DATA1_Msk          (_UINT32_(0xFFFF) << ADCHS_ADCFLTR2_FLT_DATA1_Pos)   /* (ADCHS_ADCFLTR2)  Mask */
#define ADCHS_ADCFLTR2_FLT_DATA1(value)       (ADCHS_ADCFLTR2_FLT_DATA1_Msk & (_UINT32_(value) << ADCHS_ADCFLTR2_FLT_DATA1_Pos)) /* Assignment of value for FLT_DATA1 in the ADCHS_ADCFLTR2 register */
#define ADCHS_ADCFLTR2_FLTINID1_Pos           _UINT32_(16)                                         /* (ADCHS_ADCFLTR2)  Position */
#define ADCHS_ADCFLTR2_FLTINID1_Msk           (_UINT32_(0x1F) << ADCHS_ADCFLTR2_FLTINID1_Pos)      /* (ADCHS_ADCFLTR2)  Mask */
#define ADCHS_ADCFLTR2_FLTINID1(value)        (ADCHS_ADCFLTR2_FLTINID1_Msk & (_UINT32_(value) << ADCHS_ADCFLTR2_FLTINID1_Pos)) /* Assignment of value for FLTINID1 in the ADCHS_ADCFLTR2 register */
#define ADCHS_ADCFLTR2_AFIF1_Pos              _UINT32_(24)                                         /* (ADCHS_ADCFLTR2)  Position */
#define ADCHS_ADCFLTR2_AFIF1_Msk              (_UINT32_(0x1) << ADCHS_ADCFLTR2_AFIF1_Pos)          /* (ADCHS_ADCFLTR2)  Mask */
#define ADCHS_ADCFLTR2_AFIF1(value)           (ADCHS_ADCFLTR2_AFIF1_Msk & (_UINT32_(value) << ADCHS_ADCFLTR2_AFIF1_Pos)) /* Assignment of value for AFIF1 in the ADCHS_ADCFLTR2 register */
#define ADCHS_ADCFLTR2_AFIEN1_Pos             _UINT32_(25)                                         /* (ADCHS_ADCFLTR2)  Position */
#define ADCHS_ADCFLTR2_AFIEN1_Msk             (_UINT32_(0x1) << ADCHS_ADCFLTR2_AFIEN1_Pos)         /* (ADCHS_ADCFLTR2)  Mask */
#define ADCHS_ADCFLTR2_AFIEN1(value)          (ADCHS_ADCFLTR2_AFIEN1_Msk & (_UINT32_(value) << ADCHS_ADCFLTR2_AFIEN1_Pos)) /* Assignment of value for AFIEN1 in the ADCHS_ADCFLTR2 register */
#define ADCHS_ADCFLTR2_OVRSAM1_Pos            _UINT32_(26)                                         /* (ADCHS_ADCFLTR2)  Position */
#define ADCHS_ADCFLTR2_OVRSAM1_Msk            (_UINT32_(0x7) << ADCHS_ADCFLTR2_OVRSAM1_Pos)        /* (ADCHS_ADCFLTR2)  Mask */
#define ADCHS_ADCFLTR2_OVRSAM1(value)         (ADCHS_ADCFLTR2_OVRSAM1_Msk & (_UINT32_(value) << ADCHS_ADCFLTR2_OVRSAM1_Pos)) /* Assignment of value for OVRSAM1 in the ADCHS_ADCFLTR2 register */
#define ADCHS_ADCFLTR2_ADFMODE1_Pos           _UINT32_(29)                                         /* (ADCHS_ADCFLTR2)  Position */
#define ADCHS_ADCFLTR2_ADFMODE1_Msk           (_UINT32_(0x1) << ADCHS_ADCFLTR2_ADFMODE1_Pos)       /* (ADCHS_ADCFLTR2)  Mask */
#define ADCHS_ADCFLTR2_ADFMODE1(value)        (ADCHS_ADCFLTR2_ADFMODE1_Msk & (_UINT32_(value) << ADCHS_ADCFLTR2_ADFMODE1_Pos)) /* Assignment of value for ADFMODE1 in the ADCHS_ADCFLTR2 register */
#define ADCHS_ADCFLTR2_DATA16EN1_Pos          _UINT32_(30)                                         /* (ADCHS_ADCFLTR2)  Position */
#define ADCHS_ADCFLTR2_DATA16EN1_Msk          (_UINT32_(0x1) << ADCHS_ADCFLTR2_DATA16EN1_Pos)      /* (ADCHS_ADCFLTR2)  Mask */
#define ADCHS_ADCFLTR2_DATA16EN1(value)       (ADCHS_ADCFLTR2_DATA16EN1_Msk & (_UINT32_(value) << ADCHS_ADCFLTR2_DATA16EN1_Pos)) /* Assignment of value for DATA16EN1 in the ADCHS_ADCFLTR2 register */
#define ADCHS_ADCFLTR2_AFEN1_Pos              _UINT32_(31)                                         /* (ADCHS_ADCFLTR2)  Position */
#define ADCHS_ADCFLTR2_AFEN1_Msk              (_UINT32_(0x1) << ADCHS_ADCFLTR2_AFEN1_Pos)          /* (ADCHS_ADCFLTR2)  Mask */
#define ADCHS_ADCFLTR2_AFEN1(value)           (ADCHS_ADCFLTR2_AFEN1_Msk & (_UINT32_(value) << ADCHS_ADCFLTR2_AFEN1_Pos)) /* Assignment of value for AFEN1 in the ADCHS_ADCFLTR2 register */
#define ADCHS_ADCFLTR2_Msk                    _UINT32_(0xFF1FFFFF)                                 /* (ADCHS_ADCFLTR2) Register Mask  */

#define ADCHS_ADCFLTR2_AFIF_Pos               _UINT32_(24)                                         /* (ADCHS_ADCFLTR2 Position)  */
#define ADCHS_ADCFLTR2_AFIF_Msk               (_UINT32_(0x1) << ADCHS_ADCFLTR2_AFIF_Pos)           /* (ADCHS_ADCFLTR2 Mask) AFIF */
#define ADCHS_ADCFLTR2_AFIF(value)            (ADCHS_ADCFLTR2_AFIF_Msk & (_UINT32_(value) << ADCHS_ADCFLTR2_AFIF_Pos)) 
#define ADCHS_ADCFLTR2_AFIEN_Pos              _UINT32_(25)                                         /* (ADCHS_ADCFLTR2 Position)  */
#define ADCHS_ADCFLTR2_AFIEN_Msk              (_UINT32_(0x1) << ADCHS_ADCFLTR2_AFIEN_Pos)          /* (ADCHS_ADCFLTR2 Mask) AFIEN */
#define ADCHS_ADCFLTR2_AFIEN(value)           (ADCHS_ADCFLTR2_AFIEN_Msk & (_UINT32_(value) << ADCHS_ADCFLTR2_AFIEN_Pos)) 
#define ADCHS_ADCFLTR2_ADFMODE_Pos            _UINT32_(29)                                         /* (ADCHS_ADCFLTR2 Position)  */
#define ADCHS_ADCFLTR2_ADFMODE_Msk            (_UINT32_(0x1) << ADCHS_ADCFLTR2_ADFMODE_Pos)        /* (ADCHS_ADCFLTR2 Mask) ADFMODE */
#define ADCHS_ADCFLTR2_ADFMODE(value)         (ADCHS_ADCFLTR2_ADFMODE_Msk & (_UINT32_(value) << ADCHS_ADCFLTR2_ADFMODE_Pos)) 
#define ADCHS_ADCFLTR2_DATA16EN_Pos           _UINT32_(30)                                         /* (ADCHS_ADCFLTR2 Position)  */
#define ADCHS_ADCFLTR2_DATA16EN_Msk           (_UINT32_(0x1) << ADCHS_ADCFLTR2_DATA16EN_Pos)       /* (ADCHS_ADCFLTR2 Mask) DATA16EN */
#define ADCHS_ADCFLTR2_DATA16EN(value)        (ADCHS_ADCFLTR2_DATA16EN_Msk & (_UINT32_(value) << ADCHS_ADCFLTR2_DATA16EN_Pos)) 
#define ADCHS_ADCFLTR2_AFEN_Pos               _UINT32_(31)                                         /* (ADCHS_ADCFLTR2 Position)  */
#define ADCHS_ADCFLTR2_AFEN_Msk               (_UINT32_(0x1) << ADCHS_ADCFLTR2_AFEN_Pos)           /* (ADCHS_ADCFLTR2 Mask) AFEN */
#define ADCHS_ADCFLTR2_AFEN(value)            (ADCHS_ADCFLTR2_AFEN_Msk & (_UINT32_(value) << ADCHS_ADCFLTR2_AFEN_Pos)) 

/* -------- ADCHS_ADCFLTR1CLR : (ADCHS Offset: 0x1B4) (R/W 32) Bit clear register -------- */
#define ADCHS_ADCFLTR1CLR_RESETVALUE          _UINT32_(0x00)                                       /*  (ADCHS_ADCFLTR1CLR) Bit clear register  Reset Value */

#define ADCHS_ADCFLTR1CLR_Msk                 _UINT32_(0x00000000)                                 /* (ADCHS_ADCFLTR1CLR) Register Mask  */


/* -------- ADCHS_ADCFLTR1SET : (ADCHS Offset: 0x1B8) (R/W 32) Bit set register -------- */
#define ADCHS_ADCFLTR1SET_RESETVALUE          _UINT32_(0x00)                                       /*  (ADCHS_ADCFLTR1SET) Bit set register  Reset Value */

#define ADCHS_ADCFLTR1SET_Msk                 _UINT32_(0x00000000)                                 /* (ADCHS_ADCFLTR1SET) Register Mask  */


