Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/test_app/firmware/src/packs/PIC32WM_BZ6204_DFP/component/adchs.h
#define ADCHS_ADCMPCON2SET_Msk                _UINT32_(0x00000000)                                 /* (ADCHS_ADCMPCON2SET) Register Mask  */


/* -------- ADCHS_ADCMPCON2INV : (ADCHS Offset: 0x29C) (R/W 32) Bit invert register -------- */
#define ADCHS_ADCMPCON2INV_RESETVALUE         _UINT32_(0x00)                                       /*  (ADCHS_ADCMPCON2INV) Bit invert register  Reset Value */

#define ADCHS_ADCMPCON2INV_Msk                _UINT32_(0x00000000)                                 /* (ADCHS_ADCMPCON2INV) Register Mask  */


/* -------- ADCHS_ADCFSTATCLR : (ADCHS Offset: 0x2E4) (R/W 32) Bit clear register -------- */
#define ADCHS_ADCFSTATCLR_RESETVALUE          _UINT32_(0x00)                                       /*  (ADCHS_ADCFSTATCLR) Bit clear register  Reset Value */

#define ADCHS_ADCFSTATCLR_Msk                 _UINT32_(0x00000000)                                 /* (ADCHS_ADCFSTATCLR) Register Mask  */


/* -------- ADCHS_ADCFSTATSET : (ADCHS Offset: 0x2E8) (R/W 32) Bit set register -------- */
#define ADCHS_ADCFSTATSET_RESETVALUE          _UINT32_(0x00)                                       /*  (ADCHS_ADCFSTATSET) Bit set register  Reset Value */

#define ADCHS_ADCFSTATSET_Msk                 _UINT32_(0x00000000)                                 /* (ADCHS_ADCFSTATSET) Register Mask  */


/* -------- ADCHS_ADCFSTATINV : (ADCHS Offset: 0x2EC) (R/W 32) Bit invert register -------- */
#define ADCHS_ADCFSTATINV_RESETVALUE          _UINT32_(0x00)                                       /*  (ADCHS_ADCFSTATINV) Bit invert register  Reset Value */

#define ADCHS_ADCFSTATINV_Msk                 _UINT32_(0x00000000)                                 /* (ADCHS_ADCFSTATINV) Register Mask  */


/* -------- ADCHS_ADCFIFOCLR : (ADCHS Offset: 0x2F4) (R/W 32) Bit clear register -------- */
#define ADCHS_ADCFIFOCLR_RESETVALUE           _UINT32_(0x00)                                       /*  (ADCHS_ADCFIFOCLR) Bit clear register  Reset Value */

#define ADCHS_ADCFIFOCLR_Msk                  _UINT32_(0x00000000)                                 /* (ADCHS_ADCFIFOCLR) Register Mask  */


/* -------- ADCHS_ADCFIFOSET : (ADCHS Offset: 0x2F8) (R/W 32) Bit set register -------- */
#define ADCHS_ADCFIFOSET_RESETVALUE           _UINT32_(0x00)                                       /*  (ADCHS_ADCFIFOSET) Bit set register  Reset Value */

#define ADCHS_ADCFIFOSET_Msk                  _UINT32_(0x00000000)                                 /* (ADCHS_ADCFIFOSET) Register Mask  */


/* -------- ADCHS_ADCFIFOINV : (ADCHS Offset: 0x2FC) (R/W 32) Bit invert register -------- */
#define ADCHS_ADCFIFOINV_RESETVALUE           _UINT32_(0x00)                                       /*  (ADCHS_ADCFIFOINV) Bit invert register  Reset Value */

#define ADCHS_ADCFIFOINV_Msk                  _UINT32_(0x00000000)                                 /* (ADCHS_ADCFIFOINV) Register Mask  */


/* -------- ADCHS_ADCBASE : (ADCHS Offset: 0x300) (R/W 32)  -------- */
#define ADCHS_ADCBASE_RESETVALUE              _UINT32_(0x00)                                       /*  (ADCHS_ADCBASE)   Reset Value */

#define ADCHS_ADCBASE_ADCBASE_Pos             _UINT32_(0)                                          /* (ADCHS_ADCBASE)  Position */
#define ADCHS_ADCBASE_ADCBASE_Msk             (_UINT32_(0xFFFF) << ADCHS_ADCBASE_ADCBASE_Pos)      /* (ADCHS_ADCBASE)  Mask */
#define ADCHS_ADCBASE_ADCBASE(value)          (ADCHS_ADCBASE_ADCBASE_Msk & (_UINT32_(value) << ADCHS_ADCBASE_ADCBASE_Pos)) /* Assignment of value for ADCBASE in the ADCHS_ADCBASE register */
#define ADCHS_ADCBASE_Msk                     _UINT32_(0x0000FFFF)                                 /* (ADCHS_ADCBASE) Register Mask  */


/* -------- ADCHS_ADCBASECLR : (ADCHS Offset: 0x304) (R/W 32) Bit clear register -------- */
#define ADCHS_ADCBASECLR_RESETVALUE           _UINT32_(0x00)                                       /*  (ADCHS_ADCBASECLR) Bit clear register  Reset Value */

#define ADCHS_ADCBASECLR_Msk                  _UINT32_(0x00000000)                                 /* (ADCHS_ADCBASECLR) Register Mask  */


/* -------- ADCHS_ADCBASESET : (ADCHS Offset: 0x308) (R/W 32) Bit set register -------- */
#define ADCHS_ADCBASESET_RESETVALUE           _UINT32_(0x00)                                       /*  (ADCHS_ADCBASESET) Bit set register  Reset Value */

#define ADCHS_ADCBASESET_Msk                  _UINT32_(0x00000000)                                 /* (ADCHS_ADCBASESET) Register Mask  */


/* -------- ADCHS_ADCBASEINV : (ADCHS Offset: 0x30C) (R/W 32) Bit invert register -------- */
#define ADCHS_ADCBASEINV_RESETVALUE           _UINT32_(0x00)                                       /*  (ADCHS_ADCBASEINV) Bit invert register  Reset Value */

#define ADCHS_ADCBASEINV_Msk                  _UINT32_(0x00000000)                                 /* (ADCHS_ADCBASEINV) Register Mask  */


/* -------- ADCHS_ADCDMASTAT : (ADCHS Offset: 0x310) (R/W 32)  -------- */
#define ADCHS_ADCDMASTAT_RESETVALUE           _UINT32_(0x00)                                       /*  (ADCHS_ADCDMASTAT)   Reset Value */

#define ADCHS_ADCDMASTAT_RAF0_Pos             _UINT32_(0)                                          /* (ADCHS_ADCDMASTAT)  Position */
#define ADCHS_ADCDMASTAT_RAF0_Msk             (_UINT32_(0x1) << ADCHS_ADCDMASTAT_RAF0_Pos)         /* (ADCHS_ADCDMASTAT)  Mask */
#define ADCHS_ADCDMASTAT_RAF0(value)          (ADCHS_ADCDMASTAT_RAF0_Msk & (_UINT32_(value) << ADCHS_ADCDMASTAT_RAF0_Pos)) /* Assignment of value for RAF0 in the ADCHS_ADCDMASTAT register */
#define ADCHS_ADCDMASTAT_RAF_IEN0_Pos         _UINT32_(8)                                          /* (ADCHS_ADCDMASTAT)  Position */
#define ADCHS_ADCDMASTAT_RAF_IEN0_Msk         (_UINT32_(0x1) << ADCHS_ADCDMASTAT_RAF_IEN0_Pos)     /* (ADCHS_ADCDMASTAT)  Mask */
#define ADCHS_ADCDMASTAT_RAF_IEN0(value)      (ADCHS_ADCDMASTAT_RAF_IEN0_Msk & (_UINT32_(value) << ADCHS_ADCDMASTAT_RAF_IEN0_Pos)) /* Assignment of value for RAF_IEN0 in the ADCHS_ADCDMASTAT register */
#define ADCHS_ADCDMASTAT_DMA_CNT_EN_Pos       _UINT32_(15)                                         /* (ADCHS_ADCDMASTAT)  Position */
#define ADCHS_ADCDMASTAT_DMA_CNT_EN_Msk       (_UINT32_(0x1) << ADCHS_ADCDMASTAT_DMA_CNT_EN_Pos)   /* (ADCHS_ADCDMASTAT)  Mask */
#define ADCHS_ADCDMASTAT_DMA_CNT_EN(value)    (ADCHS_ADCDMASTAT_DMA_CNT_EN_Msk & (_UINT32_(value) << ADCHS_ADCDMASTAT_DMA_CNT_EN_Pos)) /* Assignment of value for DMA_CNT_EN in the ADCHS_ADCDMASTAT register */
#define ADCHS_ADCDMASTAT_RBF0_Pos             _UINT32_(16)                                         /* (ADCHS_ADCDMASTAT)  Position */
#define ADCHS_ADCDMASTAT_RBF0_Msk             (_UINT32_(0x1) << ADCHS_ADCDMASTAT_RBF0_Pos)         /* (ADCHS_ADCDMASTAT)  Mask */
#define ADCHS_ADCDMASTAT_RBF0(value)          (ADCHS_ADCDMASTAT_RBF0_Msk & (_UINT32_(value) << ADCHS_ADCDMASTAT_RBF0_Pos)) /* Assignment of value for RBF0 in the ADCHS_ADCDMASTAT register */
#define ADCHS_ADCDMASTAT_WR_OVF_ERR_Pos       _UINT32_(23)                                         /* (ADCHS_ADCDMASTAT)  Position */
#define ADCHS_ADCDMASTAT_WR_OVF_ERR_Msk       (_UINT32_(0x1) << ADCHS_ADCDMASTAT_WR_OVF_ERR_Pos)   /* (ADCHS_ADCDMASTAT)  Mask */
#define ADCHS_ADCDMASTAT_WR_OVF_ERR(value)    (ADCHS_ADCDMASTAT_WR_OVF_ERR_Msk & (_UINT32_(value) << ADCHS_ADCDMASTAT_WR_OVF_ERR_Pos)) /* Assignment of value for WR_OVF_ERR in the ADCHS_ADCDMASTAT register */
#define ADCHS_ADCDMASTAT_RBF_IEN0_Pos         _UINT32_(24)                                         /* (ADCHS_ADCDMASTAT)  Position */
#define ADCHS_ADCDMASTAT_RBF_IEN0_Msk         (_UINT32_(0x1) << ADCHS_ADCDMASTAT_RBF_IEN0_Pos)     /* (ADCHS_ADCDMASTAT)  Mask */
#define ADCHS_ADCDMASTAT_RBF_IEN0(value)      (ADCHS_ADCDMASTAT_RBF_IEN0_Msk & (_UINT32_(value) << ADCHS_ADCDMASTAT_RBF_IEN0_Pos)) /* Assignment of value for RBF_IEN0 in the ADCHS_ADCDMASTAT register */
#define ADCHS_ADCDMASTAT_DMAEN_Pos            _UINT32_(31)                                         /* (ADCHS_ADCDMASTAT)  Position */
#define ADCHS_ADCDMASTAT_DMAEN_Msk            (_UINT32_(0x1) << ADCHS_ADCDMASTAT_DMAEN_Pos)        /* (ADCHS_ADCDMASTAT)  Mask */
#define ADCHS_ADCDMASTAT_DMAEN(value)         (ADCHS_ADCDMASTAT_DMAEN_Msk & (_UINT32_(value) << ADCHS_ADCDMASTAT_DMAEN_Pos)) /* Assignment of value for DMAEN in the ADCHS_ADCDMASTAT register */
#define ADCHS_ADCDMASTAT_Msk                  _UINT32_(0x81818101)                                 /* (ADCHS_ADCDMASTAT) Register Mask  */

