Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/test_app/firmware/src/packs/PIC32WM_BZ6204_DFP/component/adchs.h
/* -------- ADCHS_ADC0TIMECLR : (ADCHS Offset: 0x354) (R/W 32) Bit clear register -------- */
#define ADCHS_ADC0TIMECLR_RESETVALUE          _UINT32_(0x00)                                       /*  (ADCHS_ADC0TIMECLR) Bit clear register  Reset Value */

#define ADCHS_ADC0TIMECLR_Msk                 _UINT32_(0x00000000)                                 /* (ADCHS_ADC0TIMECLR) Register Mask  */


/* -------- ADCHS_ADC0TIMESET : (ADCHS Offset: 0x358) (R/W 32) Bit set register -------- */
#define ADCHS_ADC0TIMESET_RESETVALUE          _UINT32_(0x00)                                       /*  (ADCHS_ADC0TIMESET) Bit set register  Reset Value */

#define ADCHS_ADC0TIMESET_Msk                 _UINT32_(0x00000000)                                 /* (ADCHS_ADC0TIMESET) Register Mask  */


/* -------- ADCHS_ADC0TIMEINV : (ADCHS Offset: 0x35C) (R/W 32) Bit invert register -------- */
#define ADCHS_ADC0TIMEINV_RESETVALUE          _UINT32_(0x00)                                       /*  (ADCHS_ADC0TIMEINV) Bit invert register  Reset Value */

#define ADCHS_ADC0TIMEINV_Msk                 _UINT32_(0x00000000)                                 /* (ADCHS_ADC0TIMEINV) Register Mask  */


/* -------- ADCHS_ADCEISTAT1CLR : (ADCHS Offset: 0x3E4) (R/W 32) Bit clear register -------- */
#define ADCHS_ADCEISTAT1CLR_RESETVALUE        _UINT32_(0x00)                                       /*  (ADCHS_ADCEISTAT1CLR) Bit clear register  Reset Value */

#define ADCHS_ADCEISTAT1CLR_Msk               _UINT32_(0x00000000)                                 /* (ADCHS_ADCEISTAT1CLR) Register Mask  */


/* -------- ADCHS_ADCEISTAT1SET : (ADCHS Offset: 0x3E8) (R/W 32) Bit set register -------- */
#define ADCHS_ADCEISTAT1SET_RESETVALUE        _UINT32_(0x00)                                       /*  (ADCHS_ADCEISTAT1SET) Bit set register  Reset Value */

#define ADCHS_ADCEISTAT1SET_Msk               _UINT32_(0x00000000)                                 /* (ADCHS_ADCEISTAT1SET) Register Mask  */


/* -------- ADCHS_ADCEISTAT1INV : (ADCHS Offset: 0x3EC) (R/W 32) Bit invert register -------- */
#define ADCHS_ADCEISTAT1INV_RESETVALUE        _UINT32_(0x00)                                       /*  (ADCHS_ADCEISTAT1INV) Bit invert register  Reset Value */

#define ADCHS_ADCEISTAT1INV_Msk               _UINT32_(0x00000000)                                 /* (ADCHS_ADCEISTAT1INV) Register Mask  */


/* -------- ADCHS_ADCANCON : (ADCHS Offset: 0x400) (R/W 32)  -------- */
#define ADCHS_ADCANCON_RESETVALUE             _UINT32_(0x00)                                       /*  (ADCHS_ADCANCON)   Reset Value */

#define ADCHS_ADCANCON_ANEN0_Pos              _UINT32_(0)                                          /* (ADCHS_ADCANCON)  Position */
#define ADCHS_ADCANCON_ANEN0_Msk              (_UINT32_(0x1) << ADCHS_ADCANCON_ANEN0_Pos)          /* (ADCHS_ADCANCON)  Mask */
#define ADCHS_ADCANCON_ANEN0(value)           (ADCHS_ADCANCON_ANEN0_Msk & (_UINT32_(value) << ADCHS_ADCANCON_ANEN0_Pos)) /* Assignment of value for ANEN0 in the ADCHS_ADCANCON register */
#define ADCHS_ADCANCON_ANEN7_Pos              _UINT32_(7)                                          /* (ADCHS_ADCANCON)  Position */
#define ADCHS_ADCANCON_ANEN7_Msk              (_UINT32_(0x1) << ADCHS_ADCANCON_ANEN7_Pos)          /* (ADCHS_ADCANCON)  Mask */
#define ADCHS_ADCANCON_ANEN7(value)           (ADCHS_ADCANCON_ANEN7_Msk & (_UINT32_(value) << ADCHS_ADCANCON_ANEN7_Pos)) /* Assignment of value for ANEN7 in the ADCHS_ADCANCON register */
#define ADCHS_ADCANCON_WKRDY0_Pos             _UINT32_(8)                                          /* (ADCHS_ADCANCON)  Position */
#define ADCHS_ADCANCON_WKRDY0_Msk             (_UINT32_(0x1) << ADCHS_ADCANCON_WKRDY0_Pos)         /* (ADCHS_ADCANCON)  Mask */
#define ADCHS_ADCANCON_WKRDY0(value)          (ADCHS_ADCANCON_WKRDY0_Msk & (_UINT32_(value) << ADCHS_ADCANCON_WKRDY0_Pos)) /* Assignment of value for WKRDY0 in the ADCHS_ADCANCON register */
#define ADCHS_ADCANCON_WKRDY7_Pos             _UINT32_(15)                                         /* (ADCHS_ADCANCON)  Position */
#define ADCHS_ADCANCON_WKRDY7_Msk             (_UINT32_(0x1) << ADCHS_ADCANCON_WKRDY7_Pos)         /* (ADCHS_ADCANCON)  Mask */
#define ADCHS_ADCANCON_WKRDY7(value)          (ADCHS_ADCANCON_WKRDY7_Msk & (_UINT32_(value) << ADCHS_ADCANCON_WKRDY7_Pos)) /* Assignment of value for WKRDY7 in the ADCHS_ADCANCON register */
#define ADCHS_ADCANCON_WKIEN0_Pos             _UINT32_(16)                                         /* (ADCHS_ADCANCON)  Position */
#define ADCHS_ADCANCON_WKIEN0_Msk             (_UINT32_(0x1) << ADCHS_ADCANCON_WKIEN0_Pos)         /* (ADCHS_ADCANCON)  Mask */
#define ADCHS_ADCANCON_WKIEN0(value)          (ADCHS_ADCANCON_WKIEN0_Msk & (_UINT32_(value) << ADCHS_ADCANCON_WKIEN0_Pos)) /* Assignment of value for WKIEN0 in the ADCHS_ADCANCON register */
#define ADCHS_ADCANCON_WKIEN7_Pos             _UINT32_(23)                                         /* (ADCHS_ADCANCON)  Position */
#define ADCHS_ADCANCON_WKIEN7_Msk             (_UINT32_(0x1) << ADCHS_ADCANCON_WKIEN7_Pos)         /* (ADCHS_ADCANCON)  Mask */
#define ADCHS_ADCANCON_WKIEN7(value)          (ADCHS_ADCANCON_WKIEN7_Msk & (_UINT32_(value) << ADCHS_ADCANCON_WKIEN7_Pos)) /* Assignment of value for WKIEN7 in the ADCHS_ADCANCON register */
#define ADCHS_ADCANCON_WKUPCLKCNT_Pos         _UINT32_(24)                                         /* (ADCHS_ADCANCON)  Position */
#define ADCHS_ADCANCON_WKUPCLKCNT_Msk         (_UINT32_(0xF) << ADCHS_ADCANCON_WKUPCLKCNT_Pos)     /* (ADCHS_ADCANCON)  Mask */
#define ADCHS_ADCANCON_WKUPCLKCNT(value)      (ADCHS_ADCANCON_WKUPCLKCNT_Msk & (_UINT32_(value) << ADCHS_ADCANCON_WKUPCLKCNT_Pos)) /* Assignment of value for WKUPCLKCNT in the ADCHS_ADCANCON register */
#define ADCHS_ADCANCON_Msk                    _UINT32_(0x0F818181)                                 /* (ADCHS_ADCANCON) Register Mask  */

#define ADCHS_ADCANCON_ANEN_Pos               _UINT32_(0)                                          /* (ADCHS_ADCANCON Position)  */
#define ADCHS_ADCANCON_ANEN_Msk               (_UINT32_(0x3) << ADCHS_ADCANCON_ANEN_Pos)           /* (ADCHS_ADCANCON Mask) ANEN */
#define ADCHS_ADCANCON_ANEN(value)            (ADCHS_ADCANCON_ANEN_Msk & (_UINT32_(value) << ADCHS_ADCANCON_ANEN_Pos)) 
#define ADCHS_ADCANCON_WKRDY_Pos              _UINT32_(8)                                          /* (ADCHS_ADCANCON Position)  */
#define ADCHS_ADCANCON_WKRDY_Msk              (_UINT32_(0x3) << ADCHS_ADCANCON_WKRDY_Pos)          /* (ADCHS_ADCANCON Mask) WKRDY */
#define ADCHS_ADCANCON_WKRDY(value)           (ADCHS_ADCANCON_WKRDY_Msk & (_UINT32_(value) << ADCHS_ADCANCON_WKRDY_Pos)) 
#define ADCHS_ADCANCON_WKIEN_Pos              _UINT32_(16)                                         /* (ADCHS_ADCANCON Position)  */
#define ADCHS_ADCANCON_WKIEN_Msk              (_UINT32_(0x3) << ADCHS_ADCANCON_WKIEN_Pos)          /* (ADCHS_ADCANCON Mask) WKIEN */
#define ADCHS_ADCANCON_WKIEN(value)           (ADCHS_ADCANCON_WKIEN_Msk & (_UINT32_(value) << ADCHS_ADCANCON_WKIEN_Pos)) 

/* -------- ADCHS_ADCANLCTLCLR : (ADCHS Offset: 0x404) (R/W 32) Bit clear register -------- */
#define ADCHS_ADCANLCTLCLR_RESETVALUE         _UINT32_(0x00)                                       /*  (ADCHS_ADCANLCTLCLR) Bit clear register  Reset Value */

#define ADCHS_ADCANLCTLCLR_Msk                _UINT32_(0x00000000)                                 /* (ADCHS_ADCANLCTLCLR) Register Mask  */


/* -------- ADCHS_ADCANLCTLSET : (ADCHS Offset: 0x408) (R/W 32) Bit set register -------- */
#define ADCHS_ADCANLCTLSET_RESETVALUE         _UINT32_(0x00)                                       /*  (ADCHS_ADCANLCTLSET) Bit set register  Reset Value */

