Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/test_app/firmware/src/packs/PIC32WM_BZ6204_DFP/component/adchs.h
#define ADCHS_ADCDATA8_DATA_Pos               _UINT32_(0)                                          /* (ADCHS_ADCDATA8)  Position */
#define ADCHS_ADCDATA8_DATA_Msk               (_UINT32_(0xFFFFFFFF) << ADCHS_ADCDATA8_DATA_Pos)    /* (ADCHS_ADCDATA8)  Mask */
#define ADCHS_ADCDATA8_DATA(value)            (ADCHS_ADCDATA8_DATA_Msk & (_UINT32_(value) << ADCHS_ADCDATA8_DATA_Pos)) /* Assignment of value for DATA in the ADCHS_ADCDATA8 register */
#define ADCHS_ADCDATA8_Msk                    _UINT32_(0xFFFFFFFF)                                 /* (ADCHS_ADCDATA8) Register Mask  */


/* -------- ADCHS_ADCDATA9 : (ADCHS Offset: 0xA90) ( R/ 32)  -------- */
#define ADCHS_ADCDATA9_RESETVALUE             _UINT32_(0x00)                                       /*  (ADCHS_ADCDATA9)   Reset Value */

#define ADCHS_ADCDATA9_DATA_Pos               _UINT32_(0)                                          /* (ADCHS_ADCDATA9)  Position */
#define ADCHS_ADCDATA9_DATA_Msk               (_UINT32_(0xFFFFFFFF) << ADCHS_ADCDATA9_DATA_Pos)    /* (ADCHS_ADCDATA9)  Mask */
#define ADCHS_ADCDATA9_DATA(value)            (ADCHS_ADCDATA9_DATA_Msk & (_UINT32_(value) << ADCHS_ADCDATA9_DATA_Pos)) /* Assignment of value for DATA in the ADCHS_ADCDATA9 register */
#define ADCHS_ADCDATA9_Msk                    _UINT32_(0xFFFFFFFF)                                 /* (ADCHS_ADCDATA9) Register Mask  */


/* -------- ADCHS_ADCDATA10 : (ADCHS Offset: 0xAA0) ( R/ 32)  -------- */
#define ADCHS_ADCDATA10_RESETVALUE            _UINT32_(0x00)                                       /*  (ADCHS_ADCDATA10)   Reset Value */

#define ADCHS_ADCDATA10_DATA_Pos              _UINT32_(0)                                          /* (ADCHS_ADCDATA10)  Position */
#define ADCHS_ADCDATA10_DATA_Msk              (_UINT32_(0xFFFFFFFF) << ADCHS_ADCDATA10_DATA_Pos)   /* (ADCHS_ADCDATA10)  Mask */
#define ADCHS_ADCDATA10_DATA(value)           (ADCHS_ADCDATA10_DATA_Msk & (_UINT32_(value) << ADCHS_ADCDATA10_DATA_Pos)) /* Assignment of value for DATA in the ADCHS_ADCDATA10 register */
#define ADCHS_ADCDATA10_Msk                   _UINT32_(0xFFFFFFFF)                                 /* (ADCHS_ADCDATA10) Register Mask  */


/* -------- ADCHS_ADCDATA11 : (ADCHS Offset: 0xAB0) (R/W 32)  -------- */
#define ADCHS_ADCDATA11_RESETVALUE            _UINT32_(0x00)                                       /*  (ADCHS_ADCDATA11)   Reset Value */

#define ADCHS_ADCDATA11_DATA_Pos              _UINT32_(0)                                          /* (ADCHS_ADCDATA11)  Position */
#define ADCHS_ADCDATA11_DATA_Msk              (_UINT32_(0xFFFFFFFF) << ADCHS_ADCDATA11_DATA_Pos)   /* (ADCHS_ADCDATA11)  Mask */
#define ADCHS_ADCDATA11_DATA(value)           (ADCHS_ADCDATA11_DATA_Msk & (_UINT32_(value) << ADCHS_ADCDATA11_DATA_Pos)) /* Assignment of value for DATA in the ADCHS_ADCDATA11 register */
#define ADCHS_ADCDATA11_Msk                   _UINT32_(0xFFFFFFFF)                                 /* (ADCHS_ADCDATA11) Register Mask  */


/* -------- ADCHS_ADCDATA12 : (ADCHS Offset: 0xAC0) ( R/ 32)  -------- */
#define ADCHS_ADCDATA12_RESETVALUE            _UINT32_(0x00)                                       /*  (ADCHS_ADCDATA12)   Reset Value */

#define ADCHS_ADCDATA12_DATA_Pos              _UINT32_(0)                                          /* (ADCHS_ADCDATA12)  Position */
#define ADCHS_ADCDATA12_DATA_Msk              (_UINT32_(0xFFFFFFFF) << ADCHS_ADCDATA12_DATA_Pos)   /* (ADCHS_ADCDATA12)  Mask */
#define ADCHS_ADCDATA12_DATA(value)           (ADCHS_ADCDATA12_DATA_Msk & (_UINT32_(value) << ADCHS_ADCDATA12_DATA_Pos)) /* Assignment of value for DATA in the ADCHS_ADCDATA12 register */
#define ADCHS_ADCDATA12_Msk                   _UINT32_(0xFFFFFFFF)                                 /* (ADCHS_ADCDATA12) Register Mask  */


/* -------- ADCHS_ADCDATA13 : (ADCHS Offset: 0xAD0) ( R/ 32)  -------- */
#define ADCHS_ADCDATA13_RESETVALUE            _UINT32_(0x00)                                       /*  (ADCHS_ADCDATA13)   Reset Value */

#define ADCHS_ADCDATA13_DATA_Pos              _UINT32_(0)                                          /* (ADCHS_ADCDATA13)  Position */
#define ADCHS_ADCDATA13_DATA_Msk              (_UINT32_(0xFFFFFFFF) << ADCHS_ADCDATA13_DATA_Pos)   /* (ADCHS_ADCDATA13)  Mask */
#define ADCHS_ADCDATA13_DATA(value)           (ADCHS_ADCDATA13_DATA_Msk & (_UINT32_(value) << ADCHS_ADCDATA13_DATA_Pos)) /* Assignment of value for DATA in the ADCHS_ADCDATA13 register */
#define ADCHS_ADCDATA13_Msk                   _UINT32_(0xFFFFFFFF)                                 /* (ADCHS_ADCDATA13) Register Mask  */


/* -------- ADCHS_ADCDATA14 : (ADCHS Offset: 0xAE0) ( R/ 32)  -------- */
#define ADCHS_ADCDATA14_RESETVALUE            _UINT32_(0x00)                                       /*  (ADCHS_ADCDATA14)   Reset Value */

#define ADCHS_ADCDATA14_DATA_Pos              _UINT32_(0)                                          /* (ADCHS_ADCDATA14)  Position */
#define ADCHS_ADCDATA14_DATA_Msk              (_UINT32_(0xFFFFFFFF) << ADCHS_ADCDATA14_DATA_Pos)   /* (ADCHS_ADCDATA14)  Mask */
#define ADCHS_ADCDATA14_DATA(value)           (ADCHS_ADCDATA14_DATA_Msk & (_UINT32_(value) << ADCHS_ADCDATA14_DATA_Pos)) /* Assignment of value for DATA in the ADCHS_ADCDATA14 register */
#define ADCHS_ADCDATA14_Msk                   _UINT32_(0xFFFFFFFF)                                 /* (ADCHS_ADCDATA14) Register Mask  */


/* -------- ADCHS_ADCDATA15 : (ADCHS Offset: 0xAF0) ( R/ 32)  -------- */
#define ADCHS_ADCDATA15_RESETVALUE            _UINT32_(0x00)                                       /*  (ADCHS_ADCDATA15)   Reset Value */

#define ADCHS_ADCDATA15_DATA_Pos              _UINT32_(0)                                          /* (ADCHS_ADCDATA15)  Position */
#define ADCHS_ADCDATA15_DATA_Msk              (_UINT32_(0xFFFFFFFF) << ADCHS_ADCDATA15_DATA_Pos)   /* (ADCHS_ADCDATA15)  Mask */
#define ADCHS_ADCDATA15_DATA(value)           (ADCHS_ADCDATA15_DATA_Msk & (_UINT32_(value) << ADCHS_ADCDATA15_DATA_Pos)) /* Assignment of value for DATA in the ADCHS_ADCDATA15 register */
#define ADCHS_ADCDATA15_Msk                   _UINT32_(0xFFFFFFFF)                                 /* (ADCHS_ADCDATA15) Register Mask  */


/* -------- ADCHS_ADCDATA16 : (ADCHS Offset: 0xB00) ( R/ 32)  -------- */
#define ADCHS_ADCDATA16_RESETVALUE            _UINT32_(0x00)                                       /*  (ADCHS_ADCDATA16)   Reset Value */

#define ADCHS_ADCDATA16_DATA_Pos              _UINT32_(0)                                          /* (ADCHS_ADCDATA16)  Position */
#define ADCHS_ADCDATA16_DATA_Msk              (_UINT32_(0xFFFFFFFF) << ADCHS_ADCDATA16_DATA_Pos)   /* (ADCHS_ADCDATA16)  Mask */
#define ADCHS_ADCDATA16_DATA(value)           (ADCHS_ADCDATA16_DATA_Msk & (_UINT32_(value) << ADCHS_ADCDATA16_DATA_Pos)) /* Assignment of value for DATA in the ADCHS_ADCDATA16 register */
#define ADCHS_ADCDATA16_Msk                   _UINT32_(0xFFFFFFFF)                                 /* (ADCHS_ADCDATA16) Register Mask  */


